


exports.hexagramExplainFPRjiazhaiData = [
  {
    "name": "乾为天",
    "text": "积善有余庆；女子过刚宜慎重。"
  },
  {
    "name": "坤为地",
    "text": "家庭安稳；婚嫁大吉。"
  },
  {
    "name": "水雷屯",
    "text": "修缮住宅；初婚不和。"
  },
  {
    "name": "山水蒙",
    "text": "君子居吉；婚姻之始。"
  },
  {
    "name": "水天需",
    "text": "平安是福。"
  },
  {
    "name": "天水讼",
    "text": "君子必求淑女。"
  },
  {
    "name": "地水师",
    "text": "旧亲联姻，可喜可贺。"
  },
  {
    "name": "水地比",
    "text": "百年好合。"
  },
  {
    "name": "风天小畜",
    "text": "小康，须防口舌；娶得淑女。"
  },
  {
    "name": "天泽履",
    "text": "门庭严整。"
  },
  {
    "name": "地天泰",
    "text": "盛但须防衰，婚嫁大吉。"
  },
  {
    "name": "天地否",
    "text": "勤俭免祸；比离之象。"
  },
  {
    "name": "天火同人",
    "text": "合家欢喜。"
  },
  {
    "name": "火天大有",
    "text": "积善之家，子孙保之。"
  },
  {
    "name": "地山谦",
    "text": "近山之居，合家平安。"
  },
  {
    "name": "雷地豫",
    "text": "祈神祭祖，可保平安。"
  },
  {
    "name": "泽雷随",
    "text": "防止惊惧。"
  },
  {
    "name": "山风蛊",
    "text": "整顿家风；恐有私情；生育不顺。"
  },
  {
    "name": "地泽临",
    "text": "家业正旺；两姓和合。"
  },
  {
    "name": "风地观",
    "text": "供养神佛。"
  },
  {
    "name": "火雷噬嗑",
    "text": "小心火灾；百年好合。"
  },
  {
    "name": "山火贲",
    "text": "小心火灾。"
  },
  {
    "name": "山地剥",
    "text": "不离己宅，寄居可买。"
  },
  {
    "name": "地雷复",
    "text": "待春再迁；婚嫁初春可成。"
  },
  {
    "name": "天雷无妄",
    "text": "屋运甚旺；门当户对。"
  },
  {
    "name": "山天大畜",
    "text": "家业日隆；婚姻大吉。"
  },
  {
    "name": "山雷颐",
    "text": "小心防火；贤妇从夫。"
  },
  {
    "name": "泽风大过",
    "text": "防止倾斜；老少配婚。"
  },
  {
    "name": "坎为水",
    "text": "邻居营造；亲上加亲。"
  },
  {
    "name": "离为火",
    "text": "贵人之屋；可得继室。"
  },
  {
    "name": "泽山咸",
    "text": "知其所止；两姓和好。"
  },
  {
    "name": "雷风恒",
    "text": "方向不改；百年好合。"
  },
  {
    "name": "天山遁",
    "text": "须防作祟；婚姻不宜。"
  },
  {
    "name": "雷天大壮",
    "text": "小心防火；相敬如宾。"
  },
  {
    "name": "火地晋",
    "text": "阳光之屋。"
  },
  {
    "name": "地火明夷",
    "text": "父子分居为宜；不是明媒正娶。"
  },
  {
    "name": "风火家人",
    "text": "小心火灾；亲上加亲。"
  },
  {
    "name": "火泽睽",
    "text": "迁避为宜；择而娶之。"
  },
  {
    "name": "水山蹇",
    "text": "防水冲损；婚姻有悔。"
  },
  {
    "name": "雷水解",
    "text": "祈祷解厄；婚姻吉祥。"
  },
  {
    "name": "山泽损",
    "text": "地势宜平；夫妇得正。"
  },
  {
    "name": "风雷益",
    "text": "小心风雷；婚姻好合。"
  },
  {
    "name": "泽天夬",
    "text": "须防水患；婚姻不成。"
  },
  {
    "name": "天风姤",
    "text": "小心狂风；婚姻得正。"
  },
  {
    "name": "泽地萃",
    "text": "防水入屋；洁身自爱。"
  },
  {
    "name": "地风升",
    "text": "改造大厦；以妾作嫡。"
  },
  {
    "name": "泽水困",
    "text": "安全第一；女寡之象。"
  },
  {
    "name": "水风井",
    "text": "修屋防水；阴阳得正。"
  },
  {
    "name": "泽火革",
    "text": "小心防火；改娶之象。"
  },
  {
    "name": "火风鼎",
    "text": "小心火灾；正配内助。"
  },
  {
    "name": "震为雷",
    "text": "保护宅基，祭祷为宜；佳偶。"
  },
  {
    "name": "艮为山",
    "text": "不宜改造；命由前定。"
  },
  {
    "name": "风山渐",
    "text": "君子居之；贤女可妻。"
  },
  {
    "name": "雷泽归妹",
    "text": "已婚不宜居母家；勿耽情欲。"
  },
  {
    "name": "雷火丰",
    "text": "宜向东南；天作之合。"
  },
  {
    "name": "火山旅",
    "text": "小心火灾；即日成亲。"
  },
  {
    "name": "巽为风",
    "text": "可以安居；夫唱妇随。"
  },
  {
    "name": "兑为泽",
    "text": "友朋同住；因友成亲。"
  },
  {
    "name": "风水涣",
    "text": "祈神得福；自成佳偶。"
  },
  {
    "name": "水泽节",
    "text": "富有之家；婚姻吉祥。"
  },
  {
    "name": "风泽中孚",
    "text": "诉讼之灾；婚姻致讼。"
  },
  {
    "name": "雷山小过",
    "text": "高处之家；老夫少妻。"
  },
  {
    "name": "水火既济",
    "text": "大厦可居；百年好合。"
  },
  {
    "name": "火水未济",
    "text": "改变方向；门户不合。"
  }
]