


exports.hexagramExplainFPRshentiData = [
  {
    "name": "乾为天",
    "text": "保健有恒。"
  },
  {
    "name": "坤为地",
    "text": "柔软运动。"
  },
  {
    "name": "水雷屯",
    "text": "保存元气。"
  },
  {
    "name": "山水蒙",
    "text": "驱去邪热，可保平安。"
  },
  {
    "name": "水天需",
    "text": "调节饮食，健康有望。"
  },
  {
    "name": "天水讼",
    "text": "预防胜于治疗。"
  },
  {
    "name": "地水师",
    "text": "腹胀之症，调气无忧。"
  },
  {
    "name": "水地比",
    "text": "心腹水肿，宜早求治。"
  },
  {
    "name": "风天小畜",
    "text": "风火之症；小孩吉，大人凶。"
  },
  {
    "name": "天泽履",
    "text": "疏通气血。"
  },
  {
    "name": "地天泰",
    "text": "运动合宜。"
  },
  {
    "name": "天地否",
    "text": "气血不通，节制饮食。"
  },
  {
    "name": "天火同人",
    "text": "燥热之症，另求良医。"
  },
  {
    "name": "火天大有",
    "text": "虚火上升，小心诊治。"
  },
  {
    "name": "地山谦",
    "text": "内郁之症，放宽心胸。"
  },
  {
    "name": "雷地豫",
    "text": "祷告静心。"
  },
  {
    "name": "泽雷随",
    "text": "休养为宜；牢狱之灾。"
  },
  {
    "name": "山风蛊",
    "text": "蛊毒之症，小心咒诅。"
  },
  {
    "name": "地泽临",
    "text": "疾病拖延，不致危险。"
  },
  {
    "name": "风地观",
    "text": "风湿之症，运动调养。"
  },
  {
    "name": "火雷噬嗑",
    "text": "须防郁热；失物不保。"
  },
  {
    "name": "山火贲",
    "text": "郁火上升，慎用寒剂。"
  },
  {
    "name": "山地剥",
    "text": "魂不附体，千万小心。"
  },
  {
    "name": "地雷复",
    "text": "有痰上火，冬令宜防。"
  },
  {
    "name": "天雷无妄",
    "text": "保持运动，自可消化。"
  },
  {
    "name": "山天大畜",
    "text": "健康有力。"
  },
  {
    "name": "山雷颐",
    "text": "上寒下热，五日乃愈。"
  },
  {
    "name": "泽风大过",
    "text": "肝肾皆累，不易治好。"
  },
  {
    "name": "坎为水",
    "text": "水泻之症，虔心祷告。"
  },
  {
    "name": "离为火",
    "text": "热病严重，小心大去。"
  },
  {
    "name": "泽山咸",
    "text": "虚弱宜补。"
  },
  {
    "name": "雷风恒",
    "text": "气喘有痰，仍服旧方。"
  },
  {
    "name": "天山遁",
    "text": "避居吉地。"
  },
  {
    "name": "雷天大壮",
    "text": "保养脚部。"
  },
  {
    "name": "火地晋",
    "text": "自知之明。"
  },
  {
    "name": "地火明夷",
    "text": "肝大郁积，注意保养。"
  },
  {
    "name": "风火家人",
    "text": "痰多气喘，难以根治。"
  },
  {
    "name": "火泽睽",
    "text": "上火下湿，实在难治。"
  },
  {
    "name": "水山蹇",
    "text": "足部有疾，小心保养。"
  },
  {
    "name": "雷水解",
    "text": "药到病除。"
  },
  {
    "name": "山泽损",
    "text": "修身养性。"
  },
  {
    "name": "风雷益",
    "text": "肝火太盛。"
  },
  {
    "name": "泽天夬",
    "text": "调养气息。"
  },
  {
    "name": "天风姤",
    "text": "小心中风。"
  },
  {
    "name": "泽地萃",
    "text": "胸腹水涨，早些调理。"
  },
  {
    "name": "地风升",
    "text": "肝火渐旺，早些调养。"
  },
  {
    "name": "泽水困",
    "text": "肾水已亏，险在眼前。"
  },
  {
    "name": "水风井",
    "text": "肾水过胀，立即调治。"
  },
  {
    "name": "泽火革",
    "text": "肾水干枯，肝火上升。"
  },
  {
    "name": "火风鼎",
    "text": "肝火上冲，顺气以治。"
  },
  {
    "name": "震为雷",
    "text": "肝火太盛，不宜劳累。"
  },
  {
    "name": "艮为山",
    "text": "带病延年。"
  },
  {
    "name": "风山渐",
    "text": "安居调养。"
  },
  {
    "name": "雷泽归妹",
    "text": "大限将至。"
  },
  {
    "name": "雷火丰",
    "text": "肝火上升，静养为宜。"
  },
  {
    "name": "火山旅",
    "text": "肝火过旺，性命交关。"
  },
  {
    "name": "巽为风",
    "text": "可能中风，须人扶行。"
  },
  {
    "name": "兑为泽",
    "text": "熟医可治。"
  },
  {
    "name": "风水涣",
    "text": "病情严重，恐难回天。"
  },
  {
    "name": "水泽节",
    "text": "节制饮食。"
  },
  {
    "name": "风泽中孚",
    "text": "有惊无险。"
  },
  {
    "name": "雷山小过",
    "text": "过寒或过热。"
  },
  {
    "name": "水火既济",
    "text": "大病初愈，仍需自理。"
  },
  {
    "name": "火水未济",
    "text": "血脉不顺，用药谨慎。"
  }
]