


exports.hexagramExplainSYData = [
  {
    "name": "乾为天",
    "text": "吉：得此卦者，天行刚健，自强不息，名利双收之象，宜把握机会，争取成果。女人得此卦则有过于刚直之嫌。"
  },
  {
    "name": "坤为地",
    "text": "吉：得此卦者，宜顺从运势，以静制动，不宜独立谋事，顺从他人，一起合作，可成大事。"
  },
  {
    "name": "水雷屯",
    "text": "凶：得此卦者，身处困境，宜守不宜进，须多加辛苦努力，排除困难，方可通达，有初难后解之象。"
  },
  {
    "name": "山水蒙",
    "text": "小凶：得此卦者，智慧犹如童蒙，不辨是非，迷失方向；若能顺贤师良友之教，启其聪明则亨通。"
  },
  {
    "name": "水天需",
    "text": "小凶：得此卦者，时机尚未成熟，需要耐心等待，急进反会见凶。"
  },
  {
    "name": "天水讼",
    "text": "凶：得此卦者，身心不安，事多不顺，与他人多争诉之事，宜修身养性，谨慎处事。"
  },
  {
    "name": "地水师",
    "text": "小凶：得此卦者，困难重重，忧心劳众，宜包容别人，艰苦努力，摒除一切困难。"
  },
  {
    "name": "水地比",
    "text": "吉：得此卦者，可获朋友之助，众人之力，谋事有成，荣显之极。"
  },
  {
    "name": "风天小畜",
    "text": "小凶：得此卦者，力量薄弱，运势反覆，宜蓄养实力，静待时机，急进则有险，凡事须耐心推进。"
  },
  {
    "name": "天泽履",
    "text": "小凶：得此卦者，困难时期，多坎坷不顺，万事不宜急进，须循序渐进，谨慎行事。"
  },
  {
    "name": "地天泰",
    "text": "吉：得此卦者，否极泰来，鸿运当头，诸事皆顺，但须防乐极生悲。"
  },
  {
    "name": "天地否",
    "text": "凶：得此卦者，万物闭塞之象，上下不合，诸事不顺，凡事宜忍，须待时运好转而有为。"
  },
  {
    "name": "天火同人",
    "text": "吉：得此卦者，吉祥如意，与人合作共事更佳，上下同心，谋事有成。"
  },
  {
    "name": "火天大有",
    "text": "吉：得此卦者，正当好运，事事吉祥，大有收获，但防物极必反，盛极转衰。"
  },
  {
    "name": "地山谦",
    "text": "吉：得此卦者，吉利平安，步步高升。谦虚忍让者前途大好，骄横者必招败。谦受益，满招损。"
  },
  {
    "name": "雷地豫",
    "text": "吉：得此卦者，顺天应时，事事吉祥，可得长辈之助，但须防色难，切不可沉迷于声色欢场之中。"
  },
  {
    "name": "泽雷随",
    "text": "小吉：得此卦者，宜随大势，其事可成。凡事与他人多沟通交流，可名利双收。切不可坚持己见，专横者事不成。"
  },
  {
    "name": "山风蛊",
    "text": "凶：得此卦者，艰难迷惑之时，事事不如意；宜大胆革新，奋发图强，艰苦努力，可转危为安。"
  },
  {
    "name": "地泽临",
    "text": "吉：得此卦者，好运来到，诸事如意，人情和合，但行事不宜过于急进。"
  },
  {
    "name": "风地观",
    "text": "小凶：得此卦者，处身于变化之中，心神不宁，宜多观察入微，待机行事，切勿妄进。"
  },
  {
    "name": "火雷噬嗑",
    "text": "凶：得此卦者，事不遂心，纷争难免，诸事被阻，宜坚守常规，不为利诱，可保平安。"
  },
  {
    "name": "山火贲",
    "text": "小凶：得此卦者，表面风光，内在空虚，多虚少实。宜充实自己，稳重行事，量力而为。"
  },
  {
    "name": "山地剥",
    "text": "凶：得此卦者，时运不佳，多有损失，前进有阻，宜顺时而止，安份自守。"
  },
  {
    "name": "地雷复",
    "text": "小吉：得此卦者，时运好转，顺势而为，谋事可成，但不宜过于急进。"
  },
  {
    "name": "天雷无妄",
    "text": "小吉：得此卦者，顺其自然，守正道者，诸事皆宜。但行为不检者，必招灾祸。"
  },
  {
    "name": "山天大畜",
    "text": "小吉：得此卦者，宜坚守正道，脚踏实地，务实行事，方可成就大业。切勿骄傲自满，目空一切。"
  },
  {
    "name": "山雷颐",
    "text": "小凶：得此卦者，对于言语及饮食，均须谨慎。宜守正道，谨言慎行，心怀阴谋者会招灾祸。"
  },
  {
    "name": "泽风大过",
    "text": "凶：得此卦者，身心不安，事不如意，却又强意而行，大有后悔之时，谨防官非及水险。"
  },
  {
    "name": "坎为水",
    "text": "凶：得此卦者，运气不佳，多难危险，事多困阻，宜谨言慎行，退守保全。"
  },
  {
    "name": "离为火",
    "text": "小吉：得此卦者，宜谦虚谨慎，稳步进取，则前途光明。急进及意气用事者必有所损失。"
  },
  {
    "name": "泽山咸",
    "text": "小吉：得此卦者，宜谦虚待人，则会吉祥如意，谋事可成。但勿为不正当感情而意乱情迷。"
  },
  {
    "name": "雷风恒",
    "text": "小吉：得此卦者，须立身正道，坚守不易，持续努力，必能亨通。缺少毅力，朝三暮四者则不会成功。"
  },
  {
    "name": "天山遁",
    "text": "凶：得此卦者，宜退不宜进。退守可以保身，若轻举妄动则会招灾。宜谨言慎行，待机行事。"
  },
  {
    "name": "雷天大壮",
    "text": "小吉：得此卦者，运势过于强盛，宜心平气和，谨慎行事，否则必生过失。"
  },
  {
    "name": "火地晋",
    "text": "吉：得此卦者，如旭日东升，气运旺盛，收入颇丰，谋事可成，百事如意。"
  },
  {
    "name": "地火明夷",
    "text": "凶：得此卦者，时运不佳，事事劳苦，宜坚守正道，忍耐自重，等待时机。"
  },
  {
    "name": "风火家人",
    "text": "小吉：得此卦者，与人合作共事者会有利，且多有喜事之象，家庭和睦者，能同心协力，发展事业。"
  },
  {
    "name": "火泽睽",
    "text": "凶：得此卦者，运气不佳，水火不容，相互矛盾，诸事难成。"
  },
  {
    "name": "水山蹇",
    "text": "凶：得此卦者，身心忧苦，举步维艰，宜守正道，不可妄动，涉险境者会有灾难。"
  },
  {
    "name": "雷水解",
    "text": "吉：得此卦者，能解脱先前之困难，宜把握良机，求谋事业，出外谋事者更佳。"
  },
  {
    "name": "山泽损",
    "text": "小吉：得此卦者，损己利人，虽然开始会有所不顺，但付出总会有所回报，因祸得福之象。"
  },
  {
    "name": "风雷益",
    "text": "小吉：得此卦者，正当好运，奋发图进，得人帮助，能获名利。"
  },
  {
    "name": "泽天夬",
    "text": "凶：得此卦者，大运将过，困难将至，宜提高警惕，谨言慎行。"
  },
  {
    "name": "天风姤",
    "text": "凶：得此卦者，阴长阳衰，诸事不顺，宜谨慎行事，更应注意桃色纠纷。"
  },
  {
    "name": "泽地萃",
    "text": "吉：得此卦者，运气大好，能得到贵人的帮助，获利丰厚，无往不利。"
  },
  {
    "name": "地风升",
    "text": "吉：得此卦者，运气升腾，诸事皆积极向上发展，谋事有成，名利双收。"
  },
  {
    "name": "泽水困",
    "text": "凶：得此卦者，陷入困境，事事不如意，宜坚守正道，等待时机。"
  },
  {
    "name": "水风井",
    "text": "小吉：得此卦者，宜修身养性，顺其自然，泰然处之，静有利，动则凶。"
  },
  {
    "name": "泽火革",
    "text": "小吉：得此卦者，凡事均在变动之中，宜去旧立新，以应革新之象，则会吉祥。"
  },
  {
    "name": "火风鼎",
    "text": "吉：得此卦者，时运正佳，能得到朋友的帮助，取得不错的成就。与人合伙共事更佳。"
  },
  {
    "name": "震为雷",
    "text": "小吉：得此卦者，奋发振作，大可有为，但表面风光，内恐有难，宜谨言慎行，以免损失。"
  },
  {
    "name": "艮为山",
    "text": "小凶：得此卦者，前路受阻，不宜妄进，宜守待机。"
  },
  {
    "name": "风山渐",
    "text": "小吉：得此卦者，逐步开运，凡事宜循序渐进，则谋事可成，不宜急进，性急则败。"
  },
  {
    "name": "雷泽归妹",
    "text": "凶：得此卦者，困难之时，做事有违常理，灾祸不断。宜明察事理，修身养性，断绝妄念。"
  },
  {
    "name": "雷火丰",
    "text": "小吉：得此卦者，运势正强，谋事可成，名利双收。但不宜过贪，要知足常乐，谨防乐极生悲，损财甚至火险。"
  },
  {
    "name": "火山旅",
    "text": "凶：得此卦者，事多变动，如在异乡，小事可成，大事难成，宜谨守常规。"
  },
  {
    "name": "巽为风",
    "text": "小吉：得此卦者，运势起伏不定，宜随机应变，谦虚行事，则可得意外之收获。"
  },
  {
    "name": "兑为泽",
    "text": "吉：得此卦者，多喜庆之事，人情和合，但应坚守正道，否则犯灾。"
  },
  {
    "name": "风水涣",
    "text": "小吉：得此卦者，初有不顺，但终可解困，凡事宜小心则百事亨通，忌任性放纵。"
  },
  {
    "name": "水泽节",
    "text": "小凶：得此卦者，宜安分守己，切忌贪心不足，诸事必须节制，不宜过份，更要戒酒色。"
  },
  {
    "name": "风泽中孚",
    "text": "小吉：得此卦者，正直诚信者吉利，会得到朋友的帮助，谋事可成；心存邪念者则凶。"
  },
  {
    "name": "雷山小过",
    "text": "凶：得此卦者，诸事不利，宜行小事，不宜成大事，更防因自身的过失惹来是非争讼。"
  },
  {
    "name": "水火既济",
    "text": "小吉：得此卦者，事业有成，成功之象，但谨防盛极必衰，宜退守为吉，再进则凶。"
  },
  {
    "name": "火水未济",
    "text": "小凶：得此卦者，运势不通，诸事不能如愿，宜由小及大，稳步进取，要耐心去突破难关，则终可成功。"
  }
]