


exports.hexagramTextData = [
  {
    "name": "乾为天",
    "text": "元亨利贞。"
  },
  {
    "name": "坤为地",
    "text": "元亨，利牝马之贞。君子有攸往，先迷后得主，利。西南得朋，东北丧朋。安贞吉。"
  },
  {
    "name": "水雷屯",
    "text": "元亨利贞。勿用有攸往，利建侯。"
  },
  {
    "name": "山水蒙",
    "text": "亨。匪我求童蒙，童蒙求我。初噬告，再三渎，渎则不告。利贞。"
  },
  {
    "name": "水天需",
    "text": "有孚，光亨，贞吉。利涉大川。"
  },
  {
    "name": "天水讼",
    "text": "有孚，窒惕，中吉，终凶。利见大人，不利涉大川。"
  },
  {
    "name": "地水师",
    "text": "贞。丈人吉，无咎。"
  },
  {
    "name": "水地比",
    "text": "吉。原筮，元永贞，无咎。不宁方来，后夫凶。"
  },
  {
    "name": "风天小畜",
    "text": "亨。密云不雨，自我西郊。"
  },
  {
    "name": "天泽履",
    "text": "履虎尾，不咥人，亨。"
  },
  {
    "name": "地天泰",
    "text": "小往大来，吉亨。"
  },
  {
    "name": "天地否",
    "text": "否之匪人。不利君子贞，大往小来。"
  },
  {
    "name": "天火同人",
    "text": "同人于野，亨。利涉大川，利君子贞。"
  },
  {
    "name": "火天大有",
    "text": "元亨。"
  },
  {
    "name": "地山谦",
    "text": "亨，君子有终。"
  },
  {
    "name": "雷地豫",
    "text": "利建侯行师。"
  },
  {
    "name": "泽雷随",
    "text": "元亨，利贞，无咎。"
  },
  {
    "name": "山风蛊",
    "text": "元亨，利涉大川。先甲三日，后甲三日。"
  },
  {
    "name": "地泽临",
    "text": "元亨利贞。至于八月有凶。"
  },
  {
    "name": "风地观",
    "text": "盥而不荐，有孚顒若。"
  },
  {
    "name": "火雷噬嗑",
    "text": "亨。利用狱。"
  },
  {
    "name": "山火贲",
    "text": "亨。小利有攸往。"
  },
  {
    "name": "山地剥",
    "text": "不利有攸往。"
  },
  {
    "name": "地雷复",
    "text": "亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。"
  },
  {
    "name": "天雷无妄",
    "text": "元亨利贞。其匪正有眚，不利有攸往。"
  },
  {
    "name": "山天大畜",
    "text": "利贞。不家食，吉。利涉大川。"
  },
  {
    "name": "山雷颐",
    "text": "贞吉。观颐，自求口实。"
  },
  {
    "name": "泽风大过",
    "text": "栋桡。利有攸往，亨。"
  },
  {
    "name": "坎为水",
    "text": "有孚。维心亨，行有尚。"
  },
  {
    "name": "离为火",
    "text": "利贞，亨。畜牝牛，吉。"
  },
  {
    "name": "泽山咸",
    "text": "亨，利贞。取女吉。"
  },
  {
    "name": "雷风恒",
    "text": "亨，无咎，利贞。利有攸往。"
  },
  {
    "name": "天山遁",
    "text": "亨。小利贞。"
  },
  {
    "name": "雷天大壮",
    "text": "利贞。"
  },
  {
    "name": "火地晋",
    "text": "康侯用锡马蕃庶，昼日三接。"
  },
  {
    "name": "地火明夷",
    "text": "利艰贞。"
  },
  {
    "name": "风火家人",
    "text": "利女贞。"
  },
  {
    "name": "火泽睽",
    "text": "小事吉。"
  },
  {
    "name": "水山蹇",
    "text": "利西南，不利东北。利见大人，贞吉。"
  },
  {
    "name": "雷水解",
    "text": "利西南。无所往，其来复吉。有攸往，夙吉。"
  },
  {
    "name": "山泽损",
    "text": "有孚，元吉，无咎，可贞。利有攸往。曷之用？二簋可用享。"
  },
  {
    "name": "风雷益",
    "text": "利有攸往，利涉大川。"
  },
  {
    "name": "泽天夬",
    "text": "扬于王庭。孚号有厉。告自邑，不利即戎，利有攸往。"
  },
  {
    "name": "天风姤",
    "text": "女壮，勿用取女。"
  },
  {
    "name": "泽地萃",
    "text": "亨，王假有庙。利见大人，亨，利贞。用大牲，吉。利有攸往。"
  },
  {
    "name": "地风升",
    "text": "元亨。用见大人，勿恤，南征吉。"
  },
  {
    "name": "泽水困",
    "text": "亨，贞，大人吉，无咎。有言不信。"
  },
  {
    "name": "水风井",
    "text": "改邑不改井，无丧无得。往来井井。汔至亦未繘井，羸其瓶，凶。"
  },
  {
    "name": "泽火革",
    "text": "己日乃孚。元亨利贞。悔亡。"
  },
  {
    "name": "火风鼎",
    "text": "元吉，亨。"
  },
  {
    "name": "震为雷",
    "text": "亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。"
  },
  {
    "name": "艮为山",
    "text": "艮其背，不获其身。行其庭，不见其人。无咎。"
  },
  {
    "name": "风山渐",
    "text": "女归吉，利贞。"
  },
  {
    "name": "雷泽归妹",
    "text": "征凶，无攸利。"
  },
  {
    "name": "雷火丰",
    "text": "亨。王假之，勿忧，宜日中。"
  },
  {
    "name": "火山旅",
    "text": "小亨。旅贞吉。"
  },
  {
    "name": "巽为风",
    "text": "小亨。利有攸往，利见大人。"
  },
  {
    "name": "兑为泽",
    "text": "亨，利，贞。"
  },
  {
    "name": "风水涣",
    "text": "亨。王假有庙。利涉大川，利贞。"
  },
  {
    "name": "水泽节",
    "text": "亨。苦节不可贞。"
  },
  {
    "name": "风泽中孚",
    "text": "豚鱼，吉。利涉大川，利贞。"
  },
  {
    "name": "雷山小过",
    "text": "亨，利贞。可小事，不可大事。飞鸟遗之音。不宜上，宜下，大吉。"
  },
  {
    "name": "水火既济",
    "text": "亨小，利贞。初吉，终乱。"
  },
  {
    "name": "火水未济",
    "text": "亨。小狐汔济，濡其尾，无攸利。"
  }
]