


exports.hexagramTranslationData = [
  {
    "name": "乾为天",
    "text": "创始、通达、合宜、正固。"
  },
  {
    "name": "坤为地",
    "text": "开始，通达，适宜像母马那样的正固。君子有所前往时，领先而走会迷路，随后而走会找到主人，吉利。在西南方得到朋友，在东北方丧失朋友。安于正固就会吉祥。"
  },
  {
    "name": "水雷屯",
    "text": "开始、通达、适宜、正固。不要有所前往，适宜建立侯王。"
  },
  {
    "name": "山水蒙",
    "text": "通达。不是我去求蒙昧的儿童，是蒙昧的儿童来求我。初次占筮，告诉他结果；两次三次占筮，是亵渎神明；亵渎就不告诉他。适宜正固。"
  },
  {
    "name": "水天需",
    "text": "有诚信，光明通达，正固吉祥。适宜渡过大河。"
  },
  {
    "name": "天水讼",
    "text": "有凭证可信，窒塞而须警惕，中间吉祥，最后有凶祸。适宜见到大人，不适宜渡过大河。"
  },
  {
    "name": "地水师",
    "text": "正固。有威望的长者吉祥，没有灾难。"
  },
  {
    "name": "水地比",
    "text": "吉祥。考察占筮，开始而长久正固，没有灾难。从不安定中刚刚转变过来，后到的会有凶祸。"
  },
  {
    "name": "风天小畜",
    "text": "通达。浓云密布而不下雨，从我西边的郊野飘聚过去。"
  },
  {
    "name": "天泽履",
    "text": "踩在老虎尾巴上，老虎不咬人，通达。"
  },
  {
    "name": "地天泰",
    "text": "小的前往，大的来到，吉祥通达。"
  },
  {
    "name": "天地否",
    "text": "否卦违背人的需求。君子正固是不适宜的，大的前往，小的来到。"
  },
  {
    "name": "天火同人",
    "text": "聚合众人于郊野，通达。适宜渡过大河，适宜君子正固。"
  },
  {
    "name": "火天大有",
    "text": "大有卦。最为通达。"
  },
  {
    "name": "地山谦",
    "text": "通达，君子有好的结果。"
  },
  {
    "name": "雷地豫",
    "text": "适宜建立侯王，出兵征伐。"
  },
  {
    "name": "泽雷随",
    "text": "最为通达，适宜正固，没有灾难。"
  },
  {
    "name": "山风蛊",
    "text": "最为通达，适宜渡过大河。开始之前的三天，开始之后的三天。"
  },
  {
    "name": "地泽临",
    "text": "最为通达，适宜正固。到了八月将有凶祸。"
  },
  {
    "name": "风地观",
    "text": "祭祀开始时洗净双手，还未到进献祭品的阶段，心中诚信已经庄严地表现出来。"
  },
  {
    "name": "火雷噬嗑",
    "text": "通达。适宜判决诉讼。"
  },
  {
    "name": "山火贲",
    "text": "通达。小的方面适宜有所前往。"
  },
  {
    "name": "山地剥",
    "text": "不适宜有所前往。"
  },
  {
    "name": "地雷复",
    "text": "通达。外出入内没有疾病，朋友前来没有灾难。在轨道上反复运行，七天回来重新开始。适宜有所前往。"
  },
  {
    "name": "天雷无妄",
    "text": "最为通达，适宜正固。如果不守正就会有危难，不适宜有所前往。"
  },
  {
    "name": "山天大畜",
    "text": "适宜正固。不吃家里的饭，吉祥。适宜渡过大河。"
  },
  {
    "name": "山雷颐",
    "text": "正固吉祥。观察养育状况，自己求取食物。"
  },
  {
    "name": "泽风大过",
    "text": "栋梁弯曲，适宜有所前往，通达。"
  },
  {
    "name": "坎为水",
    "text": "有诚信。因为内心而通达，行动表现了上进。"
  },
  {
    "name": "离为火",
    "text": "适宜正固，通达。畜养母牛，吉祥。"
  },
  {
    "name": "泽山咸",
    "text": "通达，适宜正固。娶妻吉祥。"
  },
  {
    "name": "雷风恒",
    "text": "通达，没有灾难，适宜正固。适宜有所前往。"
  },
  {
    "name": "天山遁",
    "text": "通达。小的一方适宜正固。"
  },
  {
    "name": "雷天大壮",
    "text": "适宜正固。"
  },
  {
    "name": "火地晋",
    "text": "安邦的诸侯受赏众多车马，一日之内获天子接见三次，"
  },
  {
    "name": "地火明夷",
    "text": "适宜在艰难中正固。"
  },
  {
    "name": "风火家人",
    "text": "适宜女子正固。"
  },
  {
    "name": "火泽睽",
    "text": "对小事吉祥。"
  },
  {
    "name": "水山蹇",
    "text": "西南方有利，东北方不利。适宜见到大人，正固吉祥。"
  },
  {
    "name": "雷水解",
    "text": "西南方有利。无所前往，那么返回来就吉祥。有所前往，早些行动吉祥。"
  },
  {
    "name": "山泽损",
    "text": "有诚信，最为吉祥，没有灾难，可以正固。适宜有所前往。要使用什么？二簋就可以用来献祭。"
  },
  {
    "name": "风雷益",
    "text": "适宜有所前往，适宜渡过大河。"
  },
  {
    "name": "泽天夬",
    "text": "在君王朝廷上显扬出来。有诚信而呼号有危险。从封邑前来告知，不适宜出兵作战，适宜有所前往。"
  },
  {
    "name": "天风姤",
    "text": "女子强壮，不要娶这样的女子。"
  },
  {
    "name": "泽地萃",
    "text": "要祭献，君王来到宗庙。适宜见到大人，通达，适宜正固。用大牲去祭祀，吉祥。适宜有所前往。"
  },
  {
    "name": "地风升",
    "text": "最为通达。可以用来见大人，不必担忧，往南前进吉祥。"
  },
  {
    "name": "泽水困",
    "text": "通达，正固，大人吉祥，没有灾难。说了话没有人相信。"
  },
  {
    "name": "水风井",
    "text": "可以迁移村落，但不能移动水井。没有丧失也没有获得。往来井然有序。汲水时，快到而尚未拉出井口，就碰坏了瓶罐，有凶祸。"
  },
  {
    "name": "泽火革",
    "text": "到了己日才有诚信。开始、通达、适宜、正固。懊恼消失。"
  },
  {
    "name": "火风鼎",
    "text": "最为吉祥，通达。"
  },
  {
    "name": "震为雷",
    "text": "通达。震动起来惊慌不安，笑语之声稳定合宜。震动惊传百里之远，祭器祭酒却不失手。"
  },
  {
    "name": "艮为山",
    "text": "止住背部，没有获得身体。走在庭院中，没有见到人。没有灾难。"
  },
  {
    "name": "风山渐",
    "text": "女子出嫁吉祥，适宜正固。"
  },
  {
    "name": "雷泽归妹",
    "text": "前进有凶祸，没有什么适宜的事。"
  },
  {
    "name": "雷火丰",
    "text": "通达。君王将会实现天下丰盛的理想，不用忧虑，适宜太阳在中午的时候。"
  },
  {
    "name": "火山旅",
    "text": "稍有通达。旅行守正就吉祥。"
  },
  {
    "name": "巽为风",
    "text": "稍有通达。适宜有所前往，适宜见到大人。"
  },
  {
    "name": "兑为泽",
    "text": "通达，适宜，正固。"
  },
  {
    "name": "风水涣",
    "text": "通达。君王来到宗庙。适宜渡过大河，适宜正固。"
  },
  {
    "name": "水泽节",
    "text": "通达。苦涩的节制不能正固。"
  },
  {
    "name": "风泽中孚",
    "text": "猪与鱼出现，吉祥。适宜渡过大河，适宜正固。"
  },
  {
    "name": "雷山小过",
    "text": "通达，适宜正固。可以做小事，不可以做大事。有鸟飞过留下的声音。不应该往上走，而应该往下走，非常吉祥，"
  },
  {
    "name": "水火既济",
    "text": "通达小的方面，适宜正固。起初吉祥，最后混乱。"
  },
  {
    "name": "火水未济",
    "text": "通达。小狐狸快要渡过河，浸湿了尾巴，没有适宜的事。"
  }
]