


exports.hexagramExplainFPRshiyunData = [
  {
    "name": "乾为天",
    "text": "临事刚健，自强不息。"
  },
  {
    "name": "坤为地",
    "text": "为人厚道，声名远传。"
  },
  {
    "name": "水雷屯",
    "text": "宜守不宜进。"
  },
  {
    "name": "山水蒙",
    "text": "蓄积德行，出而用世。"
  },
  {
    "name": "水天需",
    "text": "时机尚未成熟，耐心等待。"
  },
  {
    "name": "天水讼",
    "text": "功名受阻，不宜树敌。"
  },
  {
    "name": "地水师",
    "text": "包容别人，修行待时。"
  },
  {
    "name": "水地比",
    "text": "众人相贺，荣显之极。"
  },
  {
    "name": "风天小畜",
    "text": "平平无奇，受人牵制。"
  },
  {
    "name": "天泽履",
    "text": "依序升进，不可攀缘。"
  },
  {
    "name": "地天泰",
    "text": "一切顺利，居安思危。"
  },
  {
    "name": "天地否",
    "text": "诸事不顺，不可妄动。"
  },
  {
    "name": "天火同人",
    "text": "朋友支持，升迁顺利。"
  },
  {
    "name": "火天大有",
    "text": "亨通无比，大放异彩。"
  },
  {
    "name": "地山谦",
    "text": "眼前平顺，步步高升。"
  },
  {
    "name": "雷地豫",
    "text": "春雷发动，诸事吉祥。"
  },
  {
    "name": "泽雷随",
    "text": "明年运行，五年方展。"
  },
  {
    "name": "山风蛊",
    "text": "力图振作，可改旧观。"
  },
  {
    "name": "地泽临",
    "text": "活水流行，好运方来。"
  },
  {
    "name": "风地观",
    "text": "出外游览，不易闲居。"
  },
  {
    "name": "火雷噬嗑",
    "text": "好运初动，声名直上。"
  },
  {
    "name": "山火贲",
    "text": "上有阻力，不可任意。"
  },
  {
    "name": "山地剥",
    "text": "时运不佳，安心自守。"
  },
  {
    "name": "地雷复",
    "text": "好运初来，静待发动。"
  },
  {
    "name": "天雷无妄",
    "text": "正当好运，诸事皆宜。"
  },
  {
    "name": "山天大畜",
    "text": "守静二年，方可展运。"
  },
  {
    "name": "山雷颐",
    "text": "生机显达，谨言慎行。"
  },
  {
    "name": "泽风大过",
    "text": "收敛自省，未可求名。"
  },
  {
    "name": "坎为水",
    "text": "逐步升迁，随时防患。"
  },
  {
    "name": "离为火",
    "text": "努力修德，前途光明。"
  },
  {
    "name": "泽山咸",
    "text": "谦虚待人，可保功名。"
  },
  {
    "name": "雷风恒",
    "text": "努力耕耘，不可躁进。"
  },
  {
    "name": "天山遁",
    "text": "最好退隐，君子有吉。"
  },
  {
    "name": "雷天大壮",
    "text": "成名不难，不可骄傲。"
  },
  {
    "name": "火地晋",
    "text": "好运新来，步步高升。"
  },
  {
    "name": "地火明夷",
    "text": "明哲保身，以避灾厄。"
  },
  {
    "name": "风火家人",
    "text": "旺运当头，言行小心。"
  },
  {
    "name": "火泽睽",
    "text": "上下不通，以正处之。"
  },
  {
    "name": "水山蹇",
    "text": "处于艰困，更加奋勉。"
  },
  {
    "name": "雷水解",
    "text": "灾难已解，声名大起。"
  },
  {
    "name": "山泽损",
    "text": "心平气和，才有发展。"
  },
  {
    "name": "风雷益",
    "text": "得意之时，改旧换新。"
  },
  {
    "name": "泽天夬",
    "text": "气运过盛，散财为吉。"
  },
  {
    "name": "天风姤",
    "text": "正当好运，名扬四海。"
  },
  {
    "name": "泽地萃",
    "text": "安不忘危，自可无忧。"
  },
  {
    "name": "地风升",
    "text": "大地春回，日益高升。"
  },
  {
    "name": "泽水困",
    "text": "身名皆困，不如安命。"
  },
  {
    "name": "水风井",
    "text": "木水相生，功名有望。"
  },
  {
    "name": "泽火革",
    "text": "改变之时，顺时而动。"
  },
  {
    "name": "火风鼎",
    "text": "功名日进，贵不可言。"
  },
  {
    "name": "震为雷",
    "text": "运势正强，谨慎免咎。"
  },
  {
    "name": "艮为山",
    "text": "运势平平，不宜妄进。"
  },
  {
    "name": "风山渐",
    "text": "时来运转，可以得意。"
  },
  {
    "name": "雷泽归妹",
    "text": "进不以道，难以持久。"
  },
  {
    "name": "雷火丰",
    "text": "气势正旺，谨慎小心。"
  },
  {
    "name": "火山旅",
    "text": "谨慎防灾，升用在即。"
  },
  {
    "name": "巽为风",
    "text": "运势顺利，诸事皆宜。"
  },
  {
    "name": "兑为泽",
    "text": "朋友支持，好好珍惜。"
  },
  {
    "name": "风水涣",
    "text": "时来运转，水到渠成。"
  },
  {
    "name": "水泽节",
    "text": "品行端正，名利自成。"
  },
  {
    "name": "风泽中孚",
    "text": "风波难免，小心诉讼。"
  },
  {
    "name": "雷山小过",
    "text": "清高自处，反遭人忌。"
  },
  {
    "name": "水火既济",
    "text": "盛极必衰，谨防后患。"
  },
  {
    "name": "火水未济",
    "text": "运势颠倒，务必谨慎。"
  }
]