


exports.hexagramExplainFPRcaiyunData = [
  {
    "name": "乾为天",
    "text": "施比受有福，不利买而利卖。"
  },
  {
    "name": "坤为地",
    "text": "满载而归。"
  },
  {
    "name": "水雷屯",
    "text": "创业维艰。"
  },
  {
    "name": "山水蒙",
    "text": "矿山生意，果决则吉。"
  },
  {
    "name": "水天需",
    "text": "资本未集，无法开张。"
  },
  {
    "name": "天水讼",
    "text": "开始谨慎，终可获利。"
  },
  {
    "name": "地水师",
    "text": "有财有库，善自珍惜。"
  },
  {
    "name": "水地比",
    "text": "善人相扶，大发利市。"
  },
  {
    "name": "风天小畜",
    "text": "外表不错，内多耗损。"
  },
  {
    "name": "天泽履",
    "text": "明察货品，待时而售。"
  },
  {
    "name": "地天泰",
    "text": "买卖均宜，买入较佳。"
  },
  {
    "name": "天地否",
    "text": "适宜买入，后可获利。"
  },
  {
    "name": "天火同人",
    "text": "合资有利，可以进取。"
  },
  {
    "name": "火天大有",
    "text": "放手去做，财富自来。"
  },
  {
    "name": "地山谦",
    "text": "物价合理，利益保障。"
  },
  {
    "name": "雷地豫",
    "text": "新货上市，必有大利。"
  },
  {
    "name": "泽雷随",
    "text": "堆积存货，明春有利。"
  },
  {
    "name": "山风蛊",
    "text": "不宜堆积，应即贩卖。"
  },
  {
    "name": "地泽临",
    "text": "经营有成，获利可期。"
  },
  {
    "name": "风地观",
    "text": "贩卖洋货，须防风险。"
  },
  {
    "name": "火雷噬嗑",
    "text": "买卖皆成，货物畅销。"
  },
  {
    "name": "山火贲",
    "text": "经理精明，须防套牢。"
  },
  {
    "name": "山地剥",
    "text": "出口获利，剥人之财。"
  },
  {
    "name": "地雷复",
    "text": "暂停售物，必可获利。"
  },
  {
    "name": "天雷无妄",
    "text": "货到财来，自然开心。"
  },
  {
    "name": "山天大畜",
    "text": "暂时株守，良机必至。"
  },
  {
    "name": "山雷颐",
    "text": "内外升降，未必流通。"
  },
  {
    "name": "泽风大过",
    "text": "低价高涨，不易把握。"
  },
  {
    "name": "坎为水",
    "text": "财如流水，商运亨通。"
  },
  {
    "name": "离为火",
    "text": "与火有关，皆有所得。"
  },
  {
    "name": "泽山咸",
    "text": "转运贩卖，必可图利。"
  },
  {
    "name": "雷风恒",
    "text": "贸易之地，不可更改。"
  },
  {
    "name": "天山遁",
    "text": "物价涨跌，相去甚远。"
  },
  {
    "name": "雷天大壮",
    "text": "得价即售，不可过贪。"
  },
  {
    "name": "火地晋",
    "text": "光亮之业，最有利润。"
  },
  {
    "name": "地火明夷",
    "text": "明无利润，暗中分红。"
  },
  {
    "name": "风火家人",
    "text": "囤积货品，后有高价。"
  },
  {
    "name": "火泽睽",
    "text": "人弃我取，尚有小利。"
  },
  {
    "name": "水山蹇",
    "text": "财不流通，难以得利。"
  },
  {
    "name": "雷水解",
    "text": "天时地利，人和为贵。"
  },
  {
    "name": "山泽损",
    "text": "和气生财，损己利人。"
  },
  {
    "name": "风雷益",
    "text": "贸易要快，才有利益。"
  },
  {
    "name": "泽天夬",
    "text": "利己利人，财散人聚。"
  },
  {
    "name": "天风姤",
    "text": "到了远方，自可获利。"
  },
  {
    "name": "泽地萃",
    "text": "财聚之象，有聚有散。"
  },
  {
    "name": "地风升",
    "text": "储蓄积财，可成富人。"
  },
  {
    "name": "泽水困",
    "text": "财乏势危，不如归去。"
  },
  {
    "name": "水风井",
    "text": "利大于本，自然可喜。"
  },
  {
    "name": "泽火革",
    "text": "消耗过多，迁地贸易。"
  },
  {
    "name": "火风鼎",
    "text": "自然得利，不劳而获。"
  },
  {
    "name": "震为雷",
    "text": "所积财物，皆得售出。"
  },
  {
    "name": "艮为山",
    "text": "守好本业，不可贪财。"
  },
  {
    "name": "风山渐",
    "text": "逐渐得利，多行善事。"
  },
  {
    "name": "雷泽归妹",
    "text": "货价尚可，结局未必。"
  },
  {
    "name": "雷火丰",
    "text": "获利甚丰，须防诉讼。"
  },
  {
    "name": "火山旅",
    "text": "出外经营，不可积货。"
  },
  {
    "name": "巽为风",
    "text": "随机应变，获利可期。"
  },
  {
    "name": "兑为泽",
    "text": "有人扶助，获利不难。"
  },
  {
    "name": "风水涣",
    "text": "神明保佑，财源流通。"
  },
  {
    "name": "水泽节",
    "text": "正派经营，富裕可求。"
  },
  {
    "name": "风泽中孚",
    "text": "谨慎行事，可免灾祸。"
  },
  {
    "name": "雷山小过",
    "text": "价格不合，无利可图。"
  },
  {
    "name": "水火既济",
    "text": "及时出手，可得利润。"
  },
  {
    "name": "火水未济",
    "text": "诸事不顺，步步为营。"
  }
]