// 易经数据 - 浏览器兼容版本

var hexagramImagesData = [
  {
    "name": "乾为天",
    "text": "qian_01.png"
  },
  {
    "name": "坤为地",
    "text": "kun_01.png"
  },
  {
    "name": "水雷屯",
    "text": "zhun_01.png"
  },
  {
    "name": "山水蒙",
    "text": "meng_01.png"
  },
  {
    "name": "水天需",
    "text": "xu_01.png"
  },
  {
    "name": "天水讼",
    "text": "song_01.png"
  },
  {
    "name": "地水师",
    "text": "shi_01.png"
  },
  {
    "name": "水地比",
    "text": "bi_01.svg"
  },
  {
    "name": "风天小畜",
    "text": "xiaoxu_01.png"
  },
  {
    "name": "天泽履",
    "text": "lv_01.png"
  },
  {
    "name": "地天泰",
    "text": "tai_01.png"
  },
  {
    "name": "天地否",
    "text": "pi_01.png"
  },
  {
    "name": "天火同人",
    "text": "tongren_01.png"
  },
  {
    "name": "火天大有",
    "text": "dayou_01.png"
  },
  {
    "name": "地山谦",
    "text": "dishanqian_01.png"
  },
  {
    "name": "雷地豫",
    "text": "yu_01.png"
  },
  {
    "name": "泽雷随",
    "text": "sui_01.png"
  },
  {
    "name": "山风蛊",
    "text": "gu_01.png"
  },
  {
    "name": "地泽临",
    "text": "lin_01.png"
  },
  {
    "name": "风地观",
    "text": "guan_01.png"
  },
  {
    "name": "火雷噬嗑",
    "text": "shihe_01.png"
  },
  {
    "name": "山火贲",
    "text": "shanhuobi_01.png"
  },
  {
    "name": "山地剥",
    "text": "bo_01.png"
  },
  {
    "name": "地雷复",
    "text": "fu_01.png"
  },
  {
    "name": "天雷无妄",
    "text": "wuwang_01.png"
  },
  {
    "name": "山天大畜",
    "text": "daxu_01.png"
  },
  {
    "name": "山雷颐",
    "text": "yi_01.png"
  },
  {
    "name": "泽风大过",
    "text": "daguo_01.png"
  },
  {
    "name": "坎为水",
    "text": "kan_01.png"
  },
  {
    "name": "离为火",
    "text": "li_01.png"
  },
  {
    "name": "泽山咸",
    "text": "xian_01.png"
  },
  {
    "name": "雷风恒",
    "text": "heng_01.png"
  },
  {
    "name": "天山遁",
    "text": "dun_01.png"
  },
  {
    "name": "雷天大壮",
    "text": "dazhuang_01.png"
  },
  {
    "name": "火地晋",
    "text": "jin_01.png"
  },
  {
    "name": "地火明夷",
    "text": "mingyi_01.png"
  },
  {
    "name": "风火家人",
    "text": "jiaren_01.png"
  },
  {
    "name": "火泽睽",
    "text": "kui_01.png"
  },
  {
    "name": "水山蹇",
    "text": "jian_01.png"
  },
  {
    "name": "雷水解",
    "text": "jie_01.png"
  },
  {
    "name": "山泽损",
    "text": "sun_01.png"
  },
  {
    "name": "风雷益",
    "text": "fengleiyi_01.png"
  },
  {
    "name": "泽天夬",
    "text": "kuai_01.png"
  },
  {
    "name": "天风姤",
    "text": "gou_01.png"
  },
  {
    "name": "泽地萃",
    "text": "cui_01.png"
  },
  {
    "name": "地风升",
    "text": "sheng_01.png"
  },
  {
    "name": "泽水困",
    "text": "zeshuikun_01.png"
  },
  {
    "name": "水风井",
    "text": "jing_01.png"
  },
  {
    "name": "泽火革",
    "text": "ge_01.png"
  },
  {
    "name": "火风鼎",
    "text": "ding_01.png"
  },
  {
    "name": "震为雷",
    "text": "zhen_01.png"
  },
  {
    "name": "艮为山",
    "text": "gen_01.png"
  },
  {
    "name": "风山渐",
    "text": "fengshanjian_01.png"
  },
  {
    "name": "雷泽归妹",
    "text": "guimei_01.png"
  },
  {
    "name": "雷火丰",
    "text": "feng_01.png"
  },
  {
    "name": "火山旅",
    "text": "huoshanlv_01.png"
  },
  {
    "name": "巽为风",
    "text": "xun_01.png"
  },
  {
    "name": "兑为泽",
    "text": "dui_01.png"
  },
  {
    "name": "风水涣",
    "text": "huan_01.png"
  },
  {
    "name": "水泽节",
    "text": "shuizejie_01.png"
  },
  {
    "name": "风泽中孚",
    "text": "zhongfu_01.png"
  },
  {
    "name": "雷山小过",
    "text": "xiaoguo_01.png"
  },
  {
    "name": "水火既济",
    "text": "jiji_01.png"
  },
  {
    "name": "火水未济",
    "text": "weiji_01.png"
  }
];

var hexagramTextData = [
  {
    "name": "乾为天",
    "text": "元亨利贞。"
  },
  {
    "name": "坤为地",
    "text": "元亨，利牝马之贞。君子有攸往，先迷后得主，利。西南得朋，东北丧朋。安贞吉。"
  },
  {
    "name": "水雷屯",
    "text": "元亨利贞。勿用有攸往，利建侯。"
  },
  {
    "name": "山水蒙",
    "text": "亨。匪我求童蒙，童蒙求我。初噬告，再三渎，渎则不告。利贞。"
  },
  {
    "name": "水天需",
    "text": "有孚，光亨，贞吉。利涉大川。"
  },
  {
    "name": "天水讼",
    "text": "有孚，窒惕，中吉，终凶。利见大人，不利涉大川。"
  },
  {
    "name": "地水师",
    "text": "贞。丈人吉，无咎。"
  },
  {
    "name": "水地比",
    "text": "吉。原筮，元永贞，无咎。不宁方来，后夫凶。"
  },
  {
    "name": "风天小畜",
    "text": "亨。密云不雨，自我西郊。"
  },
  {
    "name": "天泽履",
    "text": "履虎尾，不咥人，亨。"
  },
  {
    "name": "地天泰",
    "text": "小往大来，吉亨。"
  },
  {
    "name": "天地否",
    "text": "否之匪人。不利君子贞，大往小来。"
  },
  {
    "name": "天火同人",
    "text": "同人于野，亨。利涉大川，利君子贞。"
  },
  {
    "name": "火天大有",
    "text": "元亨。"
  },
  {
    "name": "地山谦",
    "text": "亨，君子有终。"
  },
  {
    "name": "雷地豫",
    "text": "利建侯行师。"
  },
  {
    "name": "泽雷随",
    "text": "元亨，利贞，无咎。"
  },
  {
    "name": "山风蛊",
    "text": "元亨，利涉大川。先甲三日，后甲三日。"
  },
  {
    "name": "地泽临",
    "text": "元亨利贞。至于八月有凶。"
  },
  {
    "name": "风地观",
    "text": "盥而不荐，有孚顒若。"
  },
  {
    "name": "火雷噬嗑",
    "text": "亨。利用狱。"
  },
  {
    "name": "山火贲",
    "text": "亨。小利有攸往。"
  },
  {
    "name": "山地剥",
    "text": "不利有攸往。"
  },
  {
    "name": "地雷复",
    "text": "亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。"
  },
  {
    "name": "天雷无妄",
    "text": "元亨利贞。其匪正有眚，不利有攸往。"
  },
  {
    "name": "山天大畜",
    "text": "利贞。不家食，吉。利涉大川。"
  },
  {
    "name": "山雷颐",
    "text": "贞吉。观颐，自求口实。"
  },
  {
    "name": "泽风大过",
    "text": "栋桡。利有攸往，亨。"
  },
  {
    "name": "坎为水",
    "text": "有孚。维心亨，行有尚。"
  },
  {
    "name": "离为火",
    "text": "利贞，亨。畜牝牛，吉。"
  },
  {
    "name": "泽山咸",
    "text": "亨，利贞。取女吉。"
  },
  {
    "name": "雷风恒",
    "text": "亨，无咎，利贞。利有攸往。"
  },
  {
    "name": "天山遁",
    "text": "亨。小利贞。"
  },
  {
    "name": "雷天大壮",
    "text": "利贞。"
  },
  {
    "name": "火地晋",
    "text": "康侯用锡马蕃庶，昼日三接。"
  },
  {
    "name": "地火明夷",
    "text": "利艰贞。"
  },
  {
    "name": "风火家人",
    "text": "利女贞。"
  },
  {
    "name": "火泽睽",
    "text": "小事吉。"
  },
  {
    "name": "水山蹇",
    "text": "利西南，不利东北。利见大人，贞吉。"
  },
  {
    "name": "雷水解",
    "text": "利西南。无所往，其来复吉。有攸往，夙吉。"
  },
  {
    "name": "山泽损",
    "text": "有孚，元吉，无咎，可贞。利有攸往。曷之用？二簋可用享。"
  },
  {
    "name": "风雷益",
    "text": "利有攸往，利涉大川。"
  },
  {
    "name": "泽天夬",
    "text": "扬于王庭。孚号有厉。告自邑，不利即戎，利有攸往。"
  },
  {
    "name": "天风姤",
    "text": "女壮，勿用取女。"
  },
  {
    "name": "泽地萃",
    "text": "亨，王假有庙。利见大人，亨，利贞。用大牲，吉。利有攸往。"
  },
  {
    "name": "地风升",
    "text": "元亨。用见大人，勿恤，南征吉。"
  },
  {
    "name": "泽水困",
    "text": "亨，贞，大人吉，无咎。有言不信。"
  },
  {
    "name": "水风井",
    "text": "改邑不改井，无丧无得。往来井井。汔至亦未繘井，羸其瓶，凶。"
  },
  {
    "name": "泽火革",
    "text": "己日乃孚。元亨利贞。悔亡。"
  },
  {
    "name": "火风鼎",
    "text": "元吉，亨。"
  },
  {
    "name": "震为雷",
    "text": "亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。"
  },
  {
    "name": "艮为山",
    "text": "艮其背，不获其身。行其庭，不见其人。无咎。"
  },
  {
    "name": "风山渐",
    "text": "女归吉，利贞。"
  },
  {
    "name": "雷泽归妹",
    "text": "征凶，无攸利。"
  },
  {
    "name": "雷火丰",
    "text": "亨。王假之，勿忧，宜日中。"
  },
  {
    "name": "火山旅",
    "text": "小亨。旅贞吉。"
  },
  {
    "name": "巽为风",
    "text": "小亨。利有攸往，利见大人。"
  },
  {
    "name": "兑为泽",
    "text": "亨，利，贞。"
  },
  {
    "name": "风水涣",
    "text": "亨。王假有庙。利涉大川，利贞。"
  },
  {
    "name": "水泽节",
    "text": "亨。苦节不可贞。"
  },
  {
    "name": "风泽中孚",
    "text": "豚鱼，吉。利涉大川，利贞。"
  },
  {
    "name": "雷山小过",
    "text": "亨，利贞。可小事，不可大事。飞鸟遗之音。不宜上，宜下，大吉。"
  },
  {
    "name": "水火既济",
    "text": "亨小，利贞。初吉，终乱。"
  },
  {
    "name": "火水未济",
    "text": "亨。小狐汔济，濡其尾，无攸利。"
  }
];

var yaoTextData = [
  {
    "name": "乾为天",
    "yao": [
      "初九：潜龙勿用。",
      "九二：见龙在田，利见大人。",
      "九三：君子终日乾乾，夕惕若，厉，无咎。",
      "九四：或跃在渊，无咎。",
      "九五：飞龙在天，利见大人。",
      "上九：亢龙有悔。"
    ]
  },
  {
    "name": "坤为地",
    "yao": [
      "初六：履霜，坚冰至。",
      "六二：直方大，不习，无不利。",
      "六三：含章可贞，或从王事，无成有终。",
      "六四：括囊，无咎无誉。",
      "六五：黄裳，元吉。",
      "上六：龙战于野，其血玄黄。"
    ]
  },
  {
    "name": "水雷屯",
    "yao": [
      "初九：磐桓，利居贞，利建侯。",
      "六二：屯如邅如，乘马班如。匪寇，婚媾，女子贞不字，十年乃字。",
      "六三：即鹿无虞，惟入于林中，君子几，不如舍，往吝。",
      "六四：乘马班如，求婚媾，往吉，无不利。",
      "九五：屯其膏，小贞吉，大贞凶。",
      "上六：乘马班如，泣血涟如。"
    ]
  },
  {
    "name": "山水蒙",
    "yao": [
      "初六：发蒙，利用刑人，用说桎梏。以往，吝。",
      "九二：包蒙，吉。纳妇，吉。子克家。",
      "六三：勿用取女，见金夫，不有躬。无攸利。",
      "六四：困蒙，吝。",
      "六五：童蒙，吉。",
      "上九：击蒙。不利为寇，利御寇。"
    ]
  },
  {
    "name": "水天需",
    "yao": [
      "初九：需于郊，利用恒，无咎。",
      "九二：需于沙，小有言，终吉。",
      "九三：需于泥，致寇至。",
      "六四：需于血，出自穴。",
      "九五：需于酒食，贞吉。",
      "上六：入于穴，有不速之客三人来，敬之终吉。"
    ]
  },
  {
    "name": "天水讼",
    "yao": [
      "初六：不永所事，小有言，终吉。",
      "九二：不克讼，归而逋，其邑人三百户无眚。",
      "六三：食旧德，贞厉，终吉。或从王事，无成。",
      "九四：不克讼，复即命，渝安贞，吉。",
      "九五：讼，元吉。",
      "上九：或锡之鞶带，终朝三褫之。"
    ]
  },
  {
    "name": "地水师",
    "yao": [
      "初六：师出以律，否臧，凶。",
      "九二：在师中，吉无咎，王三锡命。",
      "六三：师或舆尸，凶。",
      "六四：师左次，无咎。",
      "六五：田有禽，利执言，无咎。长子帅师，弟子舆尸，贞凶。",
      "上六：大君有命，开国承家，小人勿用。"
    ]
  },
  {
    "name": "水地比",
    "yao": [
      "初六：有孚比之，无咎。有孚盈缶，终来有它吉。",
      "六二：比之自内，贞吉。",
      "六三：比之匪人。",
      "六四：外比之，贞吉。",
      "九五：显比，王用三驱，失前禽。邑人不诫，吉。",
      "上六：比之无首，凶。"
    ]
  },
  {
    "name": "风天小畜",
    "yao": [
      "初九：复自道，何其咎？吉。",
      "九二：牵复，吉。",
      "九三：舆说辐，夫妻反目。",
      "六四：有孚，血去惕出，无咎。",
      "九五：有孚挛如，富以其邻。",
      "上九：既雨既处，尚德载。妇贞厉。月几望，君子征凶。"
    ]
  },
  {
    "name": "天泽履",
    "yao": [
      "初九：素履往，无咎。",
      "九二：履道坦坦，幽人贞吉。",
      "六三：眇能视，跛能履。履虎尾，咥人，凶。武人为于大君。",
      "九四：履虎尾，愬愬终吉。",
      "九五：夬履贞厉。",
      "上九：视履考祥，其旋元吉。"
    ]
  },
  {
    "name": "地天泰",
    "yao": [
      "初九：拔茅茹，以其汇，征吉。",
      "九二：包荒，用冯河，不遐遗，朋亡，得尚于中行。",
      "九三：无平不陂，无往不复。艰贞无咎。勿恤其孚，于食有福。",
      "六四：翩翩不富以其邻，不戒以孚。",
      "六五：帝乙归妹，以祉元吉。",
      "上六：城复于隍，勿用师。自邑告命，贞吝。"
    ]
  },
  {
    "name": "天地否",
    "yao": [
      "初六：拔茅茹，以其汇，贞吉，亨。",
      "六二：包承，小人吉，大人否，亨。",
      "六三：包羞。",
      "九四：有命无咎，畴离祉。",
      "九五：休否，大人吉。其亡其亡，系于苞桑。",
      "上九：倾否，先否后喜。"
    ]
  },
  {
    "name": "天火同人",
    "yao": [
      "初九：同人于门，无咎。",
      "六二：同人于宗，吝。",
      "九三：伏戎于莽，升其高陵，三岁不兴。",
      "九四：乘其墉，弗克攻，吉。",
      "九五：同人，先号咷而后笑，大师克相遇。",
      "上九：同人于郊，无悔。"
    ]
  },
  {
    "name": "火天大有",
    "yao": [
      "初九：无交害，匪咎，艰则无咎。",
      "九二：大车以载，有攸往，无咎。",
      "九三：公用亨于天子，小人弗克。",
      "九四：匪其彭，无咎。",
      "六五：厥孚交如，威如，吉。",
      "上九：自天佑之，吉无不利。"
    ]
  },
  {
    "name": "地山谦",
    "yao": [
      "初六：谦谦君子，用涉大川，吉。",
      "六二：鸣谦，贞吉。",
      "九三：劳谦君子，有终，吉。",
      "六四：无不利，㧑谦。",
      "六五：不富以其邻，利用侵伐，无不利。",
      "上六：鸣谦，利用行师，征邑国。"
    ]
  },
  {
    "name": "雷地豫",
    "yao": [
      "初六：鸣豫，凶。",
      "六二：介于石，不终日，贞吉。",
      "六三：盱豫，悔。迟有悔。",
      "九四：由豫，大有得。勿疑，朋盍簪。",
      "六五：贞疾，恒不死。",
      "上六：冥豫，成有渝。无咎。"
    ]
  },
  {
    "name": "泽雷随",
    "yao": [
      "初九：官有渝，贞吉。出门交有功。",
      "六二：系小子，失丈夫。",
      "六三：系丈夫，失小子。随有求，得，利居贞。",
      "九四：随有获，贞凶。有孚，在道以明，何咎。",
      "九五：孚于嘉，吉。",
      "上六：拘系之，乃从维之。王用亨于西山。"
    ]
  },
  {
    "name": "山风蛊",
    "yao": [
      "初六：干父之蛊，有子，考无咎。厉终吉。",
      "九二：干母之蛊，不可贞。",
      "九三：干父之蛊，小有悔，无大咎。",
      "六四：裕父之蛊，往见吝。",
      "六五：干父之蛊，用誉。",
      "上九：不事王侯，高尚其事。"
    ]
  },
  {
    "name": "地泽临",
    "yao": [
      "初九：咸临，贞吉。",
      "九二：咸临，吉，无不利。",
      "六三：甘临。无攸利。既忧之，无咎。",
      "六四：至临，无咎。",
      "六五：知临，大君之宜，吉。",
      "上六：敦临，吉，无咎。"
    ]
  },
  {
    "name": "风地观",
    "yao": [
      "初六：童观，小人无咎，君子吝。",
      "六二：窥观，利女贞。",
      "六三：观我生，进退。",
      "六四：观国之光，利用宾于王。",
      "九五：观我生，君子无咎。",
      "上九：观其生，君子无咎。"
    ]
  },
  {
    "name": "火雷噬嗑",
    "yao": [
      "初九：屦校灭趾，无咎。",
      "六二：噬肤灭鼻，无咎。",
      "六三：噬腊肉，遇毒。小吝，无咎。",
      "九四：噬干胏，得金矢。利艰贞，吉。",
      "六五：噬干肉，得黄金。贞厉，无咎。",
      "上九：何校灭耳，凶。"
    ]
  },
  {
    "name": "山火贲",
    "yao": [
      "初九：贲其趾，舍车而徒。",
      "六二：贲其须。",
      "九三：贲如，濡如，永贞吉。",
      "六四：贲如，皤如，白马翰如，匪寇婚媾。",
      "六五：贲于丘园，束帛戋戋。吝，终吉。",
      "上九：白贲，无咎。"
    ]
  },
  {
    "name": "山地剥",
    "yao": [
      "初六：剥床以足，蔑贞，凶。",
      "六二：剥床以辨，蔑贞，凶。",
      "六三：剥之，无咎。",
      "六四：剥床以肤，凶。",
      "六五：贯鱼。以宫人宠，无不利。",
      "上九：硕果不食，君子得舆，小人剥庐。"
    ]
  },
  {
    "name": "地雷复",
    "yao": [
      "初九：不远复，无祗悔，元吉。",
      "六二：休复，吉。",
      "六三：频复，厉，无咎。",
      "六四：中行独复。",
      "六五：敦复，无悔。",
      "上六：迷复，凶。有灾眚。用行师，终有大败，以其国君凶，至于十年不克征。"
    ]
  },
  {
    "name": "天雷无妄",
    "yao": [
      "初九：无妄，往吉。",
      "六二：不耕获，不菑畬，则利有攸往。",
      "六三：无妄之灾。或系之牛，行人之得，邑人之灾。",
      "九四：可贞，无咎。",
      "九五：无妄之疾，勿药有喜。",
      "上九：无妄，行有眚，无攸利。"
    ]
  },
  {
    "name": "山天大畜",
    "yao": [
      "初九：有厉，利已。",
      "九二：舆说輹。",
      "九三：良马逐，利艰贞。日闲舆卫，利有攸往。",
      "六四：童牛之牿，元吉。",
      "六五：豮豕之牙，吉。",
      "上九：何天之衢，亨。"
    ]
  },
  {
    "name": "山雷颐",
    "yao": [
      "初九：舍尔灵龟，观我朵颐，凶。",
      "六二：颠颐，拂经；于丘颐，征凶。",
      "六三：拂颐，贞凶。十年勿用，无攸利。",
      "六四：颠颐，吉。虎视眈眈，其欲逐逐，无咎。",
      "六五：拂经，居贞吉。不可涉大川。",
      "上九：由颐，厉吉。利涉大川。"
    ]
  },
  {
    "name": "泽风大过",
    "yao": [
      "初六：藉用白茅，无咎。",
      "九二：枯杨生稊，老夫得其女妻，无不利。",
      "九三：栋桡凶。",
      "九四：栋隆吉。有它吝。",
      "九五：枯杨生华，老妇得其士夫，无咎无誉。",
      "上六：过涉灭顶，凶，无咎。"
    ]
  },
  {
    "name": "坎为水",
    "yao": [
      "初六：习坎，入于坎窞。凶。",
      "九二：坎有险，求小得。",
      "六三：来之坎坎，险且枕，入于坎窞，勿用。",
      "六四：樽酒簋贰，用缶，纳约自牖，终无咎。",
      "九五：坎不盈，祗既平。无咎。",
      "上六：系用徽𬙊，寘于丛棘，三岁不得，凶。"
    ]
  },
  {
    "name": "离为火",
    "yao": [
      "初九：履错然，敬之，无咎。",
      "六二：黄离，元吉。",
      "九三：日昃之离。不鼓缶而歌，则大耋之嗟，凶。",
      "九四：突如其来如，焚如，死如，弃如。",
      "六五：出涕沱若，戚嗟若，吉。",
      "上九：王用出征，有嘉。折首，获匪其丑，无咎。"
    ]
  },
  {
    "name": "泽山咸",
    "yao": [
      "初六：咸其拇。",
      "六二：咸其腓，凶，居吉。",
      "九三：咸其股，执其随，往吝。",
      "九四：贞吉悔亡，憧憧往来，朋从尔思。",
      "九五：咸其脢，无悔。",
      "上六：咸其辅颊舌。"
    ]
  },
  {
    "name": "雷风恒",
    "yao": [
      "初六：浚恒，贞凶，无攸利。",
      "九二：悔亡。",
      "九三：不恒其德，或承之羞，贞吝。",
      "九四：田无禽。",
      "六五：恒其德，贞。妇人吉，夫子凶。",
      "上六：振恒，凶。"
    ]
  },
  {
    "name": "天山遁",
    "yao": [
      "初六：遁尾，厉。勿用有攸往。",
      "六二：执之用黄牛之革，莫之胜说。",
      "九三：系遁，有疾厉。畜臣妾，吉。",
      "九四：好遁。君子吉，小人否。",
      "九五：嘉遁，贞吉。",
      "上九：肥遁，无不利。"
    ]
  },
  {
    "name": "雷天大壮",
    "yao": [
      "初九：壮于趾，征凶，有孚。",
      "九二：贞吉。",
      "九三：小人用壮，君子用罔，贞厉。羝羊触藩，羸其角。",
      "九四：贞吉悔亡。藩决不羸，壮于大舆之輹。",
      "六五：丧羊于易，无悔。",
      "上六：羝羊触藩，不能退，不能遂，无攸利。艰则吉。"
    ]
  },
  {
    "name": "火地晋",
    "yao": [
      "初六：晋如，摧如，贞吉。罔孚，裕，无咎。",
      "六二：晋如，愁如，贞吉。受兹介福，于其王母。",
      "六三：众允，悔亡。",
      "九四：晋如硕鼠，贞厉。",
      "六五：悔亡，失得勿恤，往吉，无不利。",
      "上九：晋其角，维用伐邑。厉吉无咎，贞吝。"
    ]
  },
  {
    "name": "地火明夷",
    "yao": [
      "初九：明夷于飞，垂其翼。君子于行，三日不食。有攸往，主人有言。",
      "六二：明夷，夷于左股，用拯马壮，吉。",
      "九三：明夷于南狩，得其大首，不可疾，贞。",
      "六四：入于左腹，获明夷之心，于出门庭。",
      "六五：箕子之明夷，利贞。",
      "上六：不明，晦。初登于天，后入于地。"
    ]
  },
  {
    "name": "风火家人",
    "yao": [
      "初九：闲有家，悔亡。",
      "六二：无攸遂，在中馈。贞吉。",
      "九三：家人嗃嗃，悔厉，吉。妇子嘻嘻，终吝。",
      "六四：富家，大吉。",
      "九五：王假有家，勿恤，吉。",
      "上九：有孚威如，终吉。"
    ]
  },
  {
    "name": "火泽睽",
    "yao": [
      "初九：悔亡，丧马勿逐，自复。见恶人，无咎。",
      "九二：遇主于巷，无咎。",
      "六三：见舆曳，其牛掣。其人天且劓，无初有终。",
      "九四：睽孤，遇元夫。交孚，厉无咎。",
      "六五：悔亡，厥宗噬肤，往何咎？",
      "上九：睽孤，见豕负涂，载鬼一车。先张之弧，后说之弧。匪寇婚媾，往遇雨则吉。"
    ]
  },
  {
    "name": "水山蹇",
    "yao": [
      "初六：往蹇来誉。",
      "六二：王臣蹇蹇，匪躬之故。",
      "九三：往蹇来反。",
      "六四：往蹇来连。",
      "九五：大蹇，朋来。",
      "上六：往蹇来硕，吉。利见大人。"
    ]
  },
  {
    "name": "雷水解",
    "yao": [
      "初六：无咎。",
      "九二：田获三狐，得黄矢，贞吉。",
      "六三：负且乘，致寇至，贞吝。",
      "九四：解而拇，朋至斯孚。",
      "六五：君子维有解，吉，有孚于小人。",
      "上六：公用射隼于高墉之上，获之无不利。"
    ]
  },
  {
    "name": "山泽损",
    "yao": [
      "初九：已事遄往，无咎。酌损之。",
      "九二：利贞，征凶。弗损，益之。",
      "六三：三人行，则损一人；一人行，则得其友。",
      "六四：损其疾，使遄有喜，无咎。",
      "六五：或益之十朋之龟，弗克违，元吉。",
      "上九：弗损，益之，无咎，贞吉。利有攸往，得臣无家。"
    ]
  },
  {
    "name": "风雷益",
    "yao": [
      "初九：利用为大作，元吉，无咎。",
      "六二：或益之十朋之龟，弗克违，永贞吉。王用享于帝，吉。",
      "六三：益之用凶事，无咎。有孚中行，告公用圭。",
      "六四：中行，告公从，利用为依迁国。",
      "九五：有孚惠心，勿问元吉。有孚惠我德。",
      "上九：莫益之，或击之，立心勿恒，凶。"
    ]
  },
  {
    "name": "泽天夬",
    "yao": [
      "初九：壮于前趾，往不胜为咎。",
      "九二：惕号，莫夜有戎，勿恤。",
      "九三：壮于頄，有凶。君子夬夬独行，遇雨若濡，有愠，无咎。",
      "九四：臀无肤，其行次且。牵羊悔亡，闻言不信。",
      "九五：苋陆夬夬，中行无咎。",
      "上六：无号，终有凶。"
    ]
  },
  {
    "name": "天风姤",
    "yao": [
      "初六：系于金柅，贞吉。有攸往，见凶。羸豕孚蹢躅。",
      "九二：包有鱼，无咎，不利宾。",
      "九三：臀无肤，其行次且。厉，无大咎。",
      "九四：包无鱼，起凶。",
      "九五：以杞包瓜，含章，有陨自天。",
      "上九：姤其角，吝，无咎。"
    ]
  },
  {
    "name": "泽地萃",
    "yao": [
      "初六：有孚不终，乃乱乃萃。若号，一握为笑。勿恤，往无咎。",
      "六二：引吉，无咎。孚乃利用禴。",
      "六三：萃如，嗟如，无攸利。往无咎，小吝。",
      "九四：大吉，无咎。",
      "九五：萃有位，无咎，匪孚。元永贞，悔亡。",
      "上六：赍咨涕洟，无咎。"
    ]
  },
  {
    "name": "地风升",
    "yao": [
      "初六：允升，大吉。",
      "九二：孚乃利用禴，无咎。",
      "九三：升虚邑。",
      "六四：王用亨于岐山，吉，无咎。",
      "六五：贞吉，升阶。",
      "上六：冥升，利于不息之贞。"
    ]
  },
  {
    "name": "泽水困",
    "yao": [
      "初六：臀困于株木，入于幽谷，三岁不觌。",
      "九二：困于酒食，朱绂方来，利用亨祀。征凶，无咎。",
      "六三：困于石，据于蒺藜。入于其宫，不见其妻，凶。",
      "九四：来徐徐，困于金车，吝，有终。",
      "九五：劓刖，困于赤绂。乃徐，有说，利用祭祀。",
      "上六：困于葛藟，于臲卼，曰动悔。有悔，征吉。"
    ]
  },
  {
    "name": "水风井",
    "yao": [
      "初六：井泥不食，旧井无禽。",
      "九二：井谷射鲋，瓮敝漏。",
      "九三：井渫不食，为我心恻。可用汲，王明，并受其福。",
      "六四：井甃，无咎。",
      "九五：井冽寒泉，食。",
      "上六：井收勿幕，有孚元吉。"
    ]
  },
  {
    "name": "泽火革",
    "yao": [
      "初九：巩用黄牛之革。",
      "六二：己日乃革之。征吉，无咎。",
      "九三：征凶贞厉。革言三就，有孚。",
      "九四：悔亡，有孚，改命，吉。",
      "九五：大人虎变，未占有孚。",
      "上六：君子豹变，小人革面。征凶，居贞吉。"
    ]
  },
  {
    "name": "火风鼎",
    "yao": [
      "初六：鼎颠趾，利出否。得妾以其子，无咎。",
      "九二：鼎有实，我仇有疾，不我能即，吉。",
      "九三：鼎耳革，其行塞，雉膏不食。方雨，亏悔，终吉。",
      "九四：鼎折足，覆公餗，其形渥，凶。",
      "六五：鼎黄耳金铉，利贞。",
      "上九：鼎玉铉，大吉，无不利。"
    ]
  },
  {
    "name": "震为雷",
    "yao": [
      "初九：震来虩虩，后笑言哑哑，吉。",
      "六二：震来厉，亿丧贝。跻于九陵，勿逐，七日得。",
      "六三：震苏苏，震行无眚。",
      "九四：震遂泥。",
      "六五：震往来厉，亿无丧，有事。",
      "上六：震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。"
    ]
  },
  {
    "name": "艮为山",
    "yao": [
      "初六：艮其趾，无咎。利永贞。",
      "六二：艮其腓，不拯其随，其心不快。",
      "九三：艮其限，列其夤，厉薰心。",
      "六四：艮其身，无咎。",
      "六五：艮其辅，言有序，悔亡。",
      "上九：敦艮，吉。"
    ]
  },
  {
    "name": "风山渐",
    "yao": [
      "初六：鸿渐于干，小子厉，有言，无咎。",
      "六二：鸿渐于磐，饮食衎衎，吉。",
      "九三：鸿渐于陆，夫征不复，妇孕不育，凶；利御寇。",
      "六四：鸿渐于木，或得其桷，无咎。",
      "九五：鸿渐于陵，妇三岁不孕，终莫之胜，吉。",
      "上九：鸿渐于陆，其羽可用为仪，吉。"
    ]
  },
  {
    "name": "雷泽归妹",
    "yao": [
      "初九：归妹以娣，跛能履，征吉。",
      "九二：眇能视，利幽人之贞。",
      "六三：归妹以须，反归以娣。",
      "九四：归妹愆期，迟归有时。",
      "六五：帝乙归妹，其君之袂，不如其娣之袂良。月几望，吉。",
      "上六：女承筐无实，士刲羊无血，无攸利。"
    ]
  },
  {
    "name": "雷火丰",
    "yao": [
      "初九：遇其配主，虽旬无咎，往有尚。",
      "六二：丰其蔀，日中见斗。往得疑疾。有孚发若，吉。",
      "九三：丰其沛，日中见沬。折其右肱，无咎。",
      "九四：丰其蔀，日中见斗。遇其夷主，吉。",
      "六五：来章，有庆誉，吉。",
      "上六：丰其屋，蔀其家，窥其户，阒其无人，三岁不觌，凶。"
    ]
  },
  {
    "name": "火山旅",
    "yao": [
      "初六：旅琐琐，斯其所取灾。",
      "六二：旅即次，怀其资，得童仆，贞。",
      "九三：旅焚其次，丧其童仆，贞厉。",
      "九四：旅于处，得其资斧，我心不快。",
      "六五：射雉，一矢亡，终以誉命。",
      "上九：鸟焚其巢，旅人先笑后号啕。丧牛于易，凶。"
    ]
  },
  {
    "name": "巽为风",
    "yao": [
      "初六：进退，利武人之贞。",
      "九二：巽在床下，用史巫纷若，吉，无咎。",
      "九三：频巽，吝。",
      "六四：悔亡，田获三品。",
      "九五：贞吉，悔亡，无不利。无初有终。先庚三日，后庚三日，吉。",
      "上九：巽在床下，丧其资斧，贞凶。"
    ]
  },
  {
    "name": "兑为泽",
    "yao": [
      "初九：和兑，吉。",
      "九二：孚兑，吉，悔亡。",
      "六三：来兑，凶。",
      "九四：商兑未宁，介疾有喜。",
      "九五：孚于剥，有厉。",
      "上六：引兑。"
    ]
  },
  {
    "name": "风水涣",
    "yao": [
      "初六：用拯马壮，吉。",
      "九二：涣奔其机，悔亡。",
      "六三：涣其躬，无悔。",
      "六四：涣其群，元吉。涣有丘，匪夷所思。",
      "九五：涣汗，其大号涣，王居，无咎。",
      "上九：涣其血，去逖出，无咎。"
    ]
  },
  {
    "name": "水泽节",
    "yao": [
      "初九：不出户庭，无咎。",
      "九二：不出门庭，凶。",
      "六三：不节若，则嗟若，无咎。",
      "六四：安节，亨。",
      "九五：甘节，吉，往有尚。",
      "上六：苦节，贞凶，悔亡。"
    ]
  },
  {
    "name": "风泽中孚",
    "yao": [
      "初九：虞吉，有它不燕。",
      "九二：鸣鹤在阴，其子和之。我有好爵，吾与尔靡之。",
      "六三：得敌，或鼓或罢，或泣或歌。",
      "六四：月既望，马匹亡，无咎。",
      "九五：有孚挛如，无咎。",
      "上九：翰音登于天，贞凶。"
    ]
  },
  {
    "name": "雷山小过",
    "yao": [
      "初六：飞鸟以凶。",
      "六二：过其祖，遇其妣；不及其君，遇其臣，无咎。",
      "九三：弗过防之，从或戕之，凶。",
      "九四：无咎，弗过遇之，往厉必戒。勿用，永贞。",
      "六五：密云不雨，自我西郊。公弋取彼在穴。",
      "上六：弗遇过之，飞鸟离之，凶。是谓灾眚。"
    ]
  },
  {
    "name": "水火既济",
    "yao": [
      "初九：曳其轮，濡其尾，无咎。",
      "六二：妇丧其茀，勿逐，七日得。",
      "九三：高宗伐鬼方，三年克之。小人勿用。",
      "六四：繻有衣袽，终日戒。",
      "九五：东邻杀牛，不如西邻之禴祭，实受其福。",
      "上六：濡其首，厉。"
    ]
  },
  {
    "name": "火水未济",
    "yao": [
      "初六：濡其尾，吝。",
      "九二：曳其轮，贞吉。",
      "六三：未济征凶。利涉大川。",
      "九四：贞吉悔亡，震用伐鬼方。三年有赏于大国。",
      "六五：贞吉无悔，君子之光。有孚，吉。",
      "上九：有孚于饮酒，无咎。濡其首，有孚失是。"
    ]
  }
];

var hexagramTranslationData = [
  {
    "name": "乾为天",
    "text": "创始、通达、合宜、正固。"
  },
  {
    "name": "坤为地",
    "text": "开始，通达，适宜像母马那样的正固。君子有所前往时，领先而走会迷路，随后而走会找到主人，吉利。在西南方得到朋友，在东北方丧失朋友。安于正固就会吉祥。"
  },
  {
    "name": "水雷屯",
    "text": "开始、通达、适宜、正固。不要有所前往，适宜建立侯王。"
  },
  {
    "name": "山水蒙",
    "text": "通达。不是我去求蒙昧的儿童，是蒙昧的儿童来求我。初次占筮，告诉他结果；两次三次占筮，是亵渎神明；亵渎就不告诉他。适宜正固。"
  },
  {
    "name": "水天需",
    "text": "有诚信，光明通达，正固吉祥。适宜渡过大河。"
  },
  {
    "name": "天水讼",
    "text": "有凭证可信，窒塞而须警惕，中间吉祥，最后有凶祸。适宜见到大人，不适宜渡过大河。"
  },
  {
    "name": "地水师",
    "text": "正固。有威望的长者吉祥，没有灾难。"
  },
  {
    "name": "水地比",
    "text": "吉祥。考察占筮，开始而长久正固，没有灾难。从不安定中刚刚转变过来，后到的会有凶祸。"
  },
  {
    "name": "风天小畜",
    "text": "通达。浓云密布而不下雨，从我西边的郊野飘聚过去。"
  },
  {
    "name": "天泽履",
    "text": "踩在老虎尾巴上，老虎不咬人，通达。"
  },
  {
    "name": "地天泰",
    "text": "小的前往，大的来到，吉祥通达。"
  },
  {
    "name": "天地否",
    "text": "否卦违背人的需求。君子正固是不适宜的，大的前往，小的来到。"
  },
  {
    "name": "天火同人",
    "text": "聚合众人于郊野，通达。适宜渡过大河，适宜君子正固。"
  },
  {
    "name": "火天大有",
    "text": "大有卦。最为通达。"
  },
  {
    "name": "地山谦",
    "text": "通达，君子有好的结果。"
  },
  {
    "name": "雷地豫",
    "text": "适宜建立侯王，出兵征伐。"
  },
  {
    "name": "泽雷随",
    "text": "最为通达，适宜正固，没有灾难。"
  },
  {
    "name": "山风蛊",
    "text": "最为通达，适宜渡过大河。开始之前的三天，开始之后的三天。"
  },
  {
    "name": "地泽临",
    "text": "最为通达，适宜正固。到了八月将有凶祸。"
  },
  {
    "name": "风地观",
    "text": "祭祀开始时洗净双手，还未到进献祭品的阶段，心中诚信已经庄严地表现出来。"
  },
  {
    "name": "火雷噬嗑",
    "text": "通达。适宜判决诉讼。"
  },
  {
    "name": "山火贲",
    "text": "通达。小的方面适宜有所前往。"
  },
  {
    "name": "山地剥",
    "text": "不适宜有所前往。"
  },
  {
    "name": "地雷复",
    "text": "通达。外出入内没有疾病，朋友前来没有灾难。在轨道上反复运行，七天回来重新开始。适宜有所前往。"
  },
  {
    "name": "天雷无妄",
    "text": "最为通达，适宜正固。如果不守正就会有危难，不适宜有所前往。"
  },
  {
    "name": "山天大畜",
    "text": "适宜正固。不吃家里的饭，吉祥。适宜渡过大河。"
  },
  {
    "name": "山雷颐",
    "text": "正固吉祥。观察养育状况，自己求取食物。"
  },
  {
    "name": "泽风大过",
    "text": "栋梁弯曲，适宜有所前往，通达。"
  },
  {
    "name": "坎为水",
    "text": "有诚信。因为内心而通达，行动表现了上进。"
  },
  {
    "name": "离为火",
    "text": "适宜正固，通达。畜养母牛，吉祥。"
  },
  {
    "name": "泽山咸",
    "text": "通达，适宜正固。娶妻吉祥。"
  },
  {
    "name": "雷风恒",
    "text": "通达，没有灾难，适宜正固。适宜有所前往。"
  },
  {
    "name": "天山遁",
    "text": "通达。小的一方适宜正固。"
  },
  {
    "name": "雷天大壮",
    "text": "适宜正固。"
  },
  {
    "name": "火地晋",
    "text": "安邦的诸侯受赏众多车马，一日之内获天子接见三次，"
  },
  {
    "name": "地火明夷",
    "text": "适宜在艰难中正固。"
  },
  {
    "name": "风火家人",
    "text": "适宜女子正固。"
  },
  {
    "name": "火泽睽",
    "text": "对小事吉祥。"
  },
  {
    "name": "水山蹇",
    "text": "西南方有利，东北方不利。适宜见到大人，正固吉祥。"
  },
  {
    "name": "雷水解",
    "text": "西南方有利。无所前往，那么返回来就吉祥。有所前往，早些行动吉祥。"
  },
  {
    "name": "山泽损",
    "text": "有诚信，最为吉祥，没有灾难，可以正固。适宜有所前往。要使用什么？二簋就可以用来献祭。"
  },
  {
    "name": "风雷益",
    "text": "适宜有所前往，适宜渡过大河。"
  },
  {
    "name": "泽天夬",
    "text": "在君王朝廷上显扬出来。有诚信而呼号有危险。从封邑前来告知，不适宜出兵作战，适宜有所前往。"
  },
  {
    "name": "天风姤",
    "text": "女子强壮，不要娶这样的女子。"
  },
  {
    "name": "泽地萃",
    "text": "要祭献，君王来到宗庙。适宜见到大人，通达，适宜正固。用大牲去祭祀，吉祥。适宜有所前往。"
  },
  {
    "name": "地风升",
    "text": "最为通达。可以用来见大人，不必担忧，往南前进吉祥。"
  },
  {
    "name": "泽水困",
    "text": "通达，正固，大人吉祥，没有灾难。说了话没有人相信。"
  },
  {
    "name": "水风井",
    "text": "可以迁移村落，但不能移动水井。没有丧失也没有获得。往来井然有序。汲水时，快到而尚未拉出井口，就碰坏了瓶罐，有凶祸。"
  },
  {
    "name": "泽火革",
    "text": "到了己日才有诚信。开始、通达、适宜、正固。懊恼消失。"
  },
  {
    "name": "火风鼎",
    "text": "最为吉祥，通达。"
  },
  {
    "name": "震为雷",
    "text": "通达。震动起来惊慌不安，笑语之声稳定合宜。震动惊传百里之远，祭器祭酒却不失手。"
  },
  {
    "name": "艮为山",
    "text": "止住背部，没有获得身体。走在庭院中，没有见到人。没有灾难。"
  },
  {
    "name": "风山渐",
    "text": "女子出嫁吉祥，适宜正固。"
  },
  {
    "name": "雷泽归妹",
    "text": "前进有凶祸，没有什么适宜的事。"
  },
  {
    "name": "雷火丰",
    "text": "通达。君王将会实现天下丰盛的理想，不用忧虑，适宜太阳在中午的时候。"
  },
  {
    "name": "火山旅",
    "text": "稍有通达。旅行守正就吉祥。"
  },
  {
    "name": "巽为风",
    "text": "稍有通达。适宜有所前往，适宜见到大人。"
  },
  {
    "name": "兑为泽",
    "text": "通达，适宜，正固。"
  },
  {
    "name": "风水涣",
    "text": "通达。君王来到宗庙。适宜渡过大河，适宜正固。"
  },
  {
    "name": "水泽节",
    "text": "通达。苦涩的节制不能正固。"
  },
  {
    "name": "风泽中孚",
    "text": "猪与鱼出现，吉祥。适宜渡过大河，适宜正固。"
  },
  {
    "name": "雷山小过",
    "text": "通达，适宜正固。可以做小事，不可以做大事。有鸟飞过留下的声音。不应该往上走，而应该往下走，非常吉祥，"
  },
  {
    "name": "水火既济",
    "text": "通达小的方面，适宜正固。起初吉祥，最后混乱。"
  },
  {
    "name": "火水未济",
    "text": "通达。小狐狸快要渡过河，浸湿了尾巴，没有适宜的事。"
  }
];

var yaoTranslationData = [
  {
    "name": "乾为天",
    "yao": [
      "龙潜伏着，不要有所作为。",
      "龙出现在地上，适宜见到大人。",
      "君子整天勤奋不休，晚上还戒惕谨慎，有危险，但没有灾难。",
      "或往上跃升，或留在深渊，没有灾难。",
      "龙飞翔在天空，适宜见到大人。",
      "龙飞得太高，已经有所懊悔。"
    ]
  },
  {
    "name": "坤为地",
    "yao": [
      "脚下踏着霜，坚冰将会到来。",
      "直接产生，遍及四方，广大无边，不必修习，无不有利。",
      "蕴涵文采而可以正固。或者跟随君王做事，没有功业却有好的结局。",
      "扎起口袋，没有灾难也没有称誉。",
      "黄色的衣裙，最为吉祥。",
      "龙在郊野争战，它的血是青黄色的。"
    ]
  },
  {
    "name": "水雷屯",
    "yao": [
      "徘徊不进，适宜守住正固，适宜建立侯王。",
      "困难重重，徘徊难行，骑上马也是团团打转。要是没有盗贼，就前去结婚了。女子守正而不出嫁，十年才可出嫁。",
      "追逐野鹿却没有猎官带领，这样只会困处于山林中。君子察知几微，不如放弃算了。前往会有困难。",
      "骑上马而团团打转。若是要求结婚，前往是吉祥的，没有什么不适宜。",
      "囤积恩泽，小规模的正固是吉祥的，大规模的正固就有凶祸。",
      "骑着马团团打转，哭泣得血泪涟涟。"
    ]
  },
  {
    "name": "山水蒙",
    "yao": [
      "启发蒙昧，适宜用刑罚来规范人们，借此让他们摆脱桎梏。依此有所前往，会陷入困难。",
      "包容蒙昧，吉祥。容纳妇人，吉祥。儿子能够持家。",
      "不要娶这个女子，她见到有钱的男子，就会失身。娶她没有任何好处。",
      "困处于蒙昧之中，有困难。",
      "蒙昧的儿童，吉祥。",
      "击走蒙昧。不适宜做强盗，适宜抵御强盗。"
    ]
  },
  {
    "name": "水天需",
    "yao": [
      "在郊野等待，适宜守常不动，没有灾难。",
      "在沙滩上等待，有些小的责难，最后吉祥。",
      "在泥沼中等待，招来了强盗。",
      "在血泊中等待，从洞穴中逃出来。",
      "在享用酒食中等待，正固吉祥。",
      "进入洞穴中，有不请自来的三个客人到了，尊敬他们，最后吉祥。"
    ]
  },
  {
    "name": "天水讼",
    "yao": [
      "不要把事情做到底，有小的责难，最后吉祥。",
      "争讼没有成功，回来躲避，他采邑的三百户人口没有灾害。",
      "享用祖先的余荫，守住正固，有危险，最后吉祥。或者跟随君王做事，没有成就。",
      "争讼没有成功，返回到自己命定的角色，变得安于正固，吉祥。",
      "争讼，最为吉祥",
      "或许受赐官服大带，但是一天之内被剥夺三次。"
    ]
  },
  {
    "name": "地水师",
    "yao": [
      "军队出动要按照军纪，不顺从的，将有凶祸。",
      "率领军队而能守中，吉祥而没有灾难，君王三次赐命嘉奖。",
      "军队或许会载着尸体回来，凶祸。",
      "军队后退驻扎，没有灾难。",
      "田里有禽兽，适宜说明捕获的理由，没有灾难。长子统率军队，弟子载尸而归，正固会有凶祸。",
      "天子颁赐爵命，封为诸侯可以开国，封为大夫可以立家，对小人则不要任用。"
    ]
  },
  {
    "name": "水地比",
    "yao": [
      "有诚信，去亲近依靠，没有灾难。有诚信如同瓦罐盈满，会有另外的吉祥最后来到。",
      "从内部去亲近依靠，正固吉祥。",
      "亲近依靠的都是不适当的人。",
      "向外去亲近依靠，正固吉祥。",
      "发扬亲近依靠的作风。君王用三驱之礼狩猎，失去往前跑的禽兽。国中的人没有戒惧，吉祥。",
      "要亲近依靠却没有开始的机会，凶祸。"
    ]
  },
  {
    "name": "风天小畜",
    "yao": [
      "循着正路回来，会有什么灾难？吉祥。",
      "由牵连而回来，吉祥。",
      "大车脱落辐条，夫妻反目失和。",
      "有诚信，避开流血并走出戒惧，没有灾难。",
      "有诚信而系念着，要与邻居一起富裕。",
      "已经下了雨，已经可以安居，要推崇道德满载。妇女正固会有危险。月亮快要满盈，君子前进会遭凶祸。"
    ]
  },
  {
    "name": "天泽履",
    "yao": [
      "按平常的践履方式前往，没有灾难。",
      "所走的路平坦宽阔，幽隐的人正固吉祥。",
      "眼有疾还能看，脚跛了还能走。踩在老虎尾巴上，老虎咬人，凶祸。勇武之人要做大王。",
      "踩在老虎尾巴上，戒慎恐惧，最后吉祥。",
      "刚决履行，正固有危险。",
      "审视走过的路，考察吉凶祸福，如此返回最为吉祥。"
    ]
  },
  {
    "name": "地天泰",
    "yao": [
      "拔取茅草，根茎牵连着同类，向前推进而吉祥。",
      "包容广阔，徒步过河，不因遥远而有所遗漏，失去朋党，守中而行受到推崇。",
      "没有只平坦而不倾斜的，没有只前往而不返回的。在艰难中正固没有灾难。不必担忧，保持诚信，在食物上有福可享。",
      "轻松而不靠财富就得到邻居支持，由于诚信而不加戒备。",
      "帝乙嫁来妹妹，以此得福最为吉祥。",
      "城墙倒塌在壕沟里，不要出动军队。从乡邑传来命令，正固将有困准"
    ]
  },
  {
    "name": "天地否",
    "yao": [
      "拔取茅草，根茎牵连着同类，正固吉祥，通达。",
      "包容承载，小人吉祥，大人闭塞，通达。",
      "包藏羞耻。",
      "有所受命，没有灾难，众人依附而得福。",
      "终止闭塞，大人吉祥。想到要灭亡了，要灭亡了，这样才会系在大桑树上。",
      "倾覆闭塞的现象，先闭塞然后喜悦。"
    ]
  },
  {
    "name": "天火同人",
    "yao": [
      "在门外聚合众人，没有责难。",
      "在宗族里聚合众人，鄙陋。",
      "在草莽中埋伏士兵，或者登上高陵瞻望，三年不能发动攻击。",
      "登上城墙，却不能进攻，吉祥。",
      "聚合众人，先是痛哭后是欢笑，大部队能够会合。",
      "聚合众人于郊外，没有懊恼。"
    ]
  },
  {
    "name": "火天大有",
    "yao": [
      "没有因为交往所带来的害处，这不是灾难，在艰困中就没有灾难。",
      "用大车来装载，有所前往，没有灾难。",
      "公侯接受天子的款待，小人不能如此。",
      "不仗恃他的盛大，没有灾难。",
      "以诚信来交往的样子，展现威望的样子，吉祥。",
      "获得天的助佑，吉祥而无所不利。"
    ]
  },
  {
    "name": "地山谦",
    "yao": [
      "谦而又谦的君子，可以渡过大河，吉祥。",
      "响应谦卑的态度，正固吉祥。",
      "有功劳而谦卑的君子，有好结果，吉祥。",
      "没有任何不适宜的事，只要发挥谦卑的精神。",
      "不靠财富就得到邻居支持，适宜进行征战，没有不利的事。",
      "响应谦卑的态度，适宜派遣军队，讨伐属邑小国。"
    ]
  },
  {
    "name": "雷地豫",
    "yao": [
      "响应愉悦的态度，有凶祸。",
      "耿介如坚石，不用一整天，正固吉祥。",
      "向上瞻望而愉悦，懊恼。行动迟缓也有懊恼。",
      "由此而产生愉悦。大有收获。不必疑虑，朋友都来聚合。",
      "正固会有疾病，但总不至于死亡。",
      "在昏昧中愉悦，最后出现改变。没有灾难。"
    ]
  },
  {
    "name": "泽雷随",
    "yao": [
      "官员有变通，正固吉祥。出门与人交往会有功绩。",
      "系住小孩，失去丈夫。",
      "系住丈夫，失去小孩。随从而有所求，可以得到。适宜守住正固。",
      "随从而有收获，正固带来凶祸。保持诚信，以明智处于正道，会有什么灾难？",
      "对美善之事保持诚信，吉祥。",
      "把他抓住捆起来，后来又放开他。君王在西山献祭。"
    ]
  },
  {
    "name": "山风蛊",
    "yao": [
      "救治父亲留下的积弊，才是好儿子，他使亡父没有受人责难。这样做会有危险，但最后吉祥。",
      "救治母亲留下的积弊，不可正固。",
      "救治父亲留下的积弊，有小的懊恼，没有大的灾难。",
      "宽容对待父亲留下的积弊，前往会陷入困境。",
      "救治父亲留下的积弊，受到称誉。",
      "不去侍奉王候，以高尚来要求自己的作为。"
    ]
  },
  {
    "name": "地泽临",
    "yao": [
      "一起来临，正固吉祥。",
      "一起来临，吉祥，没有不适宜的。",
      "以和柔态度对待来临者，没有什么利益。已经对此忧虑，就没有灾难了。",
      "直接面对来临者，没有灾难。",
      "以明智态度面对来临者，这是伟大君主的合宜表现，吉祥。",
      "以敦厚态度面对来临者，吉祥，没有灾难。"
    ]
  },
  {
    "name": "风地观",
    "yao": [
      "像孩童那样观看，小人没有灾难，君子就有困难，",
      "从门缝向外观看，适宜女子正固。",
      "观察我的生民，再决定该进或该退。",
      "观察国家的政教光辉，适宜从政追随君王。",
      "观察我的生民，君子没有灾难。",
      "观察他的生民，君子没有灾难。"
    ]
  },
  {
    "name": "火雷噬嗑",
    "yao": [
      "戴上脚枷，遮住脚趾，没有灾难。",
      "咬食肥肉，鼻子没入，没有灾难。",
      "咬食腊肉，遇到有毒的部分。有小的困难，没有灾难。",
      "咬食骨头上的干肉，获得金属箭头。适宜在艰难中正固，吉祥。",
      "咬食干肉，获得黄金。正固有危险，但没有灾难。",
      "肩扛着枷，遮住耳朵，有凶祸。"
    ]
  },
  {
    "name": "山火贲",
    "yao": [
      "文饰脚趾，舍弃车子而徒步行走。",
      "文饰胡须。",
      "有文饰的样子，润泽的样子，长久正固吉祥。",
      "有文饰的样子，洁白的样子，白马壮硕的样子。不是强盗，而是来求婚配的。",
      "所文饰的是丘山田园，只用很少的一束布帛。有困难，最后吉祥。",
      "用白色来文饰，没有灾难。"
    ]
  },
  {
    "name": "山地剥",
    "yao": [
      "剥蚀床脚，除去正固，有凶祸。",
      "剥蚀床腿，除去正固，有凶祸。",
      "剥蚀它，没有灾难。",
      "剥蚀床席，有凶祸。",
      "连成一串鱼。以宫人身份获得宠爱，没有不利。",
      "硕大的果子没有人吃，在君子将获得车马，在小人将剥除屋宇。"
    ]
  },
  {
    "name": "地雷复",
    "yao": [
      "走得不远就返回，没有到懊恼的程度，最为吉祥。",
      "停下来返回，吉祥。",
      "再三地返回，有危险但没有灾难。",
      "走在行列中间而独自返回。",
      "敦厚地返回，没有懊恼。",
      "在迷惑中返回，有凶祸。出现危难与灾祸。发动军队作战，最后会大败，对国君的凶祸最大，甚至十年之内都不能再用兵。"
    ]
  },
  {
    "name": "天雷无妄",
    "yao": [
      "没有虚妄，前往吉祥。",
      "不耕种却有收获，不垦荒却有热田，那就适宜前往了。",
      "没有虚妄却遇上灾难。有人拴了一头牛，过路人把它牵走，村里人遭殃。",
      "可以正固，没有灾难。",
      "没有虚妄却生了病，不用吃药也会痊愈。",
      "没有虚妄，行动会遇到灾祸，没有任何好处。"
    ]
  },
  {
    "name": "山天大畜",
    "yao": [
      "有危险，适宜停止。",
      "车厢脱离了车轴。",
      "骏马奔驰，适宜在艰难中正固。每天练习驾车与防卫，适宜有所前往。",
      "小牛在角上绑了横木，最为吉祥。",
      "阉猪口中的牙，吉祥。",
      "位处上天所赐的通路，通达。"
    ]
  },
  {
    "name": "山雷颐",
    "yao": [
      "抛弃你的大乌龟，看着我嚼食东西，有凶祸。",
      "颠倒养育方式，违背了常理；往高处求养育，前进有凶祸。",
      "违背养育方式，正固有凶祸。十年不能有所作为，没有任何适宜的事。",
      "颠倒养育方式，吉祥。像老虎般瞪视，欲望接连而来，没有灾难。",
      "违背常理，守住正固就吉祥。不可以渡过大河。",
      "由此而得养育，危险而吉祥。适宜渡过大河。"
    ]
  },
  {
    "name": "泽风大过",
    "yao": [
      "用白色茅草垫在底下，没有灾难。",
      "干枯的杨树长出新的枝叶，老头子获得少女为妻，没有不适宜的事。",
      "栋梁弯曲，有凶祸。",
      "栋梁隆起，吉祥。会有别的困难。",
      "干枯的杨树长出花朵，老妇人获得壮男为夫，没有责难也没有荣誉。",
      "发大水时渡河，淹没了头顶，有凶祸，但没有责难。"
    ]
  },
  {
    "name": "坎为水",
    "yao": [
      "在重重险阻中，掉入陷阱。有凶祸。",
      "坎陷中出现险阻，求取小的会有收获。",
      "来去都是险阻，险难还到处遍布。掉入陷阱，不可有所作为。",
      "一盅酒与两盘供品，用瓦盆盛着。从窗户送进简约的祭品，终究没有灾难。",
      "坎陷尚未满盈，抵达齐平的程度。没有灾难。",
      "用绳索捆绑起来，放在牢狱中，三年不能出来，有凶祸。"
    ]
  },
  {
    "name": "离为火",
    "yao": [
      "脚步中规中矩。采取恭敬态度，没有灾难。",
      "黄色的附丽，最为吉祥。",
      "太阳西斜的附丽。不能敲着瓦盆唱歌，就会发出垂老之人的哀叹，有凶祸。",
      "贸然闯进来的样子，灼热的样子，没命的样子，被弃的样子。",
      "眼泪涌出的样子，悲痛哀叹的样子。吉祥。",
      "君王可以出兵征伐，会有功劳。斩了首领，俘获的不是一般随从，没有灾难。"
    ]
  },
  {
    "name": "泽山咸",
    "yao": [
      "感应到脚的拇指。",
      "感应到小腿肚上，有凶祸，安居就会吉祥。",
      "感应到了大腿，控制住跟随的动作，前往会有困难。",
      "正固吉祥而懊恼消失，忙着来来往往，朋友跟从你的想法。",
      "感应到了后背上，没有懊恼。",
      "感应到牙床、脸颊、舌头。"
    ]
  },
  {
    "name": "雷风恒",
    "yao": [
      "深入追求恒久，正固会有凶祸，没有任何适宜的事。",
      "懊恼消失。",
      "不能恒守德行的人，常常会受到羞辱，正固会有困难。",
      "打猎而没有获得禽兽。",
      "恒守自己的德行，正固。对女子吉祥，对男子有凶祸。",
      "震动长久不停，有凶祸。"
    ]
  },
  {
    "name": "天山遁",
    "yao": [
      "退避时居后尾随，有危险。不可以有所前往。",
      "用黄牛皮制成的绳子捆住，没有人能够解开。",
      "系住退避，出现疾病与危险。蓄养奴仆侍妾，吉祥。",
      "合宜的退避。君子吉祥，小人困阻。",
      "美好的退避，正固吉祥。",
      "高飞而走的退避，无所不利。"
    ]
  },
  {
    "name": "雷天大壮",
    "yao": [
      "强壮在脚趾上，前进会有凶祸，但仍有信实。",
      "正固吉祥。",
      "小人仗恃的是强壮，君子凭借的是蔑视，正固会有危险。公羊冲撞藩篱，卡住了羊角。",
      "正固吉祥而懊恼消失，藩篱裂开不再缠住，因为大车的车輹十分坚固。",
      "在边界失去羊，没有懊恼。",
      "公羊冲撞藩篱，不能退后，也不能如意，没有任何适宜的事。在艰难中才会吉祥。"
    ]
  },
  {
    "name": "火地晋",
    "yao": [
      "进展的样子，拥挤的样子，正固吉祥。未受信任，宽裕，没有灾难。",
      "进展的样子，忧愁的样子，正固吉祥。从王母那儿蒙受这样的大福。",
      "众人答应追随，懊恼消失。",
      "进展像梧鼠一样，正固会有危险。",
      "懊恼消失，不用顾虑损失与获得，前往吉祥，没有不适宜的事。",
      "进展到头上的角，可以用来征伐属国。有危险，吉祥而没有灾难，正固会有困难。"
    ]
  },
  {
    "name": "地火明夷",
    "yao": [
      "在昏暗中去飞翔，垂下翅膀。君子要出行，三天不吃东西。有所前往，主人说出责怪的话。",
      "在昏暗中，伤到左股，用来拯救的马强壮，吉祥。",
      "在昏暗中，去南方狩猎，获得大首领，不可过于急切，要正固。",
      "进入到左腹部，得知昏暗者的心思，往外走出门庭。",
      "像箕子那样处于昏暗中，适宜正固。",
      "没有任何光明，一片晦暗。起初升到天上，后来陷入地下。"
    ]
  },
  {
    "name": "风火家人",
    "yao": [
      "家中做好防范措施，懊恼消失。",
      "不可随心所欲，要主持家庭中的饮食。正固吉祥。",
      "家中有训斥之声，会带来懊恼及危险，但还是吉祥。若是妇女孩子放肆嬉笑，最终会有困难。",
      "使家庭富裕，非常吉祥。",
      "君王来到家中，不必忧愁，吉祥。",
      "有诚信而有威严的样子，最终吉祥。"
    ]
  },
  {
    "name": "火泽睽",
    "yao": [
      "懊恼消失，丢失的马不必追寻，自己会回来。见到恶人，没有灾难。",
      "在巷子中遇见主人，没有灾难。",
      "看到车往前拉，牛却往后拖。车夫受过断发割鼻的刑罚，起初不好而最后有结果。",
      "乖离而孤独，遇到有为之士。互相信任，有危险但没有灾难。",
      "懊恼消失，他的宗人在吃肉，前往有什么灾难？",
      "乖离而孤独，见到猪背上都是泥，载了一车的鬼。先张开弓，后来放下弓。不是强盗而是要来婚配的，前往遇到下雨就吉祥。"
    ]
  },
  {
    "name": "水山蹇",
    "yao": [
      "前往有险难，回来有称誉。",
      "君王的臣子遇到重重险难，不是为了自己的缘故。",
      "前往有险难，又返回来。",
      "前往有险难，回来有连接。",
      "在大的险难中，朋友来到。",
      "前往有险难，回来有丰收，吉祥。适宜见到大人。"
    ]
  },
  {
    "name": "雷水解",
    "yao": [
      "没有灾难。",
      "打猎抓到三只狐狸，获得黄色箭头，正固吉祥。",
      "背着东西坐在车上，招来了强盗，正固有困难。",
      "解开你的脚拇指，朋友来到才会有诚信。",
      "君子来纾解，吉祥，对小人有诚信。",
      "王公去射高墙上的鹞鹰，擒获它就无所不利。"
    ]
  },
  {
    "name": "山泽损",
    "yao": [
      "办成了事就赶快前往，没有灾难。要酌量减损。",
      "适宜正固，前进有凶祸。不要减损，就有增益。",
      "三人一起行走，就会减去一人；一人行走，就会得到友伴。",
      "减损他的疾病，让他赶快有喜庆，没有灾难。",
      "有人增益他价值十朋的龟，不能拒绝，最为吉祥。",
      "不是减损，而要增益，没有灾难，正固吉祥。适宜有所前往，得到臣民而没有自己的家。"
    ]
  },
  {
    "name": "风雷益",
    "yao": [
      "适宜用来推动大事，最为吉祥，没有灾难。",
      "有人增益他价值十朋的龟，不能拒绝，长久正固吉祥。君王用以祭献上帝，吉祥。",
      "用增益之物救助灾荒，没有灾难。有诚信而行中道，用珍圭告知王公。",
      "行中道，告知王公跟从，适宜用来做依靠而迁移国都。",
      "有真诚施惠之心，不必占问也最为吉祥。实实在在感念我的恩德。",
      "没有人来增益他，却有人来打击他，所立定的心思无法长期守住，有凶祸。"
    ]
  },
  {
    "name": "泽天夬",
    "yao": [
      "前进的脚趾壮健，前往而不能胜任，就是灾难。",
      "戒惕而有呼号，夜晚会出现兵寇，不必担忧。",
      "颧骨壮健，会出现凶祸。君子果敢决断而独自前行，遇雨打湿衣服，有怒气，但没有灾难。",
      "臀部没有皮肤，行走十分艰难。牵羊而进，懊恼就会消失，但是听到这话却不相信。",
      "山羊果敢决断的样子，居中而行没有灾难。",
      "不用呼号，最终会有凶祸。"
    ]
  },
  {
    "name": "天风姤",
    "yao": [
      "捆缚在缫车的金属横杠上，正固吉祥。有所前往，会见到凶祸。拴缚住的猪确实在跳动挣扎。",
      "包裹中有鱼，没有灾难，不适宜招待宾客。",
      "臀部没有皮肤，行走十分艰难。有危险，但没有大灾难。",
      "包裹中没有鱼，发起行动会有凶祸。",
      "用杞树叶子包起瓜果，其内含藏文采，从天上掉落下来。",
      "遇到头上的角，有困难，没有灾难。"
    ]
  },
  {
    "name": "泽地萃",
    "yao": [
      "有诚信而不能坚持到底，于是散乱于是聚集。如果号哭，一握手就笑了。不必担忧，前往没有灾难。",
      "牵引到吉祥，没有灾难。有诚信，所以适宜举行禴祭。",
      "聚集的样子，叹息的样子，没有任何适宜的事。前往没有灾难，但有小的困难。",
      "非常吉祥，没有灾难。",
      "聚众而拥有君位，没有灾难，但缺少诚信。开始恒守正固，懊恼就会消失。",
      "悲伤叹息而泪涕满面，没有灾难。"
    ]
  },
  {
    "name": "地风升",
    "yao": [
      "由信赖而升进，非常吉祥。",
      "有诚信，所以适宜举行禴祭，没有灾难。",
      "升进到荒废的村落。",
      "君王在岐山祭献，吉祥，没有灾难。",
      "正固吉祥，登上台阶。",
      "在昏昧中升进，适宜不成长的正固。"
    ]
  },
  {
    "name": "泽水困",
    "yao": [
      "臀部困陷在枯木中，进入幽暗的山谷，三年不能相见。",
      "困处于酒食中，大红官服刚刚送来，适宜用来祭献。前进会有凶祸，没有灾难。",
      "困处于石块中，倚靠在蒺藜上。进入宫室，没见到妻子，有凶祸。",
      "要慢慢下来，困处于金车中，有困难，但会有结果。",
      "鼻被割去，足被砍去，困处于红色官服中。于是慢慢行动，可以脱离困境，适宜举行祭祀。",
      "因处于藤蔓之间，于高危之地，这称为因行动而恼。有了这种悔悟，往前进就吉祥。"
    ]
  },
  {
    "name": "水风井",
    "yao": [
      "满是淤泥的井水不能食用，旧的水井没有禽兽来。",
      "井中积水向下流注，水罐又破又漏。",
      "井淘干净而不去食用，使我内心感到悲伤。可以用来汲水，君王英明，大家一起受到福佑。",
      "井的内壁砌好了，没有灾难。",
      "井中有甘洁清凉的泉水，可以食用。",
      "井口收拢而不要加盖，有诚信而最为吉祥。"
    ]
  },
  {
    "name": "泽火革",
    "yao": [
      "用黄牛皮做的绳子来捆绑。",
      "到了己日才来变革。前进吉祥，没有灾难。",
      "前进有凶祸，正固有危险。变革之言三度符合，才有诚信。",
      "懊恼消失，有诚信，改变天命，吉祥。",
      "大人改变而形貌如虎，尚未占问就有了诚信。",
      "君子改变而形貌如豹，小人变换他的面目。前进有凶祸，守住正固就吉祥。"
    ]
  },
  {
    "name": "火风鼎",
    "yao": [
      "鼎足颠倒，适宜走出闭塞。因为儿子而娶得妾，没有灾难。",
      "鼎中有实在物料，我的对头患了病，没有办法接近我，吉祥。",
      "鼎耳被革除，行动受到困阻，吃不到山鸡的美味。正在下雨，既吃亏又懊恼，最后吉祥。",
      "鼎足折断，打翻了王公的粥，自己身上也沾染上了，有凶祸。",
      "鼎有黄色的耳与金制的铉，适宜正固。",
      "鼎有玉制的铉，非常吉祥，无所不利。"
    ]
  },
  {
    "name": "震为雷",
    "yao": [
      "震动起来惊慌不安，然后笑语之声稳定合宜，吉祥。",
      "震动起来有危险，大量丧失了钱币。登上九重山陵，不要去追赶，七天可以失而复得",
      "震动得微微发抖，因为震惊而行动，就没有灾害。",
      "震动得落入泥中。",
      "震动时，往来都有危险，没有大量丧失，但发生事故。",
      "震动得浑身颤抖，惊恐得四处张望，前进有凶祸。震动不在自己身而在邻居那儿，就没有灾难。婚配会出现怨言。"
    ]
  },
  {
    "name": "艮为山",
    "yao": [
      "止住脚趾，没有灾难。适宜长久正固。",
      "止住小腿，不抬起来又须随着动，内心不痛快。",
      "止住腰部，撕裂脊肉，有危险而忧心如焚。",
      "止住身体，没有灾难。",
      "止住上牙床，说话有条理，懊恼消失。",
      "笃实地止住，吉祥。"
    ]
  },
  {
    "name": "风山渐",
    "yao": [
      "大雁渐进到水岸边，年轻人有危险，有些责言，没有灾难",
      "大雁渐进到磐石上，饮食和乐的样子，吉祥。",
      "大雁渐进到台地上，丈夫出征不回来，妇女怀孕不生育，有凶祸。适宜抵抗强盗。",
      "大雁渐进到树木上，或者停在屋椽上，没有灾难。",
      "大雁渐进到山陵上，妇女三年不怀孕，最后没有人能够胜过她，吉祥。",
      "大雁渐进到台地上，羽毛可以用在礼仪中，吉祥。"
    ]
  },
  {
    "name": "雷泽归妹",
    "yao": [
      "嫁妹妹时，以娣陪嫁。脚跛了还能走，前进吉祥。",
      "眼有疾还能看，适宜幽隐的人保持正固。",
      "嫁妹妹时，以妾陪嫁，还要回去再以娣陪嫁。",
      "嫁妹妹延误了婚期，晚些出嫁也会有一定的时候。",
      "帝乙嫁妹妹，这位女君的服饰还没有娣的服饰那么华美。月亮快到满盈的时候，吉祥。",
      "女子捧着竹筐，里面是空的；士人宰杀活羊，无法取得血，没有什么适宜的事。"
    ]
  },
  {
    "name": "雷火丰",
    "yao": [
      "遇到与自己搭配的主人，虽然彼此均等，但是没有灾难，前往会有好事",
      "很大的遮蔽范围，中午见到了星斗。前往会受到怀疑猜忌。有诚信而表现的样子，吉祥。",
      "很大的阴暗范围，中午见到小星星。折断了右臂，没有灾难。",
      "很大的遮蔽范围，中午见到了星斗。遇到与自己平等的主人，吉祥。",
      "来到的是光明，有喜庆与名声，吉祥。",
      "房屋很高大，居室被遮蔽；从门口窥视，寂静不见人；三年不能见面，有凶祸，"
    ]
  },
  {
    "name": "火山旅",
    "yao": [
      "旅行时猥猥琐琐，这是他自取的灾害。",
      "旅行到了馆舍住下，身上带着旅费，得到童仆，可以正固。",
      "旅行时大火烧了馆舍，失去了童仆，有危险。",
      "旅行到了某个地方，获得旅费与用具，我心里不愉快。",
      "射野鸡，丢失一支箭，最后会有名声与禄位。",
      "鸟的巢被火烧掉，旅行的人先是大笑后来大哭。在边界丢失了牛，有凶祸。"
    ]
  },
  {
    "name": "巽为风",
    "yao": [
      "进退不定，适宜武人的正固。",
      "随顺进入床底下，让祝史与巫觋纷纷发言，吉祥，没有灾难",
      "频繁地重复命令，会有困难。",
      "懊恼消失，打猎获得三种动物。",
      "正固吉祥，懊恼消失，没有不适宜的事。没有开始但有结果。庚日的前三天，庚日的后三天，吉祥。",
      "随顺进入床底下，失去钱财与用具，正固有凶祸。"
    ]
  },
  {
    "name": "兑为泽",
    "yao": [
      "应和而喜悦，吉祥。",
      "诚信而喜悦，吉祥，懊恼消失。",
      "来到而喜悦，有凶祸。",
      "商量而喜悦，还不能安定；隔开了疾病，就会有好事。",
      "受到衰退的人信赖，有危险。",
      "牵引而喜悦。"
    ]
  },
  {
    "name": "风水涣",
    "yao": [
      "用来拯救的马强壮，吉祥。",
      "离散而奔向几案，懊恼消失。",
      "涣散了自己，没有懊恼。",
      "涣散了同类，最为吉祥。涣散之后聚为山丘，不是平常所能想到的。",
      "散发广布，大的政令散发出去，君王安居，没有灾难。",
      "涣散了血灾，离开而远走，没有灾难。"
    ]
  },
  {
    "name": "水泽节",
    "yao": [
      "不离开门户与庭院，没有灾难。",
      "不走出门户与庭院，有凶祸。",
      "没有节制的样子，就会出现悲叹的样子，没有责难。",
      "安定的节制，通达。",
      "甘美的节制，吉祥，前往受到推崇。",
      "苦涩的节制，正固会有凶祸，懊恼消失。"
    ]
  },
  {
    "name": "风泽中孚",
    "yao": [
      "可预料就吉祥，有其他状况则不安。",
      "大鹤在树荫下啼叫，它的小鹤啼叫应和。我有美酒一罐，我要与你共享。",
      "遇到对手，或击鼓或休兵，或哭泣或唱歌。",
      "月亮已经满盈，马匹丢失，没有灾难。",
      "有诚信而系念着，没有灾难。",
      "鸡啼的声音传升到天上，正固会有凶祸。"
    ]
  },
  {
    "name": "雷山小过",
    "yao": [
      "飞鸟会带来凶祸。",
      "越过了祖父，遇到了母亲；没有赶上君王，遇到了臣子，没有灾难。",
      "不要越过而要防范，跟着去可能受到伤害，有凶祸。",
      "没有灾难。不要越过也会遇到，前往有危险，一定要警戒。不可以有所作为，长久保持正固。",
      "浓云密布而不下雨，从我西边的郊野飘聚过去。王公射箭猎取穴中之物。",
      "没有相遇，越过去了，飞鸟陷入罗网，有凶祸。这叫做天灾人祸。"
    ]
  },
  {
    "name": "水火既济",
    "yao": [
      "拉住车轮，浸湿尾巴，没有灾难。",
      "妇人丢了头饰，不用寻找，七天可以失而复得。",
      "高宗讨伐鬼方，三年才征服。不可任用小人。",
      "彩色绢帛也会变成破旧衣服，整天都在警戒。",
      "东邻杀牛举行大祭，还比不上西邻的简单禴祭，可以真正受到福佑。",
      "浸湿了头，有危险。"
    ]
  },
  {
    "name": "火水未济",
    "yao": [
      "浸湿了尾巴，有困难。",
      "拉住车轮，正固吉祥。",
      "尚未渡过，前进会有凶祸。适宜渡过大河。",
      "正固吉祥，懊恼消失，振奋起来讨伐鬼方。三年后成功，受到大国封赏。",
      "正固吉祥，没有懊恼，君子的光明在照耀。有诚信，吉祥。",
      "有诚信而去喝酒，没有灾难。浸湿了头，有诚信也无法没有灾难。"
    ]
  }
];

var hexagramExplainSYData = [
  {
    "name": "乾为天",
    "text": "吉：得此卦者，天行刚健，自强不息，名利双收之象，宜把握机会，争取成果。女人得此卦则有过于刚直之嫌。"
  },
  {
    "name": "坤为地",
    "text": "吉：得此卦者，宜顺从运势，以静制动，不宜独立谋事，顺从他人，一起合作，可成大事。"
  },
  {
    "name": "水雷屯",
    "text": "凶：得此卦者，身处困境，宜守不宜进，须多加辛苦努力，排除困难，方可通达，有初难后解之象。"
  },
  {
    "name": "山水蒙",
    "text": "小凶：得此卦者，智慧犹如童蒙，不辨是非，迷失方向；若能顺贤师良友之教，启其聪明则亨通。"
  },
  {
    "name": "水天需",
    "text": "小凶：得此卦者，时机尚未成熟，需要耐心等待，急进反会见凶。"
  },
  {
    "name": "天水讼",
    "text": "凶：得此卦者，身心不安，事多不顺，与他人多争诉之事，宜修身养性，谨慎处事。"
  },
  {
    "name": "地水师",
    "text": "小凶：得此卦者，困难重重，忧心劳众，宜包容别人，艰苦努力，摒除一切困难。"
  },
  {
    "name": "水地比",
    "text": "吉：得此卦者，可获朋友之助，众人之力，谋事有成，荣显之极。"
  },
  {
    "name": "风天小畜",
    "text": "小凶：得此卦者，力量薄弱，运势反覆，宜蓄养实力，静待时机，急进则有险，凡事须耐心推进。"
  },
  {
    "name": "天泽履",
    "text": "小凶：得此卦者，困难时期，多坎坷不顺，万事不宜急进，须循序渐进，谨慎行事。"
  },
  {
    "name": "地天泰",
    "text": "吉：得此卦者，否极泰来，鸿运当头，诸事皆顺，但须防乐极生悲。"
  },
  {
    "name": "天地否",
    "text": "凶：得此卦者，万物闭塞之象，上下不合，诸事不顺，凡事宜忍，须待时运好转而有为。"
  },
  {
    "name": "天火同人",
    "text": "吉：得此卦者，吉祥如意，与人合作共事更佳，上下同心，谋事有成。"
  },
  {
    "name": "火天大有",
    "text": "吉：得此卦者，正当好运，事事吉祥，大有收获，但防物极必反，盛极转衰。"
  },
  {
    "name": "地山谦",
    "text": "吉：得此卦者，吉利平安，步步高升。谦虚忍让者前途大好，骄横者必招败。谦受益，满招损。"
  },
  {
    "name": "雷地豫",
    "text": "吉：得此卦者，顺天应时，事事吉祥，可得长辈之助，但须防色难，切不可沉迷于声色欢场之中。"
  },
  {
    "name": "泽雷随",
    "text": "小吉：得此卦者，宜随大势，其事可成。凡事与他人多沟通交流，可名利双收。切不可坚持己见，专横者事不成。"
  },
  {
    "name": "山风蛊",
    "text": "凶：得此卦者，艰难迷惑之时，事事不如意；宜大胆革新，奋发图强，艰苦努力，可转危为安。"
  },
  {
    "name": "地泽临",
    "text": "吉：得此卦者，好运来到，诸事如意，人情和合，但行事不宜过于急进。"
  },
  {
    "name": "风地观",
    "text": "小凶：得此卦者，处身于变化之中，心神不宁，宜多观察入微，待机行事，切勿妄进。"
  },
  {
    "name": "火雷噬嗑",
    "text": "凶：得此卦者，事不遂心，纷争难免，诸事被阻，宜坚守常规，不为利诱，可保平安。"
  },
  {
    "name": "山火贲",
    "text": "小凶：得此卦者，表面风光，内在空虚，多虚少实。宜充实自己，稳重行事，量力而为。"
  },
  {
    "name": "山地剥",
    "text": "凶：得此卦者，时运不佳，多有损失，前进有阻，宜顺时而止，安份自守。"
  },
  {
    "name": "地雷复",
    "text": "小吉：得此卦者，时运好转，顺势而为，谋事可成，但不宜过于急进。"
  },
  {
    "name": "天雷无妄",
    "text": "小吉：得此卦者，顺其自然，守正道者，诸事皆宜。但行为不检者，必招灾祸。"
  },
  {
    "name": "山天大畜",
    "text": "小吉：得此卦者，宜坚守正道，脚踏实地，务实行事，方可成就大业。切勿骄傲自满，目空一切。"
  },
  {
    "name": "山雷颐",
    "text": "小凶：得此卦者，对于言语及饮食，均须谨慎。宜守正道，谨言慎行，心怀阴谋者会招灾祸。"
  },
  {
    "name": "泽风大过",
    "text": "凶：得此卦者，身心不安，事不如意，却又强意而行，大有后悔之时，谨防官非及水险。"
  },
  {
    "name": "坎为水",
    "text": "凶：得此卦者，运气不佳，多难危险，事多困阻，宜谨言慎行，退守保全。"
  },
  {
    "name": "离为火",
    "text": "小吉：得此卦者，宜谦虚谨慎，稳步进取，则前途光明。急进及意气用事者必有所损失。"
  },
  {
    "name": "泽山咸",
    "text": "小吉：得此卦者，宜谦虚待人，则会吉祥如意，谋事可成。但勿为不正当感情而意乱情迷。"
  },
  {
    "name": "雷风恒",
    "text": "小吉：得此卦者，须立身正道，坚守不易，持续努力，必能亨通。缺少毅力，朝三暮四者则不会成功。"
  },
  {
    "name": "天山遁",
    "text": "凶：得此卦者，宜退不宜进。退守可以保身，若轻举妄动则会招灾。宜谨言慎行，待机行事。"
  },
  {
    "name": "雷天大壮",
    "text": "小吉：得此卦者，运势过于强盛，宜心平气和，谨慎行事，否则必生过失。"
  },
  {
    "name": "火地晋",
    "text": "吉：得此卦者，如旭日东升，气运旺盛，收入颇丰，谋事可成，百事如意。"
  },
  {
    "name": "地火明夷",
    "text": "凶：得此卦者，时运不佳，事事劳苦，宜坚守正道，忍耐自重，等待时机。"
  },
  {
    "name": "风火家人",
    "text": "小吉：得此卦者，与人合作共事者会有利，且多有喜事之象，家庭和睦者，能同心协力，发展事业。"
  },
  {
    "name": "火泽睽",
    "text": "凶：得此卦者，运气不佳，水火不容，相互矛盾，诸事难成。"
  },
  {
    "name": "水山蹇",
    "text": "凶：得此卦者，身心忧苦，举步维艰，宜守正道，不可妄动，涉险境者会有灾难。"
  },
  {
    "name": "雷水解",
    "text": "吉：得此卦者，能解脱先前之困难，宜把握良机，求谋事业，出外谋事者更佳。"
  },
  {
    "name": "山泽损",
    "text": "小吉：得此卦者，损己利人，虽然开始会有所不顺，但付出总会有所回报，因祸得福之象。"
  },
  {
    "name": "风雷益",
    "text": "小吉：得此卦者，正当好运，奋发图进，得人帮助，能获名利。"
  },
  {
    "name": "泽天夬",
    "text": "凶：得此卦者，大运将过，困难将至，宜提高警惕，谨言慎行。"
  },
  {
    "name": "天风姤",
    "text": "凶：得此卦者，阴长阳衰，诸事不顺，宜谨慎行事，更应注意桃色纠纷。"
  },
  {
    "name": "泽地萃",
    "text": "吉：得此卦者，运气大好，能得到贵人的帮助，获利丰厚，无往不利。"
  },
  {
    "name": "地风升",
    "text": "吉：得此卦者，运气升腾，诸事皆积极向上发展，谋事有成，名利双收。"
  },
  {
    "name": "泽水困",
    "text": "凶：得此卦者，陷入困境，事事不如意，宜坚守正道，等待时机。"
  },
  {
    "name": "水风井",
    "text": "小吉：得此卦者，宜修身养性，顺其自然，泰然处之，静有利，动则凶。"
  },
  {
    "name": "泽火革",
    "text": "小吉：得此卦者，凡事均在变动之中，宜去旧立新，以应革新之象，则会吉祥。"
  },
  {
    "name": "火风鼎",
    "text": "吉：得此卦者，时运正佳，能得到朋友的帮助，取得不错的成就。与人合伙共事更佳。"
  },
  {
    "name": "震为雷",
    "text": "小吉：得此卦者，奋发振作，大可有为，但表面风光，内恐有难，宜谨言慎行，以免损失。"
  },
  {
    "name": "艮为山",
    "text": "小凶：得此卦者，前路受阻，不宜妄进，宜守待机。"
  },
  {
    "name": "风山渐",
    "text": "小吉：得此卦者，逐步开运，凡事宜循序渐进，则谋事可成，不宜急进，性急则败。"
  },
  {
    "name": "雷泽归妹",
    "text": "凶：得此卦者，困难之时，做事有违常理，灾祸不断。宜明察事理，修身养性，断绝妄念。"
  },
  {
    "name": "雷火丰",
    "text": "小吉：得此卦者，运势正强，谋事可成，名利双收。但不宜过贪，要知足常乐，谨防乐极生悲，损财甚至火险。"
  },
  {
    "name": "火山旅",
    "text": "凶：得此卦者，事多变动，如在异乡，小事可成，大事难成，宜谨守常规。"
  },
  {
    "name": "巽为风",
    "text": "小吉：得此卦者，运势起伏不定，宜随机应变，谦虚行事，则可得意外之收获。"
  },
  {
    "name": "兑为泽",
    "text": "吉：得此卦者，多喜庆之事，人情和合，但应坚守正道，否则犯灾。"
  },
  {
    "name": "风水涣",
    "text": "小吉：得此卦者，初有不顺，但终可解困，凡事宜小心则百事亨通，忌任性放纵。"
  },
  {
    "name": "水泽节",
    "text": "小凶：得此卦者，宜安分守己，切忌贪心不足，诸事必须节制，不宜过份，更要戒酒色。"
  },
  {
    "name": "风泽中孚",
    "text": "小吉：得此卦者，正直诚信者吉利，会得到朋友的帮助，谋事可成；心存邪念者则凶。"
  },
  {
    "name": "雷山小过",
    "text": "凶：得此卦者，诸事不利，宜行小事，不宜成大事，更防因自身的过失惹来是非争讼。"
  },
  {
    "name": "水火既济",
    "text": "小吉：得此卦者，事业有成，成功之象，但谨防盛极必衰，宜退守为吉，再进则凶。"
  },
  {
    "name": "火水未济",
    "text": "小凶：得此卦者，运势不通，诸事不能如愿，宜由小及大，稳步进取，要耐心去突破难关，则终可成功。"
  }
];

var hexagramExplainFPRshiyunData = [
  {
    "name": "乾为天",
    "text": "临事刚健，自强不息。"
  },
  {
    "name": "坤为地",
    "text": "为人厚道，声名远传。"
  },
  {
    "name": "水雷屯",
    "text": "宜守不宜进。"
  },
  {
    "name": "山水蒙",
    "text": "蓄积德行，出而用世。"
  },
  {
    "name": "水天需",
    "text": "时机尚未成熟，耐心等待。"
  },
  {
    "name": "天水讼",
    "text": "功名受阻，不宜树敌。"
  },
  {
    "name": "地水师",
    "text": "包容别人，修行待时。"
  },
  {
    "name": "水地比",
    "text": "众人相贺，荣显之极。"
  },
  {
    "name": "风天小畜",
    "text": "平平无奇，受人牵制。"
  },
  {
    "name": "天泽履",
    "text": "依序升进，不可攀缘。"
  },
  {
    "name": "地天泰",
    "text": "一切顺利，居安思危。"
  },
  {
    "name": "天地否",
    "text": "诸事不顺，不可妄动。"
  },
  {
    "name": "天火同人",
    "text": "朋友支持，升迁顺利。"
  },
  {
    "name": "火天大有",
    "text": "亨通无比，大放异彩。"
  },
  {
    "name": "地山谦",
    "text": "眼前平顺，步步高升。"
  },
  {
    "name": "雷地豫",
    "text": "春雷发动，诸事吉祥。"
  },
  {
    "name": "泽雷随",
    "text": "明年运行，五年方展。"
  },
  {
    "name": "山风蛊",
    "text": "力图振作，可改旧观。"
  },
  {
    "name": "地泽临",
    "text": "活水流行，好运方来。"
  },
  {
    "name": "风地观",
    "text": "出外游览，不易闲居。"
  },
  {
    "name": "火雷噬嗑",
    "text": "好运初动，声名直上。"
  },
  {
    "name": "山火贲",
    "text": "上有阻力，不可任意。"
  },
  {
    "name": "山地剥",
    "text": "时运不佳，安心自守。"
  },
  {
    "name": "地雷复",
    "text": "好运初来，静待发动。"
  },
  {
    "name": "天雷无妄",
    "text": "正当好运，诸事皆宜。"
  },
  {
    "name": "山天大畜",
    "text": "守静二年，方可展运。"
  },
  {
    "name": "山雷颐",
    "text": "生机显达，谨言慎行。"
  },
  {
    "name": "泽风大过",
    "text": "收敛自省，未可求名。"
  },
  {
    "name": "坎为水",
    "text": "逐步升迁，随时防患。"
  },
  {
    "name": "离为火",
    "text": "努力修德，前途光明。"
  },
  {
    "name": "泽山咸",
    "text": "谦虚待人，可保功名。"
  },
  {
    "name": "雷风恒",
    "text": "努力耕耘，不可躁进。"
  },
  {
    "name": "天山遁",
    "text": "最好退隐，君子有吉。"
  },
  {
    "name": "雷天大壮",
    "text": "成名不难，不可骄傲。"
  },
  {
    "name": "火地晋",
    "text": "好运新来，步步高升。"
  },
  {
    "name": "地火明夷",
    "text": "明哲保身，以避灾厄。"
  },
  {
    "name": "风火家人",
    "text": "旺运当头，言行小心。"
  },
  {
    "name": "火泽睽",
    "text": "上下不通，以正处之。"
  },
  {
    "name": "水山蹇",
    "text": "处于艰困，更加奋勉。"
  },
  {
    "name": "雷水解",
    "text": "灾难已解，声名大起。"
  },
  {
    "name": "山泽损",
    "text": "心平气和，才有发展。"
  },
  {
    "name": "风雷益",
    "text": "得意之时，改旧换新。"
  },
  {
    "name": "泽天夬",
    "text": "气运过盛，散财为吉。"
  },
  {
    "name": "天风姤",
    "text": "正当好运，名扬四海。"
  },
  {
    "name": "泽地萃",
    "text": "安不忘危，自可无忧。"
  },
  {
    "name": "地风升",
    "text": "大地春回，日益高升。"
  },
  {
    "name": "泽水困",
    "text": "身名皆困，不如安命。"
  },
  {
    "name": "水风井",
    "text": "木水相生，功名有望。"
  },
  {
    "name": "泽火革",
    "text": "改变之时，顺时而动。"
  },
  {
    "name": "火风鼎",
    "text": "功名日进，贵不可言。"
  },
  {
    "name": "震为雷",
    "text": "运势正强，谨慎免咎。"
  },
  {
    "name": "艮为山",
    "text": "运势平平，不宜妄进。"
  },
  {
    "name": "风山渐",
    "text": "时来运转，可以得意。"
  },
  {
    "name": "雷泽归妹",
    "text": "进不以道，难以持久。"
  },
  {
    "name": "雷火丰",
    "text": "气势正旺，谨慎小心。"
  },
  {
    "name": "火山旅",
    "text": "谨慎防灾，升用在即。"
  },
  {
    "name": "巽为风",
    "text": "运势顺利，诸事皆宜。"
  },
  {
    "name": "兑为泽",
    "text": "朋友支持，好好珍惜。"
  },
  {
    "name": "风水涣",
    "text": "时来运转，水到渠成。"
  },
  {
    "name": "水泽节",
    "text": "品行端正，名利自成。"
  },
  {
    "name": "风泽中孚",
    "text": "风波难免，小心诉讼。"
  },
  {
    "name": "雷山小过",
    "text": "清高自处，反遭人忌。"
  },
  {
    "name": "水火既济",
    "text": "盛极必衰，谨防后患。"
  },
  {
    "name": "火水未济",
    "text": "运势颠倒，务必谨慎。"
  }
];

var hexagramExplainFPRcaiyunData = [
  {
    "name": "乾为天",
    "text": "施比受有福，不利买而利卖。"
  },
  {
    "name": "坤为地",
    "text": "满载而归。"
  },
  {
    "name": "水雷屯",
    "text": "创业维艰。"
  },
  {
    "name": "山水蒙",
    "text": "矿山生意，果决则吉。"
  },
  {
    "name": "水天需",
    "text": "资本未集，无法开张。"
  },
  {
    "name": "天水讼",
    "text": "开始谨慎，终可获利。"
  },
  {
    "name": "地水师",
    "text": "有财有库，善自珍惜。"
  },
  {
    "name": "水地比",
    "text": "善人相扶，大发利市。"
  },
  {
    "name": "风天小畜",
    "text": "外表不错，内多耗损。"
  },
  {
    "name": "天泽履",
    "text": "明察货品，待时而售。"
  },
  {
    "name": "地天泰",
    "text": "买卖均宜，买入较佳。"
  },
  {
    "name": "天地否",
    "text": "适宜买入，后可获利。"
  },
  {
    "name": "天火同人",
    "text": "合资有利，可以进取。"
  },
  {
    "name": "火天大有",
    "text": "放手去做，财富自来。"
  },
  {
    "name": "地山谦",
    "text": "物价合理，利益保障。"
  },
  {
    "name": "雷地豫",
    "text": "新货上市，必有大利。"
  },
  {
    "name": "泽雷随",
    "text": "堆积存货，明春有利。"
  },
  {
    "name": "山风蛊",
    "text": "不宜堆积，应即贩卖。"
  },
  {
    "name": "地泽临",
    "text": "经营有成，获利可期。"
  },
  {
    "name": "风地观",
    "text": "贩卖洋货，须防风险。"
  },
  {
    "name": "火雷噬嗑",
    "text": "买卖皆成，货物畅销。"
  },
  {
    "name": "山火贲",
    "text": "经理精明，须防套牢。"
  },
  {
    "name": "山地剥",
    "text": "出口获利，剥人之财。"
  },
  {
    "name": "地雷复",
    "text": "暂停售物，必可获利。"
  },
  {
    "name": "天雷无妄",
    "text": "货到财来，自然开心。"
  },
  {
    "name": "山天大畜",
    "text": "暂时株守，良机必至。"
  },
  {
    "name": "山雷颐",
    "text": "内外升降，未必流通。"
  },
  {
    "name": "泽风大过",
    "text": "低价高涨，不易把握。"
  },
  {
    "name": "坎为水",
    "text": "财如流水，商运亨通。"
  },
  {
    "name": "离为火",
    "text": "与火有关，皆有所得。"
  },
  {
    "name": "泽山咸",
    "text": "转运贩卖，必可图利。"
  },
  {
    "name": "雷风恒",
    "text": "贸易之地，不可更改。"
  },
  {
    "name": "天山遁",
    "text": "物价涨跌，相去甚远。"
  },
  {
    "name": "雷天大壮",
    "text": "得价即售，不可过贪。"
  },
  {
    "name": "火地晋",
    "text": "光亮之业，最有利润。"
  },
  {
    "name": "地火明夷",
    "text": "明无利润，暗中分红。"
  },
  {
    "name": "风火家人",
    "text": "囤积货品，后有高价。"
  },
  {
    "name": "火泽睽",
    "text": "人弃我取，尚有小利。"
  },
  {
    "name": "水山蹇",
    "text": "财不流通，难以得利。"
  },
  {
    "name": "雷水解",
    "text": "天时地利，人和为贵。"
  },
  {
    "name": "山泽损",
    "text": "和气生财，损己利人。"
  },
  {
    "name": "风雷益",
    "text": "贸易要快，才有利益。"
  },
  {
    "name": "泽天夬",
    "text": "利己利人，财散人聚。"
  },
  {
    "name": "天风姤",
    "text": "到了远方，自可获利。"
  },
  {
    "name": "泽地萃",
    "text": "财聚之象，有聚有散。"
  },
  {
    "name": "地风升",
    "text": "储蓄积财，可成富人。"
  },
  {
    "name": "泽水困",
    "text": "财乏势危，不如归去。"
  },
  {
    "name": "水风井",
    "text": "利大于本，自然可喜。"
  },
  {
    "name": "泽火革",
    "text": "消耗过多，迁地贸易。"
  },
  {
    "name": "火风鼎",
    "text": "自然得利，不劳而获。"
  },
  {
    "name": "震为雷",
    "text": "所积财物，皆得售出。"
  },
  {
    "name": "艮为山",
    "text": "守好本业，不可贪财。"
  },
  {
    "name": "风山渐",
    "text": "逐渐得利，多行善事。"
  },
  {
    "name": "雷泽归妹",
    "text": "货价尚可，结局未必。"
  },
  {
    "name": "雷火丰",
    "text": "获利甚丰，须防诉讼。"
  },
  {
    "name": "火山旅",
    "text": "出外经营，不可积货。"
  },
  {
    "name": "巽为风",
    "text": "随机应变，获利可期。"
  },
  {
    "name": "兑为泽",
    "text": "有人扶助，获利不难。"
  },
  {
    "name": "风水涣",
    "text": "神明保佑，财源流通。"
  },
  {
    "name": "水泽节",
    "text": "正派经营，富裕可求。"
  },
  {
    "name": "风泽中孚",
    "text": "谨慎行事，可免灾祸。"
  },
  {
    "name": "雷山小过",
    "text": "价格不合，无利可图。"
  },
  {
    "name": "水火既济",
    "text": "及时出手，可得利润。"
  },
  {
    "name": "火水未济",
    "text": "诸事不顺，步步为营。"
  }
];

var hexagramExplainFPRjiazhaiData = [
  {
    "name": "乾为天",
    "text": "积善有余庆；女子过刚宜慎重。"
  },
  {
    "name": "坤为地",
    "text": "家庭安稳；婚嫁大吉。"
  },
  {
    "name": "水雷屯",
    "text": "修缮住宅；初婚不和。"
  },
  {
    "name": "山水蒙",
    "text": "君子居吉；婚姻之始。"
  },
  {
    "name": "水天需",
    "text": "平安是福。"
  },
  {
    "name": "天水讼",
    "text": "君子必求淑女。"
  },
  {
    "name": "地水师",
    "text": "旧亲联姻，可喜可贺。"
  },
  {
    "name": "水地比",
    "text": "百年好合。"
  },
  {
    "name": "风天小畜",
    "text": "小康，须防口舌；娶得淑女。"
  },
  {
    "name": "天泽履",
    "text": "门庭严整。"
  },
  {
    "name": "地天泰",
    "text": "盛但须防衰，婚嫁大吉。"
  },
  {
    "name": "天地否",
    "text": "勤俭免祸；比离之象。"
  },
  {
    "name": "天火同人",
    "text": "合家欢喜。"
  },
  {
    "name": "火天大有",
    "text": "积善之家，子孙保之。"
  },
  {
    "name": "地山谦",
    "text": "近山之居，合家平安。"
  },
  {
    "name": "雷地豫",
    "text": "祈神祭祖，可保平安。"
  },
  {
    "name": "泽雷随",
    "text": "防止惊惧。"
  },
  {
    "name": "山风蛊",
    "text": "整顿家风；恐有私情；生育不顺。"
  },
  {
    "name": "地泽临",
    "text": "家业正旺；两姓和合。"
  },
  {
    "name": "风地观",
    "text": "供养神佛。"
  },
  {
    "name": "火雷噬嗑",
    "text": "小心火灾；百年好合。"
  },
  {
    "name": "山火贲",
    "text": "小心火灾。"
  },
  {
    "name": "山地剥",
    "text": "不离己宅，寄居可买。"
  },
  {
    "name": "地雷复",
    "text": "待春再迁；婚嫁初春可成。"
  },
  {
    "name": "天雷无妄",
    "text": "屋运甚旺；门当户对。"
  },
  {
    "name": "山天大畜",
    "text": "家业日隆；婚姻大吉。"
  },
  {
    "name": "山雷颐",
    "text": "小心防火；贤妇从夫。"
  },
  {
    "name": "泽风大过",
    "text": "防止倾斜；老少配婚。"
  },
  {
    "name": "坎为水",
    "text": "邻居营造；亲上加亲。"
  },
  {
    "name": "离为火",
    "text": "贵人之屋；可得继室。"
  },
  {
    "name": "泽山咸",
    "text": "知其所止；两姓和好。"
  },
  {
    "name": "雷风恒",
    "text": "方向不改；百年好合。"
  },
  {
    "name": "天山遁",
    "text": "须防作祟；婚姻不宜。"
  },
  {
    "name": "雷天大壮",
    "text": "小心防火；相敬如宾。"
  },
  {
    "name": "火地晋",
    "text": "阳光之屋。"
  },
  {
    "name": "地火明夷",
    "text": "父子分居为宜；不是明媒正娶。"
  },
  {
    "name": "风火家人",
    "text": "小心火灾；亲上加亲。"
  },
  {
    "name": "火泽睽",
    "text": "迁避为宜；择而娶之。"
  },
  {
    "name": "水山蹇",
    "text": "防水冲损；婚姻有悔。"
  },
  {
    "name": "雷水解",
    "text": "祈祷解厄；婚姻吉祥。"
  },
  {
    "name": "山泽损",
    "text": "地势宜平；夫妇得正。"
  },
  {
    "name": "风雷益",
    "text": "小心风雷；婚姻好合。"
  },
  {
    "name": "泽天夬",
    "text": "须防水患；婚姻不成。"
  },
  {
    "name": "天风姤",
    "text": "小心狂风；婚姻得正。"
  },
  {
    "name": "泽地萃",
    "text": "防水入屋；洁身自爱。"
  },
  {
    "name": "地风升",
    "text": "改造大厦；以妾作嫡。"
  },
  {
    "name": "泽水困",
    "text": "安全第一；女寡之象。"
  },
  {
    "name": "水风井",
    "text": "修屋防水；阴阳得正。"
  },
  {
    "name": "泽火革",
    "text": "小心防火；改娶之象。"
  },
  {
    "name": "火风鼎",
    "text": "小心火灾；正配内助。"
  },
  {
    "name": "震为雷",
    "text": "保护宅基，祭祷为宜；佳偶。"
  },
  {
    "name": "艮为山",
    "text": "不宜改造；命由前定。"
  },
  {
    "name": "风山渐",
    "text": "君子居之；贤女可妻。"
  },
  {
    "name": "雷泽归妹",
    "text": "已婚不宜居母家；勿耽情欲。"
  },
  {
    "name": "雷火丰",
    "text": "宜向东南；天作之合。"
  },
  {
    "name": "火山旅",
    "text": "小心火灾；即日成亲。"
  },
  {
    "name": "巽为风",
    "text": "可以安居；夫唱妇随。"
  },
  {
    "name": "兑为泽",
    "text": "友朋同住；因友成亲。"
  },
  {
    "name": "风水涣",
    "text": "祈神得福；自成佳偶。"
  },
  {
    "name": "水泽节",
    "text": "富有之家；婚姻吉祥。"
  },
  {
    "name": "风泽中孚",
    "text": "诉讼之灾；婚姻致讼。"
  },
  {
    "name": "雷山小过",
    "text": "高处之家；老夫少妻。"
  },
  {
    "name": "水火既济",
    "text": "大厦可居；百年好合。"
  },
  {
    "name": "火水未济",
    "text": "改变方向；门户不合。"
  }
];

var hexagramExplainFPRshentiData = [
  {
    "name": "乾为天",
    "text": "保健有恒。"
  },
  {
    "name": "坤为地",
    "text": "柔软运动。"
  },
  {
    "name": "水雷屯",
    "text": "保存元气。"
  },
  {
    "name": "山水蒙",
    "text": "驱去邪热，可保平安。"
  },
  {
    "name": "水天需",
    "text": "调节饮食，健康有望。"
  },
  {
    "name": "天水讼",
    "text": "预防胜于治疗。"
  },
  {
    "name": "地水师",
    "text": "腹胀之症，调气无忧。"
  },
  {
    "name": "水地比",
    "text": "心腹水肿，宜早求治。"
  },
  {
    "name": "风天小畜",
    "text": "风火之症；小孩吉，大人凶。"
  },
  {
    "name": "天泽履",
    "text": "疏通气血。"
  },
  {
    "name": "地天泰",
    "text": "运动合宜。"
  },
  {
    "name": "天地否",
    "text": "气血不通，节制饮食。"
  },
  {
    "name": "天火同人",
    "text": "燥热之症，另求良医。"
  },
  {
    "name": "火天大有",
    "text": "虚火上升，小心诊治。"
  },
  {
    "name": "地山谦",
    "text": "内郁之症，放宽心胸。"
  },
  {
    "name": "雷地豫",
    "text": "祷告静心。"
  },
  {
    "name": "泽雷随",
    "text": "休养为宜；牢狱之灾。"
  },
  {
    "name": "山风蛊",
    "text": "蛊毒之症，小心咒诅。"
  },
  {
    "name": "地泽临",
    "text": "疾病拖延，不致危险。"
  },
  {
    "name": "风地观",
    "text": "风湿之症，运动调养。"
  },
  {
    "name": "火雷噬嗑",
    "text": "须防郁热；失物不保。"
  },
  {
    "name": "山火贲",
    "text": "郁火上升，慎用寒剂。"
  },
  {
    "name": "山地剥",
    "text": "魂不附体，千万小心。"
  },
  {
    "name": "地雷复",
    "text": "有痰上火，冬令宜防。"
  },
  {
    "name": "天雷无妄",
    "text": "保持运动，自可消化。"
  },
  {
    "name": "山天大畜",
    "text": "健康有力。"
  },
  {
    "name": "山雷颐",
    "text": "上寒下热，五日乃愈。"
  },
  {
    "name": "泽风大过",
    "text": "肝肾皆累，不易治好。"
  },
  {
    "name": "坎为水",
    "text": "水泻之症，虔心祷告。"
  },
  {
    "name": "离为火",
    "text": "热病严重，小心大去。"
  },
  {
    "name": "泽山咸",
    "text": "虚弱宜补。"
  },
  {
    "name": "雷风恒",
    "text": "气喘有痰，仍服旧方。"
  },
  {
    "name": "天山遁",
    "text": "避居吉地。"
  },
  {
    "name": "雷天大壮",
    "text": "保养脚部。"
  },
  {
    "name": "火地晋",
    "text": "自知之明。"
  },
  {
    "name": "地火明夷",
    "text": "肝大郁积，注意保养。"
  },
  {
    "name": "风火家人",
    "text": "痰多气喘，难以根治。"
  },
  {
    "name": "火泽睽",
    "text": "上火下湿，实在难治。"
  },
  {
    "name": "水山蹇",
    "text": "足部有疾，小心保养。"
  },
  {
    "name": "雷水解",
    "text": "药到病除。"
  },
  {
    "name": "山泽损",
    "text": "修身养性。"
  },
  {
    "name": "风雷益",
    "text": "肝火太盛。"
  },
  {
    "name": "泽天夬",
    "text": "调养气息。"
  },
  {
    "name": "天风姤",
    "text": "小心中风。"
  },
  {
    "name": "泽地萃",
    "text": "胸腹水涨，早些调理。"
  },
  {
    "name": "地风升",
    "text": "肝火渐旺，早些调养。"
  },
  {
    "name": "泽水困",
    "text": "肾水已亏，险在眼前。"
  },
  {
    "name": "水风井",
    "text": "肾水过胀，立即调治。"
  },
  {
    "name": "泽火革",
    "text": "肾水干枯，肝火上升。"
  },
  {
    "name": "火风鼎",
    "text": "肝火上冲，顺气以治。"
  },
  {
    "name": "震为雷",
    "text": "肝火太盛，不宜劳累。"
  },
  {
    "name": "艮为山",
    "text": "带病延年。"
  },
  {
    "name": "风山渐",
    "text": "安居调养。"
  },
  {
    "name": "雷泽归妹",
    "text": "大限将至。"
  },
  {
    "name": "雷火丰",
    "text": "肝火上升，静养为宜。"
  },
  {
    "name": "火山旅",
    "text": "肝火过旺，性命交关。"
  },
  {
    "name": "巽为风",
    "text": "可能中风，须人扶行。"
  },
  {
    "name": "兑为泽",
    "text": "熟医可治。"
  },
  {
    "name": "风水涣",
    "text": "病情严重，恐难回天。"
  },
  {
    "name": "水泽节",
    "text": "节制饮食。"
  },
  {
    "name": "风泽中孚",
    "text": "有惊无险。"
  },
  {
    "name": "雷山小过",
    "text": "过寒或过热。"
  },
  {
    "name": "水火既济",
    "text": "大病初愈，仍需自理。"
  },
  {
    "name": "火水未济",
    "text": "血脉不顺，用药谨慎。"
  }
];

var yaoExplainSYData = [
  {
    "name": "乾为天",
    "yao": [
      "平：得此爻者，宜沉稳待机，若一动作即生灾疾，谋事不利，谨防小人。做官的会有阻力。经商的会有阻滞。女命则兴家业，孕生子。",
      "吉：得此爻者，会得到贵人的提拔。做官的会遇到明主，身居要职。读书人考试能获得佳绩。经商者获利。女命逢之，则又富又贵。",
      "平：得此爻者，会往来不停，财利难获，凡事不认真计画，躁动者会有损失。做官的会身兼重职，且事多繁冗，如果能保持忧虑和谨慎的态度则没有过失。女命逢之，性躁，难成为贤内助。",
      "平：得此爻者，百为艰难。做官的会停缺待职，等待机会。女命逢之，则安乐富贵也。",
      "吉：得此爻者，会遇到贵人，谋遂志得。做官的会飞黄腾达。女命则兼男权，难免孤独。",
      "凶：得此爻者，有过刚取凶之祸，五十以后者不寿。做官的会退职，或遭贬。女命逢之，其性必悍，难成为贤内助。"
    ]
  },
  {
    "name": "坤为地",
    "yao": [
      "平：得此爻者，宜谨防仇怨引起的纠纷。阴气盛的人则会大兴家业。做官的要谨防小人的谗言而生祸。",
      "吉：得此爻者，会不愁吃喝，衣食无忧。做官的会升迁，身居高位。女命则为贤良起家。",
      "平：得此爻者，谋望可成，认真经营会有收穫。做官的会有升迁的希望。女命则为德妇。",
      "平：得此爻者，经营受阻，大凡谨慎收敛者，则无横来之祸。做官的要谨守常职，可望升迁。女命则贤而起家。",
      "吉：得此爻者，将会获得财利，事事安稳，没有灾难。做官的将会升迁，飞黄腾达。女命则为德妇，贤惠之人。",
      "凶：得此爻者，有竞争的困扰，会有大的损失。做官的会有被贬之祸。"
    ]
  },
  {
    "name": "水雷屯",
    "yao": [
      "平：得此爻者，安分守己者则无忧，躁动者不利。做官的暂时未受到重用，坚守正道，好运可期。女命则为良妇而兴家。",
      "平：得此爻者，有婚嫁之喜事。做官的权柄日盛。",
      "凶：得此爻者，须安分守己，否则会有灾难。做官的有贪污之嫌，有被停职降职之忧。",
      "吉：得此爻者，谋事可成，百事和合，会得到朋友的帮助，大吉大利。做官的将会名声显赫，有升迁之机。",
      "平：得此爻者，谋事者切勿急躁，小事可成，大事无望，甚至会招来凶祸。",
      "凶：得此爻者，家道中落，须防损失。做官的须谨防小人的谗言。"
    ]
  },
  {
    "name": "山水蒙",
    "yao": [
      "凶：得此爻者，多有官诉，亲朋不和，多争斗，终能脱解。做官的为教育之职，或为司法系统之职。",
      "吉：得此爻者，人情和合，百事有成，或结婚，或生子孙，有财有福。做官的会守住官职。",
      "凶：得此爻者，会生是非，小则破财，大则伤身。做官的会因为贪婪而自取其辱。",
      "凶：得此爻者，人情淡薄，经营受阻。静无灾，动有损。做官的因为无人赏识而难以晋升。",
      "吉：得此爻者，依附贵人、良师者百事顺遂，谋望可成。",
      "平：得此爻者，宜守旧，须谨防争讼，寇盗之扰。做官的会有司寇之名职。"
    ]
  },
  {
    "name": "水天需",
    "yao": [
      "平：得此爻者，宜守旧，则无灾祸。做官的须守常职，耐心等待机会。",
      "吉：得此爻者，会受到争诉之扰，若能以宽厚待人，则不辩自明。做官的会受到流言的困扰，但最后吉祥。",
      "凶：得此爻者，须防止窃盗之患，亦要预防水险。做官的会被贬职。",
      "平：得此爻者，坏运逐渐远离，恢复平静。做官的能全身而退。从事国学者可出身成名。",
      "吉：得此爻者，会物产丰富，衣食不缺，也会有婚嫁之喜。做官的食禄会丰厚。",
      "平：得此爻者，宜谨慎，则忧愁自散。做官的会有升迁之机会，但须防谗邪之流。"
    ]
  },
  {
    "name": "天水讼",
    "yao": [
      "吉：得此爻者，会生起是非，但终吉。有病者，不药而愈。做官的会遭诽谤，但会不辩自明。",
      "平：得此爻者，平安无事。做官的会有食邑之荣。",
      "平：得此爻者，宜保持常态，则无灾难。做官的宜谨守常职，晋升无望。",
      "吉：得此爻者，会转危为安。做官的会闲中复职。",
      "吉：得此爻者，经营、谋事、求财皆大吉。做官的会受到重用。读书人会获得佳绩。",
      "平：得此爻者，会有争诉之忧，宜修德养身，化大为小。做官的会有成有败，患得患失。读书人认真学习，必可获佳绩。"
    ]
  },
  {
    "name": "地水师",
    "yao": [
      "凶：得此爻者，经营得当，则财货日增。但妄动者，成少败多。不良者，多险难刑伤。做官的宜谨守正道，则会得到上级的欣赏。",
      "吉：得此爻者，会遇到贵人，谋事可成。做官的会受到上级的赏识，有升迁之机会。读书人会取得佳绩。",
      "凶：得此爻者，多有悲优，或家中亲人病故。做官的会受职待缺。",
      "平：得此爻者，安居乐业，无妄动之灾。做官的官运不济，不宜妄想。",
      "平：得此爻者，财富日增，若用人得当，则谋望可成，但须谨防小人之危。做官的或有实权，或因为谏言而地位高显。读书人会取得佳绩。",
      "平：得此爻者，可立家计，或继承家业，但谨防小人从中作梗。做官的会当权立功。专业人才，会技艺成名。"
    ]
  },
  {
    "name": "水地比",
    "yao": [
      "吉：得此爻者，会遇到知己，谋事称心如意。做官的会有意外之喜。",
      "吉：得此爻者，得贵人之助，营谋遂意。做官的会无过失，安然而吉亨。读书人或能成名。女命则会得贤夫。",
      "凶：得此爻者，交友不慎，或有争诉，破财刑伤。做官的要谨防同僚不睦而造成不顺。女子则所嫁并非良人，破家丧身之象，不然则会争诉破财。",
      "吉：得此爻者，出外有利，多得知己之力，事事顺利。做官的会有升迁之喜。",
      "吉：得此爻者，会先逆后顺，谋事有成，无往不利。做官的会有大的荣耀。读书人会考的佳绩。",
      "凶：得此爻者，刑克有灾，人情淡薄，甚者恐有性命之忧。做官的会失去下属的支持，处境危难。"
    ]
  },
  {
    "name": "风天小畜",
    "yao": [
      "平：得此爻者，宜守旧业，不宜创新。谋事者，须防猜忌疑惑之祸。做官的会闲位复职。",
      "吉：得此爻者，有人相助，营谋遂意。做官的有升迁之机会。",
      "凶：得此爻者，荣而见辱，进而见退，或有足目之疾，或夫妻反目，或君臣疏远，或朋友是非，血气损伤。",
      "平：得此爻者，心诚者，人情和合，营谋颇遂。做官的会得到上司的提拔，久任者，能转运。",
      "吉：得此爻者，能得到他人的帮助，白谋称心。做官的会得到上级的赏识，下属的拥戴，德高望重。",
      "平：得此爻者，会受到小人的骚扰，宜修德养身，不妄进者，则可免灾。妇女占得此爻则凶，君子离家出行有凶险。"
    ]
  },
  {
    "name": "天泽履",
    "yao": [
      "平：得此爻者，营谋有计，则财利日增。做官的若修德养身，则有升迁之机。",
      "平：得此爻者，安然自乐，修身养性。做官会有全身而退之兆。",
      "凶：得此爻者，会有争诉，囚狱之扰，甚者家破人亡。做官的则会有被贬职之祸。",
      "平：得此爻者，会有危险，宜温和自持，可免灾祸。做官的会有虎符将帅之兆。读书人将会取得不错的佳绩。",
      "凶：得此爻者，躁动妄行者，则祸患将至，甚者有性命之忧。做官的会功高盖主，而不赏。",
      "吉：得此爻者，财利可获。做官的宜退而以享安静和平之福。读书人努力者可获佳绩。"
    ]
  },
  {
    "name": "地天泰",
    "yao": [
      "吉：得此爻者，志同合谋，财利日增。做官的会逐步升迁。",
      "吉：得此爻者，会有好运，必遇尊贵，但要防长上有损，言语有伤。做官的会身居高位，功名显达。",
      "平：得此爻者，须谨慎自持，宜保守，则安，不然会犯小人，事事遇阻。做官的会比较艰难，须防小人和别人的妒忌。",
      "平：得此爻者，营谋失利，退守可平安。做官的进取难成，宜退守。",
      "吉：得此爻者，会得到别人的赏识和抬举，或结婚生子，幸福安乐。做官的或能升迁，或有喜事。",
      "凶：得此爻者，会有破损，有疾病，谨慎厚道者可免祸。做官的会被贬职。"
    ]
  },
  {
    "name": "天地否",
    "yao": [
      "平：得此爻者，宜守旧，小人得势之时，爻辞虽好，但须谨防小人牵连之事。做官的受职者待缺，当权者防扰。",
      "平：得此爻者，宜忍耐，宽容待人，不然会生是非。做官的宜低调行事。",
      "凶：得此爻者，须防是非争诉之扰。做官的会退休离职。",
      "吉：得此爻者，家产日增，吉庆安乐。做官的会得到朋友和同僚之助，或升迁，或进财。",
      "吉：得此爻者，旧祸已去，好运将至，诸事皆吉。做官的会身居重位。",
      "平：得此爻者，将会转好运，久困者利可期，久讼者讼事解。做官的失职者复职，闲缺者会走马上任。"
    ]
  },
  {
    "name": "天火同人",
    "yao": [
      "平：得此爻者，能与人合伙经营获利，或出家远行，或修造门户，或在他处学习。做官的或会受到重用，或有升迁之机。",
      "凶：得此爻者，事多不定，与宗人朋友多不和，相互多猜忌，面和心不合，容易起是非。做官的没有升迁之机，需耐心等待。",
      "凶：得此爻者，或有丧亲，或有诉讼打官司之患。做官的须防被免职之忧。",
      "平：得此爻者，亲友之间会互相猜忌，荣中有辱，结果会好些，凡事须多加提防则可吉祥。做官的若能兢兢业业，则有提拔之机遇，或会受到表彰。",
      "平：得此爻者，先难后易，是非不一。做官的会先贬后升。",
      "平：得此爻者，宜守常，不宜激进。做官的则多有出差的机会。"
    ]
  },
  {
    "name": "火天大有",
    "yao": [
      "平：得此爻者，心绪不定，小人欺凌，很是艰辛，长辈或有灾难。做官的须急流勇退，不可贪婪荣华富贵。",
      "吉：得此爻者，营谋得利，财利丰厚，但不利于老人的健康。做官的闲职者会受到重用。",
      "平：得此爻者，有灾难，举步维艰，勿近小人。做官的会受到重任，读书人会取得很好的成绩。",
      "平：得此爻者，宜守常，则可避免伤害，眼睛方面或会出现病症。做官的须安于现状，不可激进，则可免祸。",
      "吉：得此爻者，须相时而动，切不可骄傲自负，以免自取其祸。做官的宜退不宜进。",
      "吉：得此爻者，得到祖上之庇佑，一路好运。做官的以及读书人会进职成名。"
    ]
  },
  {
    "name": "地山谦",
    "yao": [
      "平：得此爻者，宜远行或出游，出外做生意会发财。做官的须退守，不宜与人争利，出差的机会会多。",
      "吉：得此爻者，不宜轻举妄动，宜退守。做官的会升迁，读书人会进取成名。",
      "吉：得此爻者，营谋得利，但会劳心劳力。做官的会高升。",
      "吉：得此爻者，无所不通，但做官的、读书人及商人宜固守退让，太盛则有过。",
      "平：得此爻者，会得到贵人的帮助而成事，会获得利益，但须谨防生出祸端，与人争诉。当官的会文武兼用，利于进取。读书人会有金榜题名之机会。",
      "平：得此爻者，有争诉之扰，但会不辨自明。做官的须修德养身，进取有望。"
    ]
  },
  {
    "name": "雷地豫",
    "yao": [
      "凶：得此爻者，不顺，有口舌之争，前进有阻力。做官的不要得意忘形，须谨慎，以免生祸。读书人则可能会一鸣惊人。",
      "吉：得此爻者，会获利。做官的宜急流勇退，读书人有成名之机。",
      "凶：得此爻者，投机取巧，是非不一。",
      "吉：得此爻者，进取成名，经营获利。做官的会得到知己，进取有望。",
      "凶：得此爻者，多心事，有灾难，或有腹疾。做官的多洋洋得意，持恩固宠，难免有失。",
      "平：得此爻者，因为心气太高，会有诉争之扰，但若能改过自新，心态平和，则不会有过失。做官的会有贪污之嫌，须明哲保身。"
    ]
  },
  {
    "name": "泽雷随",
    "yao": [
      "吉：得此爻者，多获利。做官的正当好运，有升迁之机。",
      "凶：得此爻者，不安宁，或受小人的暗算，是非不断。当官的宜退守，进取者要有自知之明。",
      "平：得此爻者，营谋遂意，但宜走正道，才能得利。做官的会得到保举而升迁有望。",
      "平：得此爻者，会得到好人的抬举，化凶为吉。做官的会身居要职，努力进取者可成事，可获得名利。",
      "吉：得此爻者，营谋遂意，多喜庆之事，做官的会升职，或多喜事。",
      "凶：得此爻者，苦难多多，不很如意，重病者会有生命之忧。做官的须防止小人的谗言。"
    ]
  },
  {
    "name": "山风蛊",
    "yao": [
      "吉：得此爻者，会得到祖先的庇佑，营谋遂意。做官的会受到重任，改革创新。",
      "平：得此爻者，改旧从新，则会如意。女命勤俭持家，性忠直者多福。",
      "凶：得此爻者，躁进者有失，不听信谗言者则无难。",
      "凶：得此爻者，事事见忧，有足疾。",
      "吉：得此爻者，多喜庆之事，家中或进人口。做官的进取有望，名誉远播。",
      "平：得此爻者，宜守旧，好运者，多遇尊贵，能获得提拔。做官的宜退守，或告休。"
    ]
  },
  {
    "name": "地泽临",
    "yao": [
      "吉：得此爻者，会交好运，营谋称意。做官的会得到众人的拥戴，能升迁。读书人参加考试者必能考出佳绩。",
      "吉：得此爻者，营谋获利，但宜认清时机，不然不能成事，美中不足。做官的会光明磊落，地位清高。",
      "凶：得此爻者，有忧愁，会受苦劳累。做官的会受到小人的谗言攻击，志不能伸。",
      "平：得此爻者，人情和合，经营得利，但要成大事者，须谨慎而行，做好准备再进取。做官的会得到同僚的帮助。",
      "吉：得此爻者，万事如意。做官的会得到上司的赏识。",
      "吉：得此爻者，多获利，无往不利，但谨防气势太盛而变衰。做官的会得到上司的器重，委以重用。"
    ]
  },
  {
    "name": "风地观",
    "yao": [
      "凶：得此爻者，宜防小人，诸事有困难，弄巧成拙。做官的有危难，不宜进取。",
      "平：得此爻者，在家不如意，外出谋事则好，或喜或忧，或因妇人而起是非，大抵宜动不宜静。此爻女喜，男悲。",
      "平：得此爻者，三心二意，须谨慎行事，知难而退。做官的进退无常。",
      "平：得此爻者，宜出外谋事，多与外人交往，则有利。做官的或居閒职，清高之地。",
      "吉：得此爻者，时来运转，利益丰厚，对于妇人则有怀孕之喜，病重者有生命之忧。做官的会因为自己良好的官德，爵禄有升。",
      "平：得此爻者，运势不通，心有馀而力不足，怀孕者利于生育，久病者会痊癒。做官的宜退守，修德养身。"
    ]
  },
  {
    "name": "火雷噬嗑",
    "yao": [
      "凶：得此爻者，宜谨慎行事，以免生祸端。做官的会遭到贬职。",
      "平：得此爻者，进退艰难，是非不断，或生暗疾，骨肉有伤。做官的不会顺利，会有所纠结。",
      "凶：得此爻者，不易成事，运气不顺，或生心腹之疾，或有惊险。做官的才力不及，有失。",
      "吉：得此爻者，经商必获利。做官的会升迁，读书人会成名。",
      "吉：得此爻者，行好运，有病的会痊愈，有冤的会昭雪，读书人进取成名，做官的会剪除小人。",
      "凶：得此爻者，须防争诉，不良者，耳目不明，血气不顺，或有生命之忧。做官的须防止小人的谗言而遭致贬职。"
    ]
  },
  {
    "name": "山火贲",
    "yao": [
      "平：得此爻者，多奔波，静凶动吉。做官的须防退职之患。",
      "平：得此爻者，得人提拔，好运可期，但也要相时而动，不可随性而为，以免遭难。做官的会因人成事，升迁有望。",
      "吉：得此爻者，好运来到，不必费力，自然荣盛，即使有是非纠纷，也不足为患。做官的与人和睦，能居要职。",
      "平：得此爻者，先凶后吉，忧中有喜，虽有危险，终得安宁。未婚者，有望成家。做官的先难后易。",
      "吉：得此爻者，会遇贵人，经营获利，多喜事。做官的闲职者会受到重用，在职者福禄双全。",
      "平：得此爻者，须防好运转凶，家中、亲属有长辈或命终。做官的会升迁。"
    ]
  },
  {
    "name": "山地剥",
    "yao": [
      "凶：得此爻者，营谋不遂，或有手足之灾，或兄弟不睦，凶则家破身亡。做官的有升迁之机会，但宜见机行事。",
      "凶：得此爻者，营谋不遂，或受到小人的侵辱，或受到他人的猜忌。做官的须防被贬职。",
      "平：得此爻者，难遇知己，生涯不顺，欲求名利，必须创新，此爻像父母妻子或有忧，须谨防。做官的会遇到明主或大官提拔。",
      "凶：得此爻者，时运不佳，危难之时，多有争诉刑克之事。做官的须谨防小人的谗言，以免遭难。",
      "吉：得此爻者，人情和合，营谋得时，家和福生，妇人进财。做官的升高进职，居要位。读书人、学子考试必能考出佳绩。",
      "平：得此爻者，须谨慎，踏实稳重者可无忧。商人生意买卖会不错。做官的会有权柄。"
    ]
  },
  {
    "name": "地雷复",
    "yao": [
      "吉：得此爻者，万事如意，经营获利。做官的会位高权重。读书人会取得佳绩。",
      "吉：得此爻者，与人共利，事业兴旺，病者痊愈。做官的遭贬者会复职。",
      "平：得此爻者，事多反覆，阴阳差错，时好时坏。做官的职位不稳定，更变无定。",
      "平：得此爻者，好运可期，营谋得利。做官的会复职。",
      "吉：得此爻者，会有积蓄，但要谨防父亲出意外。做官的有升职之机会。",
      "凶：得此爻者，做事乖张，诸事不顺，静吉动凶。做官的会过于贪婪权力而有损。"
    ]
  },
  {
    "name": "天雷无妄",
    "yao": [
      "吉：得此爻者，营谋得利。做官的会得到上司的赞许，百姓的爱戴。",
      "吉：得此爻者，正当好运，不劳而获。富人进财多，商人出外获利。当官的会升官。读书人会取得佳绩。",
      "凶：得此爻者，无妄之灾，破财损身。做官的不宜进取。",
      "平：得此爻者，宜守旧，图谋有实，不致虚浮。做官的宜守职，勿妄动。",
      "平：得此爻者，营谋有成，病得愈，或有生育之喜。做官的纵有祸难，也会不辩自明，不解自释。",
      "平：得此爻者，好运已过，不可妄动，否则是非迭生，唯有变通可免祸。做官的妄动有被贬职之忧。"
    ]
  },
  {
    "name": "山天大畜",
    "yao": [
      "凶：得此爻者，宜守旧，不然会有不测之祸。做官的宜退居闲职，或退位。",
      "凶：得此爻者，谨防是非，或有足疾、腰疾。",
      "平：得此爻者，会得到长辈的重用，或知己相助，前运辛苦，后可有获。做官的会有实权。",
      "吉：得此爻者，营谋有望，财富增加。做官的会有升迁之喜。",
      "吉：得此爻者，营谋遂意，多有喜庆之事。做官的会高升。",
      "吉：得此爻者，万事如意，心想事成，好运连连。做官的会得到上司的提拔，或被举荐而高升。读书人会进取成名。"
    ]
  },
  {
    "name": "山雷颐",
    "yao": [
      "凶：得此爻者，为争夺财利而起祸，大凡心底善良守正道者可无忧。做官的会受贿，失其廉。",
      "凶：得此爻者，大起大落，是非不一，凶者病致死。做官的须防被贬职。",
      "凶：得此爻者，运势低迷，荒诞无稽，甚至有生死离别之伤。做官的有丧名失节之患。",
      "吉：得此爻者，会得到好人的帮助，营谋遂意。做官的会得到祖上的恩惠，幸宠有加。",
      "吉：得此爻者，会有依靠，事可成，但不可乘船涉险。做官的会因人而功可成，位可保。",
      "吉：得此爻者，营谋有成，无往不利。做官的爵禄荣重。读书人会取得佳绩。"
    ]
  },
  {
    "name": "泽风大过",
    "yao": [
      "平：得此爻者，谨慎行事，财利可固。凶者，防孝服之忧。做官的小心谨慎则禄位巩固。",
      "吉：得此爻者，或娶妻纳妾，或生子，君子得少妻义子。做官的去位者会复职。",
      "凶：得此爻者，须防大难而遭致家产有失，或有足目之疾。做官的须谨防被贬职。",
      "吉：得此爻者，多有修造之事，可做大事，勿谋小事。做官的必能受到重用。读书人进取成名。",
      "平：得此爻者，营谋不利，或喜中生忧，美事成丑；先逆后顺之象。做官的不可久任。",
      "凶：得此爻者，不宜进取，退守为安，面部或有疾。做官的有功高震主身危之祸。"
    ]
  },
  {
    "name": "坎为水",
    "yao": [
      "凶：得此爻者，时运不佳，宜防跌入陷阱灾难之中。做官的须防小人。",
      "平：得此爻者，有小成就，女命或为侍妾，凶者防险难或生心腹血气之疾。做官的会有小的成就，大事不成。",
      "凶：得此爻者，多坎坷，多争诉之事。做官的宜退守。",
      "平：得此爻者，多喜事，或有结婚之喜。做官的多饮食之乐。",
      "平：得此爻者，平淡无常，宜养精蓄锐。做官的没有危难，职位无忧。",
      "凶：得此爻者，须防牢狱之灾。做官的须防职权旁落之忧。"
    ]
  },
  {
    "name": "离为火",
    "yao": [
      "平：得此爻者，须防无妄之灾，宜谨慎，或有足疾。做官的宜安守。",
      "吉：得此爻者，财利可获。做官的会受到重用。读书人会取得佳绩。",
      "凶：得此爻者，乐中生悲，吉中生愁，险难迭生。做官的告休。",
      "凶：得此爻者，时运不济，困难重重，或和长辈不睦，或遭官灾。",
      "平：得此爻者，不宜进取，宜守常。做官的在位者得志，退职者多险危。",
      "吉：得此爻者，时运佳，多喜事，经营获利。做官的会功成名就，读书人会取得好成绩。"
    ]
  },
  {
    "name": "泽山咸",
    "yao": [
      "平：得此爻者，行事过急，多难成就。做官的须修身养性，等待机会，京官出，闲官起。",
      "平：得此爻者，奔波徒劳，宜静不宜动。做官的在位者吉，出差者有险。",
      "平：得此爻者，最好退守，做官的谨防被贬。",
      "平：得此爻者，朋友相助，可谋小事，大事有困难，心绪不定。做官的秉公执政，升迁有望。",
      "平：得此爻者，人情不合，营谋微小。做官的多与同僚不睦。",
      "平：得此爻者，多口舌之争，防止被他人诽谤，从事演讲、技艺、评论者吉。做官的或遭言责。"
    ]
  },
  {
    "name": "雷风恒",
    "yao": [
      "凶：得此爻者，人情乖离，前途渺茫，静守可免祸。做官的难于受到上司的赏识。",
      "平：得此爻者，安分守己则无忧。做官的宜洁身自爱，谨慎行事。",
      "凶：得此爻者，须防小人诽谤，争诉之扰。做官的须防被贬。",
      "凶：得此爻者，营谋费力，难以成事。做官的时运不济，有所退步。",
      "凶：得此爻者，多招毁谤，有所损失。做官的多阿谀权势而有失。",
      "凶：得此爻者，求名望利，小能成，大则无功，女人不利夫子。做官的会很劳累，多动少静。"
    ]
  },
  {
    "name": "天山遁",
    "yao": [
      "凶：得此爻者，宜安分守己，可无忧。做官的宜择机而退。",
      "平：得此爻者，家中有争执，安常守分无忧，农人有进牛畜之喜 。",
      "平：得此爻者，多灾多难，良善者，得妻之力，或进人口。做官的宜急流勇退。",
      "平：得此爻者，虽有收穫，但谨防因小人而受祸。做官的宜告休避难。",
      "吉：得此爻者，近贵多利。做官的或升迁，或功成身退。",
      "吉： 得此爻者，营谋获利，家肥业厚。做官的乐天知命，退居闲职。"
    ]
  },
  {
    "name": "雷天大壮",
    "yao": [
      "凶：得此爻者，会有争诉，动则凶，须防足疾。做官的须防小人的谗言而受辱。",
      "吉：得此爻者，营谋得意。做官的中庸处事，心中无愧。",
      "凶：得此爻者，或有官司之事，或家中有丧，人财不利。做官的多祸难，进退难安。",
      "吉：得此爻者，常人得福，久静者必动，动则吉。做官的闲职者复职，进取如意。",
      "凶：得此爻者，一筹莫展，不能得利，病者有丧身之兆。做官的会荒于政务。",
      "平：得此爻者，进退两难，多是非争诉，宜守常。做官的宜退不宜进，恐有遭贬之危。"
    ]
  },
  {
    "name": "火地晋",
    "yao": [
      "平：得此爻者，忧愁参半，静则吉动则凶。做官的不宜进取，须防流言。",
      "吉：得此爻者，求谋称意，多得母亲扶助，或得妻财。做官的守正者会进取。",
      "平：得此爻者，得朋友之助，营谋遂意，但谨防意外之险。做官的有升迁之机。",
      "凶：得此爻者，时运不佳，或有争诉。做官的不宜进取，有阻力，须守正。",
      "吉：得此爻者，好运到来，营谋获利。做官的有升迁之喜。",
      "平：得此爻者，有修屋宇之喜，不良者有争诉之忧。做官的有食邑之荣。"
    ]
  },
  {
    "name": "地火明夷",
    "yao": [
      "平：得此爻者，或有手足之伤，善者有进财纳福之喜。做官的有飞黄腾达之象，但谨防有失。",
      "吉：得此爻者，常人或有难，但会得贵人之助。做官的会有实权，能当大任。读书人会取得好成绩。",
      "平：得此爻者，有修屋宇造作之兆。不良者，左股或有伤，多忧愁分离之患。",
      "平：得此爻者，出外营谋者会顺利，妇人有孕者生男，不良者或生心腹之疾。做官的闲职者会复职，在职者，多出外任职，韬光养晦者必出身成名。",
      "平：得此爻者，难逢知己，或有家难之祸。做官的须修德养性可保无忧。",
      "凶：得此爻者，先喜后忧，老者或不寿。做官的防止遭人流言，或被贬。"
    ]
  },
  {
    "name": "风火家人",
    "yao": [
      "平：得此爻者，谋事有成，未婚者会结婚，老者不利于寿。做官的闲职者会晋升有实权，当职者则权力旁落。",
      "吉：得此爻者，营谋成家，多喜事。做官的会荣华富贵。",
      "凶：得此爻者，忧喜参半，谨防沉迷于享乐中。做官的严而少宽恕之恩。",
      "吉：得此爻者，时运正佳，贵人提拔，孤寡见亲。做官的仕途顺利，升迁有望。",
      "吉：得此爻者，营谋得利，会得到贵人的提携。做官的显贵，进取有望。",
      "吉：得此爻者，营谋称意，女命更好。做官的位高权重，读书人进取成名。"
    ]
  },
  {
    "name": "火泽睽",
    "yao": [
      "平：得此爻者，营谋先失而后得，人事先离而后合，谨防凶恶之灾患。做官的闲职者复职，被贬者复升。",
      "平：得此爻者，会得知己，营谋遂意。做官的会遇到明主，升迁有望。",
      "凶：得此爻者，谋望有阻，险中求安，先迷后顺。不良者有骨肉刑伤之厄。做官的须防小人的谗言。",
      "平：得此爻者，能得到朋友的帮助，转危为安，求婚者必配。做官的会得到同僚的推荐，升迁有机。",
      "平：得此爻者，经营获利，抬举有人。不良者，亲朋怨恶，骨肉刑伤，官司牵连。做官的会获得成就与名望，读书人会取得佳绩。",
      "平：得此爻者，遭污受诬，先损后益。做官的须防被诽谤之忧。"
    ]
  },
  {
    "name": "水山蹇",
    "yao": [
      "平：得此爻者，宜守旧安常。做官的稳步进取，好运将至。",
      "凶：得此爻者，涉艰历险，营谋有阻。做官的宜保持忠贞，报效国家。",
      "平：得此爻者，不宜进取，或有妻子之喜。做官的位高者会晋升。",
      "凶：得此爻者，不良者会有争诉。做官的进升有机，求名望利皆有实而不虚。",
      "吉：得此爻者，会得到贵人提举，无往不利。",
      "吉：得此爻者，好运来到，营谋遂意。做官的会身居要职，读书人进取成名。"
    ]
  },
  {
    "name": "雷水解",
    "yao": [
      "平：得此爻者，经营者吉，未婚者配。做官的德位相称，晋升有望，读书人会取得好成绩。",
      "吉：得此爻者，正当好运，财利可获。做官的会荣华富贵，读书人会取得佳绩。",
      "凶：得此爻者，须防窃盗，是非诉讼。做官的谨防被贬之忧。",
      "凶：得此爻者，须防小人，或交友不慎之祸。",
      "吉：得此爻者，正当好运，君子有利，病者愈。做官的会身居要职。",
      "吉：得此爻者，运途顺利，多营谋获利。做官的闲职者会复职，居要位。"
    ]
  },
  {
    "name": "山泽损",
    "yao": [
      "平：得此爻者，谋事得当，可获利，不良者，或因酒食误事。做官的会因为工作忙碌而顾不得家庭，声望日盛。",
      "凶：得此爻者，宜谨守勿动。做官的时机未成熟，难于升迁。",
      "平：得此爻者，合力经营，获利者多，未婚者配。做官的与同僚关系融洽，进取有望。",
      "平：得此爻者，多喜庆之事，有灾者转好运，有病者愈，有忧者转喜。做官的闲职者将被起复。",
      "吉：得此爻者，运势大好，财利丰富。做官的会得到领导的讚赏和提拔。读书人会取得佳绩。",
      "吉：得此爻者，贵人扶持，财利可期。做官的会得到下属的爱戴，领导的器重。"
    ]
  },
  {
    "name": "风雷益",
    "yao": [
      "吉：得此爻者，大事可成，万事称心。做官的会高升，读书人会取得大的成绩。",
      "吉：得此爻者，商贾获利，福份多多。做官的仕途一帆风顺，读书人进取成名。",
      "平：得此爻者，常人获利，不良者大凶，官灾祸患并至。做官的会受到重用，委以重职。",
      "平：得此爻者，或会迁居，或有修造，诉者利，官者伸。做官的会被领导委以重任。",
      "吉：得此爻者，谋望称意，事多顺利。做官的会遇到明主，仕途顺利。",
      "凶：得此爻者，贪图名利，或有意外之祸，刑克损伤之灾。做官的因为贪求名位，或被贬职。"
    ]
  },
  {
    "name": "泽天夬",
    "yao": [
      "凶：得此爻者，会有无妄之灾，宜静守。做官的躁动者有损。",
      "凶：得此爻者，多忧愁，多惊险，谨防盗窃之事发生。做官的多掌兵权。",
      "凶：得此爻者，会有争诉之忧，品行端正者无忧，初见艰难，终得安乐。做官的除奸不成，反被倒咬一口。",
      "凶：得此爻者，心绪不定，所谋不成。做官的有心而力不足，难于升迁。",
      "平：得此爻者，营谋遂意，诉者伸，有病者愈。做官的须防奸邪之辈侵害。",
      "凶：得此爻者，营谋不成，宜守常，不良者，骨肉刑克，是非缠绕。做官的难于久任，激流勇退为佳。"
    ]
  },
  {
    "name": "天风姤",
    "yao": [
      "平：得此爻者，或遇贵人好友提携而发财进人，女人有生育之喜。不良者，防疾诉忧患，或女人有不贞之事。做官的有被贬职之忧。",
      "平：得此爻者，有财运，妇人则有怀孕之喜。做官的晋升有望。",
      "凶：得此爻者，多灾难。做官的会退步，或者被贬。",
      "凶：得此爻者，多是非之扰，年老者不利于寿。做官的有损，多难。",
      "平：得此爻者，会遇到贵人提携，有意外之喜，妇人有怀孕之喜。做官的会为栋梁之才。",
      "凶 得此爻者，营谋艰辛，孤立无助。做官的功名大显，但好运将尽。读书人努力进取者能取得佳绩。"
    ]
  },
  {
    "name": "泽地萃",
    "yao": [
      "平：得此爻者，会受到小人的陷害，先凶后吉，宜谨慎从事。做官的会被贬职。",
      "吉：得此爻者，正当好运，贵人提举，营谋得利。做官的得人引荐，能升迁。",
      "凶：得此爻者，家裡不安，六亲有损，老者多凶。做官的在位不得安宁，出外则艰辛。",
      "平：得此爻者，不从正道者，会有凶祸，惟大德君子，可改过得福。做官的须防他人猜忌，宜弃高就低，急流勇退为吉。",
      "平：得此爻者，人情不合，营谋有阻。做官的不得人心，其志未光。",
      "凶：得此爻者，事多烦扰，不能安宁，或上下无情，长幼忧愁，名利成虚。"
    ]
  },
  {
    "name": "地风升",
    "yao": [
      "吉：得此爻者，名利双收，营谋遂心。做官的晋升有望。",
      "平：得此爻者，常人有喜，病者安，谋事可成。做官的有升迁之机。",
      "平：得此爻者，营谋遂意。做官的会身居要位，读书人可成名。",
      "吉：得此爻者，得山林之利，隐者有山林之乐。做官的会升迁，身居要职。",
      "吉：得此爻者，正行好运，大愿可成。做官的会高升。",
      "平：得此爻者，有贪得无厌之祸。做官的会告休。"
    ]
  },
  {
    "name": "泽水困",
    "yao": [
      "凶：得此爻者，有惊忧，或有丧服之灾。做官的会退职。",
      "平：得此爻者，得贵人提携，营谋获利，静吉动凶。做官的有晋升之机。",
      "凶：得此爻者，多难之时，宜守正谨慎。",
      "凶：得此爻者，谋事虽然不利，但终有出险之时，从商者或周转不利。做官的闲职者会被起用。",
      "凶：得此爻者，先难后易，不良者有诉邢之扰，丧服之忧。做官的先阻后顺。",
      "平：得此爻者，防惊忧丧服，惟商人、旅行者利有攸往。做官的会有刑罚束缚之忧。"
    ]
  },
  {
    "name": "水风井",
    "yao": [
      "凶：得此爻者，谋事有阻。做官的会退居闲职，求名者不遂。",
      "凶：得此爻者，宜谨守以避祸。做官的宜退以自保。",
      "平：得此爻者，安分守己为吉，不良者或有灾。做官的难逢明主，需另觅良机。",
      "平：得此爻者，宜安分守己，或有迁居之喜。做官清廉者，修身立命，可望上进。",
      "吉：得此爻者，营谋遂意。做官的品行端正，会得到上司的赞赏。",
      "吉：得此爻者，谋事顺利，材用充足。做官的功高德厚，能得升迁。"
    ]
  },
  {
    "name": "泽火革",
    "yao": [
      "平：得此爻者，宜谨守常规，不可存非分之想。做官的不宜进取，切不可怀出位之思。",
      "吉：得此爻者，多喜庆之事，做官的会升迁。",
      "凶：得此爻者，多事之时，谨慎而行。做官的有躁动失政之忧。",
      "平：得此爻者，会有转变，有收穫。做官的会有升迁之机。",
      "吉：得此爻者，时运转好，多吉利之事。做官的晋升有望。",
      "平：得此爻者，安分守己则是非不扰。做官的进取者会晋升，离退休者会功成身退。"
    ]
  },
  {
    "name": "火风鼎",
    "yao": [
      "平：得此爻者，因人成事，多喜事，或结婚，或生子，忧者喜，贱者贵。做官的会因功得晋升。",
      "吉：得此爻者，虽有收穫，但须防忧。做官的秉公执政，须防小人的谗言之扰。",
      "平：得此爻者，先难后易，老者多福，年轻人多不如意。做官的会遇到阻力，但最终的结果会好。",
      "凶：得此爻者，多灾之时，或生足疾。做官的有被贬职之忧。",
      "吉：得此爻者，时运不错，多获利。做官的多吉兆，多升迁。",
      "吉：得此爻者，安稳利达，谋求遂意。做官的闲职者复职，离退者功成身退。"
    ]
  },
  {
    "name": "震为雷",
    "yao": [
      "吉：得此爻者，好运到来，先惊后喜。",
      "凶：得此爻者，多难之时，或有争诉，小心为妙。做官的有遭奸邪之辈陷害之忧。",
      "凶：得此爻者，多忧愁，多灾难，宜谨慎，可免祸。做官的不宜进取。",
      "凶：得此爻者，一筹莫展，前进有阻。做官的有被贬职之危。",
      "凶：得此爻者，不吉之时，或有手足受损之忧。做官的守常者无忧。",
      "凶：得此爻者，须谨防意外，或夫妻有刑克，亲邻遭难。做官的要谨防被贬职之忧。"
    ]
  },
  {
    "name": "艮为山",
    "yao": [
      "平：得此爻者，宜守本份，不要纵欲。做官的保守己职者无失。",
      "凶：得此爻者，运势受阻，或奔波在外，多劳苦；或有足疾。做官的得不到他人的帮助，不宜上进。",
      "凶：得此爻者，不顺之时，危难不安。",
      "平：得此爻者，宜安分守常，不可有非分之想。",
      "平：得此爻者，正人君子，人情和合，谋望遂意。做官的会居要职。",
      "吉：得此爻者，多福多利，但易防不吉之事。做官的会升迁，读书人会取得佳绩。"
    ]
  },
  {
    "name": "风山渐",
    "yao": [
      "凶：得此爻者，运气不佳，谋为不利。",
      "吉：得此爻者，无往不利，随处皆安。",
      "凶：得此爻者，多惊扰，人情不睦，盗贼侵害。做官的上进有阻力，有被贬之忧。",
      "平：得此爻者，利于修造，自给自足。做官的须随遇而安，升迁无定。",
      "吉：得此爻者，先难后易，做官的多招诽谤，先暗后明。",
      "吉：得此爻者，得人荐举，谋望有成，祸患不侵，多福多利。做官的大运来到，会得到重用。读书人会取得好成绩。"
    ]
  },
  {
    "name": "雷泽归妹",
    "yao": [
      "吉：得此爻者，有小德，谋望顺遂。做官的或有政绩。",
      "平：得此爻者，不宜进取，守旧者则祸害不生。",
      "凶：得此爻者，进退无常，劳役悲苦。做官的有被降职之忧。",
      "平：得此爻者，不是佳期，须待时运。",
      "吉：得此爻者，正值好运，或成婚，或得财。做官的会受到重用，身居要职。",
      "凶：得此爻者，事多不顺，营谋皆空。做官的居虚位而无实禄。"
    ]
  },
  {
    "name": "雷火丰",
    "yao": [
      "平：得此爻者，得贵人提拔，谋望有成，不良者有大过，必招灾殃。做官的会遇到明主，得以晋升。",
      "吉：得此爻者，有久困发财之美，有讼者不辩自明，有病者会愈。做官的忠言多阻于邪议，先失后得。",
      "平：得此爻者，营谋难遂，或明而受蔽，争诉日起，或手足有疾，难于做事。做官的有告休之兆。",
      "平：得此爻者，明而受蔽，得人解释而吉。做官的受到领导和同僚的猜忌，位不安。",
      "吉：得此爻者，会得好人提举，谋望称意。读书人会取得佳绩。",
      "凶：得此爻者，骨肉相残，离祖成家，难免口舌之争。做官的位高者有危。"
    ]
  },
  {
    "name": "火山旅",
    "yao": [
      "凶：得此爻者，运气不佳，须防祸难。做官的有才但不能受到上司的重用。",
      "吉：得此爻者，运气转好，营谋有成。做官的显耀。",
      "凶：得此爻者，运势转坏，多灾多难。做官的有离职之忧。",
      "凶：得此爻者，在外者，有所成就，但美中之足，有忧惨是非之事发生。从商者会获利。",
      "吉：得此爻者，会得到老者的帮助，事有所成。",
      "凶：得此爻者，先好后坏，或迁居修造以避灾难，或有目疾，或会遭火灾。做官的难保其位，有先得后失之忧。"
    ]
  },
  {
    "name": "巽为风",
    "yao": [
      "平：得此爻者，有得有失，不良者多招诽谤。做官的或有差役，进退不一，或有兼权，难中有易。",
      "吉：得此爻者，诚恳待人，谋望获利。做官的有升迁之机。",
      "凶：得此爻者，运势低迷，有穷困之厄。做官的有被贬职之忧。",
      "吉：得此爻者，正当好运，多福多利。读书人会取得佳绩。",
      "吉：得此爻者，谋望有成，无往不利。做官的先阻后顺。",
      "凶：得此爻者，多损失，或生疾病。做官的有运不逢时，须谨慎。"
    ]
  },
  {
    "name": "兑为泽",
    "yao": [
      "吉：得此爻者，人情和合，百谋皆遂。",
      "吉：得此爻者，正当好运，事事和顺。做官的有升迁之兆。",
      "凶：得此爻者，会有意外之祸，甚者则失道忘身。做官的有听信谗言而遭辱之忧。",
      "平：得此爻者，从商获利，或进人口，不良者或有疾病，谋望不成。做官的会身居要职，升迁有望。",
      "凶：得此爻者，时运不佳，多意外之祸。做官的会受到小人的诽谤。",
      "平：得此爻者，营谋不顺，谨防有忧。"
    ]
  },
  {
    "name": "风水涣",
    "yao": [
      "吉：得此爻者，得尊上提举，营谋皆遂。做官的会受到重用，有望晋升。",
      "平：得此爻者，谋望有成，或会成家。做官的有实权。",
      "平：得此爻者，常人获利。做官的出外就职。",
      "吉：得此爻者，先凶后吉，谋望和合，求利可获。做官的会身居要职。",
      "吉：得此爻者，正当好运，事事皆吉，求利者遂。做官的会升迁。",
      "平：得此爻者，先难后易，运势好转。做官的外出就职者会有灾难。"
    ]
  },
  {
    "name": "水泽节",
    "yao": [
      "平：得此爻者，进取不利，宜守旧。",
      "凶：得此爻者，时运不佳，事多乖离，宜动不宜静。做官的不得时运。",
      "平：得此爻者，多辛苦，少收获。",
      "吉：得此爻者，秉公守法，安于正道，福利可获。做官的会得到上司的欣赏，升迁有望。",
      "吉：得此爻者，正当好运，谋望有成。",
      "凶：得此爻者，不得天时，名利皆无。做官的不知变通，前途渺茫。"
    ]
  },
  {
    "name": "风泽中孚",
    "yao": [
      "吉：得此爻者，得贵人提举，谋事有成，但喜中有忧，宜行正道，修身养性，不可逸乐。做官的会受到举荐，能居要职。",
      "吉：得此爻者，无往不利，多进钱财，或生子。做官的会晋升。",
      "凶：得此爻者，喜中有忧，事多反覆。做官的同僚不睦，先进后退。",
      "平：得此爻者，能得到提拔，但有失去配偶或财产有失之忧。做官的会晋升，身居要位。",
      "吉：得此爻者，人情和合，谋事有成，无往不利。做官的君臣一心，会得到上司的赞赏。",
      "凶：得此爻者，多虚少实，前路凶险。经商者会有损失。做官的有近颜之喜。"
    ]
  },
  {
    "name": "雷山小过",
    "yao": [
      "凶：得此爻者，不得天时，灾难突来。做官的有骤然取祸之忧。读书人则有一飞冲天之兆。",
      "平：得此爻者，得贵人指引，谋望有成。做官的严于律己，恪守己职，则升迁有望。",
      "凶：得此爻者，时运不济，谨防意外。做官的须防小人奸邪之辈所害。",
      "平：得此爻者，宜安常守职，不可妄动。",
      "平：得此爻者，不利谋事，守旧为佳。做官的有告休之危。",
      "凶：得此爻者，时运不佳，不知退守，过刚则折。"
    ]
  },
  {
    "name": "水火既济",
    "yao": [
      "平：得此爻者，时运未到，欲动未动，安保无虞。做官的有职未受，有位未登。",
      "平：得此爻者，先难后易，做官的有先逆后顺之美。",
      "凶：得此爻者，有结怨争诉之损。做官的多差遣征伐之举。",
      "平：得此爻者，时运平平，有备则无患。做官的须做好预防，则爵禄稳固。",
      "吉：得此爻者，近谋有实，远谋多虚，不利东方，利于西方。",
      "凶：得此爻者，小人侵扰，坐船者，防溺水之灾。做官的有过刚则折之忧。"
    ]
  },
  {
    "name": "火水未济",
    "yao": [
      "凶：得此爻者，经营不利，涉水行舟者，谨防溺水之患。做官的仕途有阻，不能前进。",
      "吉：得此爻者，安份守纪者，谋望遂意。做官的克服困难者，晋升有望。",
      "凶：得此爻者，宜见机行事，不宜妄动。做官的有因人成事之美。在商旅则涉川历险而利可获。",
      "吉：得此爻者，会得好人提举，获利丰厚。做官的会受到重用，名利双全。读书人会取得佳绩。",
      "吉：得此爻者，谋望有成，财利丰厚。做官的能得到升迁。",
      "平：得此爻者，行险而顺，不良者有溺水之厄，纵酒之灾。做官的有望升迁。"
    ]
  }
];

var yaoExplainFPRshiyunData = [
  {
    "name": "乾为天",
    "yao": [
      "培养实力，等待机会。",
      "得贵人之助，有发展机会。",
      "功名未显，戒慎免咎。",
      "一举成名。",
      "直上云霄。",
      "由满招损，退而自省。"
    ]
  },
  {
    "name": "坤为地",
    "yao": [
      "由卑而尊，不可躁进。",
      "功可成，名可就。",
      "待时而发，可保功名。",
      "收敛为要，但求无过。",
      "功名大显。",
      "穷途末路。"
    ]
  },
  {
    "name": "水雷屯",
    "yao": [
      "欲进不进，坚守正道。",
      "一时未成，十年可成。",
      "求宝得利，殊不足取。",
      "顺势而为，大有发展。",
      "无人提拔，暂时无望。",
      "前无去路，保命为要。"
    ]
  },
  {
    "name": "山水蒙",
    "yao": [
      "求荣反辱，收敛自己。",
      "有财有福，子可继业。",
      "见财忘义，声名破败。",
      "远水近火，无济于事。",
      "功名未成，得良师则吉。",
      "宜守不宜攻，与人和睦。"
    ]
  },
  {
    "name": "水天需",
    "yao": [
      "必须久待，守恒为要。",
      "流言困阻，最后吉祥。",
      "难期上达，谨慎自持。",
      "用尽心力才可出头。",
      "功成名就，可以宴乐。",
      "凭险自守，和解为贵。"
    ]
  },
  {
    "name": "天水讼",
    "yao": [
      "不会久困，终可出名。",
      "退而隐居，可保无害。",
      "谨守旧业，求仕无成。",
      "转危为安。",
      "以正求进，必可大显。",
      "患得患失，殊为不值。"
    ]
  },
  {
    "name": "地水师",
    "yao": [
      "失道以求，终受其辱。",
      "杰出人才，大受赏识。",
      "无德有位，难免于凶。",
      "官运不济，不宜妄想。",
      "德胜于才，否则凶险。",
      "论功行赏，勿做小人。"
    ]
  },
  {
    "name": "水地比",
    "yao": [
      "诚信交往，声名日隆。",
      "实至名归，自然吉祥。",
      "交友不正，声名破败。",
      "得人赏识，功名可期。",
      "善待别人，后仍有吉。",
      "六神无主，恐有凶祸。"
    ]
  },
  {
    "name": "风天小畜",
    "yao": [
      "退守自保，无灾无难。",
      "因人成事，获利大吉。",
      "阴盛阳衰，内外不安。",
      "切忌争斗，出门远避；升迁靠长官提拔。",
      "一时亨通，无往不利。",
      "长期梦想，终可如愿。"
    ]
  },
  {
    "name": "天泽履",
    "yao": [
      "等待时机，自有成就。",
      "高尚其志，修身以道。",
      "退守为宜，妄动则凶。",
      "温和笃实，终可免祸。",
      "拨云见日，勿忘艰苦。",
      "晚运亨通，福寿双全。"
    ]
  },
  {
    "name": "地天泰",
    "yao": [
      "因人成事，逐步升迁。",
      "功名显达，海外亦宜。",
      "谨慎保守，逸乐亡身。",
      "朋友同心，诸事可谋。",
      "谦虚待人，万事皆吉。",
      "谨慎自守，须防小人。"
    ]
  },
  {
    "name": "天地否",
    "yao": [
      "合伙谋事，家有吉祥。",
      "宽容待人，万事皆吉。",
      "谨慎自守，以避羞辱。",
      "好运来到，谋事可成。",
      "安不忘危，诸事皆吉。",
      "亨通如意，讼事可结。"
    ]
  },
  {
    "name": "天火同人",
    "yao": [
      "眼前平顺，外出经营。",
      "相忌者多，未能顺遂。",
      "潜心三年，再谋其事。",
      "退守不动，反而吉祥。",
      "辛苦有成，得偿心愿。",
      "闲散之地，诸事无碍。"
    ]
  },
  {
    "name": "火天大有",
    "yao": [
      "刻苦自勉，等待好运。",
      "正交好运，一路顺风。",
      "显荣之时，取贿必败。",
      "持盈保泰，知足不辱。",
      "众人信服，晚运亨通。",
      "一路好运，事皆吉祥。"
    ]
  },
  {
    "name": "地山谦",
    "yao": [
      "不与人争，自可无难。",
      "声名传开，颇为得意。",
      "劳苦有成，晚运亨通",
      "正当好运，诸事皆吉。",
      "振作自强，不可姑息。",
      "大运已过，心意受阻。"
    ]
  },
  {
    "name": "雷地豫",
    "yao": [
      "得意忘形，致遭困境。",
      "人品高尚，不逐浮华。",
      "本身不正，因而有悔。",
      "大运正行，不必担心。",
      "性格柔弱，难以振作。",
      "冬去春来，奋发有为。"
    ]
  },
  {
    "name": "泽雷随",
    "yao": [
      "交运之时，利于变动。",
      "形势颠倒，最好谨慎。",
      "求财求名，皆为正运。",
      "吉凶互见，明年吉祥。",
      "正当好运，诸事皆吉。",
      "困难重重，难以如意。"
    ]
  },
  {
    "name": "山风蛊",
    "yao": [
      "克勤克俭，前途光明。",
      "顺势而行，不可草率。",
      "痛改前非，仍有未来。",
      "不可因循，否则自误。",
      "自行振作，仍可扬名。",
      "以退为进，较为有利。"
    ]
  },
  {
    "name": "地泽临",
    "yao": [
      "初交好运，守正大吉。",
      "贵人相助，运气正佳。",
      "知悔改正，后运可期。",
      "好运已到，有吉无凶。",
      "正当好运，又有人助。",
      "好运已止，忠厚无咎。"
    ]
  },
  {
    "name": "风地观",
    "yao": [
      "初运未佳，但无大碍。",
      "最好退守，女性有利。",
      "度德量力，稍安毋躁。",
      "正当好运，名胜于利。",
      "直道而行，无往不利。",
      "大运已过，自省无碍。"
    ]
  },
  {
    "name": "火雷噬嗑",
    "yao": [
      "须防小灾，慎免大患。",
      "才力尚浅，须借人助。",
      "气运不佳，反遭人怨。",
      "改旧促新，万事皆吉。",
      "正当行运，无不如意。",
      "柔和处世，可保无虞。"
    ]
  },
  {
    "name": "山火贲",
    "yao": [
      "个性清高，德优于名。",
      "平平淡淡，依人成事。",
      "名利双收，光华润泽。",
      "安分则吉，明年亨通。",
      "虽为正运，勤俭为宜。",
      "好运已终，恬谈自适。"
    ]
  },
  {
    "name": "山地剥",
    "yao": [
      "命当剥削，防有足疾。",
      "日益低落，哑子黄莲。",
      "运虽不正，尚能自反。",
      "显然不佳，须防受伤。",
      "气运堂皇，事无不利。",
      "眼前衰落，一年方起。"
    ]
  },
  {
    "name": "地雷复",
    "yao": [
      "好运渐起，一切顺利。",
      "择善而从，万事皆吉。",
      "时好时坏，自己把握。",
      "虽想振作，力有未逮。",
      "宽厚处之，有功无悔。",
      "做事乖张，谨慎免祸。"
    ]
  },
  {
    "name": "天雷无妄",
    "yao": [
      "株守不宜，出而有为。",
      "适得正运，意外之财。",
      "尴尬之期，小心意外。",
      "气运平顺，妄动有咎。",
      "气运正好，不必介意。",
      "好运已终，不可妄动。"
    ]
  },
  {
    "name": "山天大畜",
    "yao": [
      "采取守势，等待援兵。",
      "以退为进，可保无患。",
      "临事而惧，马到成功。",
      "得人赏识，可以升迁。",
      "不可躁进，定而后动。",
      "青云直上，可喜可贺。"
    ]
  },
  {
    "name": "山雷颐",
    "yao": [
      "舍己观人，徒慕虚名。",
      "侥倖得成，终究是凶。",
      "无路可走，闭门思过。",
      "养精蓄锐，可图功名。",
      "固守为宜，急进难成。",
      "谨慎努力，可以成功。"
    ]
  },
  {
    "name": "泽风大过",
    "yao": [
      "宽柔待人，一起成功。",
      "晚年成名，反败为胜。",
      "刚愎自用，虽成终败。",
      "可担大任，勿图小事。",
      "晚年得意，求其平顺。",
      "下过苦工，赢得声名。"
    ]
  },
  {
    "name": "坎为水",
    "yao": [
      "侥倖求名，反而受损。",
      "小试有利，不可图大。",
      "守住困穷，以待未来。",
      "春风得意，欢宴嘉宾。",
      "不可自大，功名有限。",
      "意外之灾，小心牢狱。"
    ]
  },
  {
    "name": "离为火",
    "yao": [
      "临事而惧，得助而成。",
      "文明在外，功名必显。",
      "老大无成，心思涣散。",
      "为免灾祸，不如隐退。",
      "位高权重，慎谋能断。",
      "与人为善，必受重用。"
    ]
  },
  {
    "name": "泽山咸",
    "yao": [
      "捷足先登，一举成名。",
      "退守为要，依人成事。",
      "最好退守，声名不彰。",
      "功名显达，不正则恶。",
      "所求未成，稍待时日。",
      "口才过人，心存正直。"
    ]
  },
  {
    "name": "雷风恒",
    "yao": [
      "安分知足，求荣反辱。",
      "稳住阵脚，可以免祸。",
      "三心二意，如何成功。",
      "不得正位，徒劳无功。",
      "迷恋感情，因小失大。",
      "功名已尽，不可妄动。"
    ]
  },
  {
    "name": "天山遁",
    "yao": [
      "深藏不露，不会有难。",
      "虽有才华，功能难望。",
      "急流勇退，可保无害。",
      "君子正名，小人盗名。",
      "功成身退，值得嘉许。",
      "乐天知命，安享天年。"
    ]
  },
  {
    "name": "雷天大壮",
    "yao": [
      "有勇无谋，功名必卑。",
      "中庸处世，受到肯定。",
      "临事而惧，谦退受益。",
      "前途无阻，功名亦显。",
      "亡羊补牢，晚年有望。",
      "早些退休，以免后悔。"
    ]
  },
  {
    "name": "火地晋",
    "yao": [
      "耐心等待，不必急进。",
      "所求多阻，守正必亨。",
      "众人悦服，自无懊恼。",
      "守正为宜，耍诈必凶。",
      "灾去福来，无意得之。",
      "好运将终，防有事故。"
    ]
  },
  {
    "name": "地火明夷",
    "yao": [
      "未能腾达，善自保全。",
      "贵人相助，幸免于难。",
      "退守南方，可以得志。",
      "出明入暗，出门为宜。",
      "君子固穷，未来通达。",
      "先好后坏，收敛为宜。"
    ]
  },
  {
    "name": "风火家人",
    "yao": [
      "好运初来，自我检点。",
      "因人成事，尚可如意。",
      "刻苦有成，逸乐则废。",
      "发财保家，正当好运。",
      "人心感通，自然吉祥。",
      "万物皆吉，好运将尽。"
    ]
  },
  {
    "name": "火泽睽",
    "yao": [
      "好运初至，顺其自然。",
      "风云际会，勇往直前。",
      "恐有刑伤，苦撑三年。",
      "孤僻个性，朋友相助。",
      "同宗相助，可以放心。",
      "运转之时，正心诚意。"
    ]
  },
  {
    "name": "水山蹇",
    "yao": [
      "暂时退守，以待好运。",
      "劳碌不已，避开险难。",
      "前进不易，且先退守。",
      "同心协力，可以过关。",
      "转危为安，另图发展。",
      "大运将至，名利皆实"
    ]
  },
  {
    "name": "雷水解",
    "yao": [
      "困难初解，不可妄动。",
      "避邪归正，功名有望。",
      "素行不端，自取其辱。",
      "因人成事，才有机会。",
      "正运亨通，君子有利。",
      "运途顺利，须防小寇。"
    ]
  },
  {
    "name": "山泽损",
    "yao": [
      "加进努力，或仍有望。",
      "中庸处世，自有好运。",
      "双月有利，不可贪多。",
      "小灾之后，转忧为喜。",
      "运势大好，意外之助。",
      "一帆风顺，所图可成。"
    ]
  },
  {
    "name": "风雷益",
    "yao": [
      "大事可为，无不如意。",
      "意外得财，又能守住。",
      "先苦后甘，讲信修睦。",
      "眼前有难，暂避为宜。",
      "存心仁厚，实至名归。",
      "贪求名位，意外之祸。"
    ]
  },
  {
    "name": "泽天夬",
    "yao": [
      "躁进取败，动辄得咎。",
      "凡事谨慎，可以无虑。",
      "任意独行，受人疑忌。",
      "心思不定，所谋难成。",
      "亲近君子，万事皆吉。",
      "声名大损，警惕免祸。"
    ]
  },
  {
    "name": "天风姤",
    "yao": [
      "守成尚可，不宜妄动。",
      "远避小人，自然有利。",
      "因疑生危，稍安毋躁。",
      "未得正运，开拓心胸。",
      "心胸开阔，功名自显。",
      "功名大显，运已近穷。"
    ]
  },
  {
    "name": "泽地萃",
    "yao": [
      "一顺一逆，得人援手。",
      "中正之运，得人援引。",
      "运途平凡，须防小人。",
      "虽然大顺，德不称位。",
      "有位有权，更应修德。",
      "年老运退，待人援手。"
    ]
  },
  {
    "name": "地风升",
    "yao": [
      "名利双收，所求皆遂。",
      "正当好运，喜事临门。",
      "越来越好，不必担心。",
      "升迁在即，感谢神明。",
      "大愿可成，功名皆吉。",
      "好运已过，预备退路。"
    ]
  },
  {
    "name": "泽水困",
    "yao": [
      "渐入逆境，三年才转。",
      "有名有利，反为利用。",
      "进退不得，身将不保。",
      "地位不当，受人所鄙。",
      "过刚必折，小心免祸。",
      "厄运将终，收心努力。"
    ]
  },
  {
    "name": "水风井",
    "yao": [
      "时过运衰，年老无用。",
      "得小失大，徒有虚名。",
      "有才无命，须待两年。",
      "修身立名，可望上达。",
      "品行中正，可望进用。",
      "功德在世，大受推崇。"
    ]
  },
  {
    "name": "泽火革",
    "yao": [
      "最好固守，再等几年。",
      "配合吉日，建立功名。",
      "再三考虑，可免后患。",
      "转换跑道，好运自来。",
      "大运来到，得意非凡。",
      "守成为宜，功成身退。"
    ]
  },
  {
    "name": "火风鼎",
    "yao": [
      "因祸得福，荣封之喜。",
      "功名正盛，小心中伤。",
      "妄意改变，难免有悔。",
      "小损大刑，千万小心。",
      "守住大贵，自然吉祥。",
      "和善待人，无往不利。"
    ]
  },
  {
    "name": "震为雷",
    "yao": [
      "好运新来，先苦后乐。",
      "患得患失，不必过虑。",
      "加倍谨慎，可以免咎。",
      "欲振乏力，退而自保。",
      "患难已过，可成大事。",
      "位高必危，静守为宜。"
    ]
  },
  {
    "name": "艮为山",
    "yao": [
      "初交好运，退守无咎。",
      "运途受阻，缺少援手。",
      "顺时可成，不可勉强。",
      "无得无失，保身无咎。",
      "言谈中正，自然可取。",
      "好上加好，自然吉祥。"
    ]
  },
  {
    "name": "风山渐",
    "yao": [
      "初行好运，要有耐心。",
      "嘉宾安乐，名利皆有。",
      "运势不正，须防有祸。",
      "随遇而安，可以免咎。",
      "运势中正，三年必成。",
      "大运来到，可以用世。"
    ]
  },
  {
    "name": "雷泽归妹",
    "yao": [
      "因人成事，乏善可陈。",
      "不必幻想，安心修养。",
      "受人抑制，忍耐一时。",
      "行运有时，不宜躁进。",
      "谦虚得福，连袂上进。",
      "诸事不顺，小心为宜。"
    ]
  },
  {
    "name": "雷火丰",
    "yao": [
      "贵人相助，十年好运。",
      "坚守正道，逢凶化吉。",
      "气运颠倒，须防灾难。",
      "际遇不佳，由暗向明。",
      "实至名归，自然吉祥。",
      "有命无人，不堪设想。"
    ]
  },
  {
    "name": "火山旅",
    "yao": [
      "所得有限，修行为宜。",
      "运势中正，名利皆得。",
      "运势颠倒，危难不少。",
      "一时有困，来年再说。",
      "晚运甚佳，值得恭喜。",
      "有失无得，乐极生悲。"
    ]
  },
  {
    "name": "巽为风",
    "yao": [
      "谋事不成，考虑从军。",
      "神明保佑，运途顺利。",
      "位卑志低，受人轻视。",
      "走上正运，出而有功。",
      "中正之位，无往不利。",
      "越高越危，有失无得。"
    ]
  },
  {
    "name": "兑为泽",
    "yao": [
      "以和为贵，诸事皆吉。",
      "上下同心，自然吉祥。",
      "奔走营求，虽成亦辱。",
      "奋斗将成，斟酌行止。",
      "居安思危，常得其昌。",
      "靠人扶持，平平之运。"
    ]
  },
  {
    "name": "风水涣",
    "yao": [
      "险中得救，必有后福。",
      "运势顺利，心想事成。",
      "勇于赴难，值得尊敬。",
      "大运亨通，脱困成业。",
      "中正之位，诸事皆吉。",
      "运势通达，无须忧心。"
    ]
  },
  {
    "name": "水泽节",
    "yao": [
      "闭门修行，平安是福。",
      "因循自误，坐失良机。",
      "得而后失，叹息无奈。",
      "平安是福，听命行事。",
      "苦尽甘来，功名必显。",
      "不知变通，贫困一生。"
    ]
  },
  {
    "name": "风泽中孚",
    "yao": [
      "用心专一，有志竟成。",
      "此唱彼和，正合我意。",
      "运势颠倒，荣辱随之。",
      "持盈保泰，先公后私。",
      "运势中正，有求必应。",
      "虚而不实，令人担心。"
    ]
  },
  {
    "name": "雷山小过",
    "yao": [
      "不安本分，结果堪虞。",
      "平顺之运，得半已足。",
      "切勿躁进，自保免祸。",
      "观察情势，不可妄动。",
      "平淡之时，难成大事。",
      "不知退守，自取其祸。"
    ]
  },
  {
    "name": "水火既济",
    "yao": [
      "奋勉有加，可以无咎。",
      "不计小利，得成大功。",
      "努力工作，所谋必成。",
      "处顺思困，谨慎为宜。",
      "持盈保泰，吉凶自取。",
      "好运已过，小心危险。"
    ]
  },
  {
    "name": "火水未济",
    "yao": [
      "鲁莽行事，无路可走。",
      "上下相得，无往不利。",
      "见机而作，妄动则凶。",
      "志得意满，名利双全。",
      "运势正旺，诸事皆吉。",
      "能知节俭，可保无虞。"
    ]
  }
];

var yaoExplainFPRcaiyunData = [
  {
    "name": "乾为天",
    "yao": [
      "宜守不宜攻。",
      "开始涨价，官方采购。",
      "日夜防范，可脱险获利。",
      "物价高涨，可保无咎。",
      "五谷之类的贸易，物价飞升，有官府支持。",
      "过盈则必有亏。"
    ]
  },
  {
    "name": "坤为地",
    "yao": [
      "渐积可致富。",
      "获利可期。",
      "把握时机，必有利益。",
      "落袋为安，不再投资。",
      "必定获利。",
      "血本无归。"
    ]
  },
  {
    "name": "水雷屯",
    "yao": [
      "不利经商，可任用正人君子。",
      "售出有困难，颇耗时日。",
      "恐有损失，不如舍去。",
      "明见利益，应有收获。",
      "小买卖尚可获利，大买卖则凶。",
      "犹豫不决，尽失良机。"
    ]
  },
  {
    "name": "山水蒙",
    "yao": [
      "避免兴讼，得理即止。",
      "广纳财物，售至外地。",
      "小则破财，大则伤身。",
      "缺乏资本，难免穷困。",
      "无法独立，须靠人经营。",
      "顺取为宜，买卖相洽。"
    ]
  },
  {
    "name": "水天需",
    "yao": [
      "暂勿投资，货物无损。",
      "货运不通，无害商业。",
      "无法流通，小心受骗。",
      "投资矿业，有利可图。",
      "投资饮食业，可获利。",
      "得价则售，不可贮藏。"
    ]
  },
  {
    "name": "天水讼",
    "yao": [
      "及时售出，口舌无碍。",
      "小有耗损，不必多虑。",
      "固守家产，终可得利。",
      "合作不成，反是好事。",
      "公平经营，取得正财。",
      "不是正财，得不偿失。"
    ]
  },
  {
    "name": "地水师",
    "yao": [
      "海运业务，合义则吉。",
      "谋略出众，领导获利。",
      "物耗财损，凶险无比。",
      "次级货物，尚可获利。",
      "老成练达，有利可图。",
      "因富致贵，须防小人。"
    ]
  },
  {
    "name": "水地比",
    "yao": [
      "信用卓著，利益自来。",
      "同心协力，获利可期。",
      "所托非人，损耗难免。",
      "货物流通，利润自来。",
      "不贪小利，后有盈余。",
      "白费心机，一无所获。"
    ]
  },
  {
    "name": "风天小畜",
    "yao": [
      "守稳旧业，不宜创新。",
      "创业守成，两皆为宜。",
      "逆向操作，可以获利。",
      "利西北，不利东南；邻里相助。",
      "百货聚积，自有大利。",
      "得利则止，切忌过贪。"
    ]
  },
  {
    "name": "天泽履",
    "yao": [
      "守好旧业，久必获利。",
      "物价稳定，稍有小利。",
      "被人欺弄，货物滞销。",
      "不急求售，终获利益。",
      "和衷共济，惜售有利。",
      "往来经营，无不有利。"
    ]
  },
  {
    "name": "地天泰",
    "yao": [
      "合伙有成，货财会聚。",
      "行商有利，国际贸易。",
      "眼前失意，后有大利。",
      "外强中干，同业相助。",
      "国际贸易，甚为有利。",
      "小试手气，等待时机。"
    ]
  },
  {
    "name": "天地否",
    "yao": [
      "新设商业，用人谨慎。",
      "买卖皆利，讼则上诉",
      "用人不当，暗中损耗。",
      "打定主意，转亏为盈。",
      "机会尚佳，慎选伙伴。",
      "秋冬有利，春夏不利。"
    ]
  },
  {
    "name": "天火同人",
    "yao": [
      "不宜开店，可以行商。",
      "大宗买卖，留心出纳。",
      "可开山林，三年获利。",
      "守货不售，将可获利。",
      "小有挫折，终有大利。",
      "郊外立业，暂时无利。"
    ]
  },
  {
    "name": "火天大有",
    "yao": [
      "基业初创，慎始无害。",
      "国内国际，无不获利。",
      "名利并至，勿近小人。",
      "利益已足，勿再贪求。",
      "人和为贵，富有不难。",
      "百货畅达，自然获利。"
    ]
  },
  {
    "name": "地山谦",
    "yao": [
      "投资航业，有利可图。",
      "得人呼应，利益自来。",
      "基业已成，永保利益。",
      "利益甚多，留些余地。",
      "防人分取，更生事端。",
      "有名无实，认真整顿。"
    ]
  },
  {
    "name": "雷地豫",
    "yao": [
      "初可得利，切忌过贪。",
      "自定其志，快速获利。",
      "稍纵即逝，快速得利。",
      "众货聚集，大有利市。",
      "用人不当，致生损失。",
      "改旧从新，将可获利。"
    ]
  },
  {
    "name": "泽雷随",
    "yao": [
      "货物外售，可以得利。",
      "贪小失大，显然不利。",
      "小往大来，利益可期。",
      "虽有获利，小心意外。",
      "货物上品，得利不少。",
      "稳扎稳打，未能伸展。"
    ]
  },
  {
    "name": "山风蛊",
    "yao": [
      "重整旧业，可以得利。",
      "旧债积弊，缓和处理。。",
      "重立旧业，小损大利。",
      "未能除弊，难以获利。",
      "改善旧业，仍然有利。",
      "不必急售，获利可期。"
    ]
  },
  {
    "name": "地泽临",
    "yao": [
      "新货推出，自然获利。",
      "一再经营，依然获利。",
      "糖业有利，其余未必。",
      "买卖得时，无往不利。",
      "了解商情，当然有利。",
      "贩卖内地，尚有利益。"
    ]
  },
  {
    "name": "风地观",
    "yao": [
      "除登场面，小作即可。",
      "蚕丝有利，余皆不宜。",
      "随买随卖，不致有失。",
      "国际贸易，有利有名。",
      "我来决定，必可得利。",
      "买到货存，有利可图。"
    ]
  },
  {
    "name": "火雷噬嗑",
    "yao": [
      "谨慎交易，避开木业。",
      "暂时保存，待价出手。",
      "处置不当，反受损失。",
      "小本大利，自然可喜。",
      "上品货物，自然得利。",
      "得利即止，可无大损。"
    ]
  },
  {
    "name": "山火贲",
    "yao": [
      "脚踏实地，虽小亦亨。",
      "配合富商，必可获利。",
      "财源如水，可保基业。",
      "早些售出，获利了结。",
      "木材丝绸，皆可获利。",
      "直接出售，依然有利。"
    ]
  },
  {
    "name": "山地剥",
    "yao": [
      "底部有损，减少损失。",
      "成本堆积，难以获利。",
      "自行脱售，因而得利。",
      "剥耗过多，意外之祸。",
      "利润甚丰，海产犹佳。",
      "卖出尚可，买入必剥。"
    ]
  },
  {
    "name": "地雷复",
    "yao": [
      "赚回所损，不必懊恼。",
      "与人共利，事业兴旺。",
      "有盈有亏，全在自己。",
      "谋划虽精，资本不足。",
      "资本充足，来回获利。",
      "诸事不顺，难以复业。"
    ]
  },
  {
    "name": "天雷无妄",
    "yao": [
      "行商有利，坐贾不宜。",
      "不谋而获，大利到手。",
      "防备别人，以免耗财。",
      "坚守旧业，可以获利。",
      "不忧物价，心平气和。",
      "暂时静守，勿再投资。"
    ]
  },
  {
    "name": "山天大畜",
    "yao": [
      "等待帮手，方可获利。",
      "早些脱手，减少损失。",
      "买卖合宜，有利可图。",
      "新货到手，蓄积有利。",
      "得人支持，买卖有利。",
      "毫无阻碍，大获其利。"
    ]
  },
  {
    "name": "山雷颐",
    "yao": [
      "经营不顺，别人获利。",
      "不合常理，难免耗损。",
      "久难成事，无利可图。",
      "看清市场，买卖获利。",
      "行商不利，可以做贾。",
      "辛苦经营，才有收获。"
    ]
  },
  {
    "name": "泽风大过",
    "yao": [
      "柔白之货，可以获利。",
      "林木生意，应可获利。",
      "只靠自己，人财两失。",
      "木材生意，可以得利。",
      "小心多情，名利皆失。",
      "出货谨慎，以免失利。"
    ]
  },
  {
    "name": "坎为水",
    "yao": [
      "贩卖失利，有去无回。",
      "小心经营，可有小利。",
      "航行受阻，暂时守成。",
      "造酒之业，颇为顺利。",
      "不谈近利，考虑长远。",
      "纺织生意，三年有成。"
    ]
  },
  {
    "name": "离为火",
    "yao": [
      "暂无大利，但可无咎。",
      "利在土木，中规中矩。",
      "留连夜市，必伤正业。",
      "人财两亡，小心避开。",
      "辛苦经营，公家生意。",
      "上等货品，才可获利。"
    ]
  },
  {
    "name": "泽山咸",
    "yao": [
      "货物已办，尚未发行。",
      "不宜行商，可以坐贾。",
      "合资困难，主事不力。",
      "见利忘义，争夺不休。",
      "已有感应，不必担心。",
      "口舌之祸，不可不慎。"
    ]
  },
  {
    "name": "雷风恒",
    "yao": [
      "得利即售，勿贪高价。",
      "苦撑待变，将可回本。",
      "没有恒业，难以获利。",
      "地方不对，如何有利。",
      "只见小利，如何致富。",
      "不愿结算，无利可言。"
    ]
  },
  {
    "name": "天山遁",
    "yao": [
      "全部出手，可以免灾。",
      "守住本金，脱售不及。",
      "当售即售，久留必损。",
      "出货得利，不必迟疑。",
      "应变得宜，仍可获利。",
      "人弃我取，退可得利。"
    ]
  },
  {
    "name": "雷天大壮",
    "yao": [
      "不能慎思，必遭损失。",
      "货价合宜，自然获利。",
      "不必垄断，否则大耗。",
      "满载而归，何乐不为。",
      "恐有小失，尚无大碍。",
      "原想发财，难以保本。"
    ]
  },
  {
    "name": "火地晋",
    "yao": [
      "稍待时日，可获大利。",
      "守住低潮，自然受福。",
      "双方和睦，买卖皆利。",
      "贪财必败，见好就收。",
      "前有小失，今可大得。",
      "同业纷争，幸可无咎。"
    ]
  },
  {
    "name": "地火明夷",
    "yao": [
      "资本有损，主人烦言。",
      "策划不当，难免损失。",
      "耐心经营，终见光明。",
      "外出经商，称心致富。",
      "历经艰难，方可获利。",
      "货价宜平，才有信用。"
    ]
  },
  {
    "name": "风火家人",
    "yao": [
      "初做生意，严守商规。",
      "贩运粮食，可以获利。",
      "内外皆齐，尚可自保。",
      "利市三倍，其富可知。",
      "奉公营商，利润可保。",
      "商道之正，有利有名。"
    ]
  },
  {
    "name": "火泽睽",
    "yao": [
      "不必多虑，后必大亨。",
      "遭到财主，共同经营。",
      "人和不易，无利可图。",
      "进退两难，旧友帮忙。",
      "须防合伙，自己端正。",
      "秋雨之后，方可获利。"
    ]
  },
  {
    "name": "水山蹇",
    "yao": [
      "不可冒险，守本为宜。",
      "中途受阻，人财两失。",
      "货物不畅，转销内地。",
      "客人皆来，当然有利。",
      "货物太多，不易脱手。",
      "货价高涨，保本获利"
    ]
  },
  {
    "name": "雷水解",
    "yao": [
      "没有损失，即是幸事。",
      "努力经营，可得厚利。",
      "小心防盗，以免损失。",
      "获利不多，朋友交心。",
      "自然作去，就有利润。",
      "谨慎防范，有利无损。"
    ]
  },
  {
    "name": "山泽损",
    "yao": [
      "判断准确，自有利益。",
      "货物合宜，应可获利。",
      "一人独资，不会损失。",
      "减少货物，信之有利。",
      "利润自来，不必推辞。",
      "物价平平，获利不少。"
    ]
  },
  {
    "name": "风雷益",
    "yao": [
      "有人有谋，大利在前。",
      "如有神助，必得厚利。",
      "欲求富贵，必须冒险。",
      "改迁他处，另开店面。",
      "兼顾道义，利益长久。",
      "专求己利，必生争端。"
    ]
  },
  {
    "name": "泽天夬",
    "yao": [
      "任意经营，伤财害己。",
      "货物保险，才可无忧。",
      "独自经营，较费时日。",
      "错过时机，无利可图。",
      "尽速出手，不然有悔。",
      "再立新约，否则无利。"
    ]
  },
  {
    "name": "天风姤",
    "yao": [
      "适宜开店，不利行商。",
      "货物充足，利在手中。",
      "犹豫不决，怎能获利。",
      "袋中无粮，无利可图。",
      "木类产品，应有大利。",
      "仔细计较，获利甚丰。"
    ]
  },
  {
    "name": "泽地萃",
    "yao": [
      "聚散不定，可以免咎。",
      "合作有利，虔心酬神。",
      "转运他处，可以无咎。",
      "大利当前，收敛为善。",
      "虽有利润，须守其正。",
      "无利可图，幸有救援。"
    ]
  },
  {
    "name": "地风升",
    "yao": [
      "货价涨升，大可获利。",
      "诚信经营，可保获利。",
      "货物集散，财力可期。",
      "货物充裕，财神相助。",
      "经营得中，利益不断。",
      "经营困难，人财两失。"
    ]
  },
  {
    "name": "泽水困",
    "yao": [
      "材木生意，运送不易。",
      "由商起家，往前则凶。",
      "财去命弱，下场堪虑。",
      "货物失去，急救可保。",
      "货物清理，慢慢售出。",
      "久货可出，方可获利。"
    ]
  },
  {
    "name": "水风井",
    "yao": [
      "货物陈旧，难以售出。",
      "贪材失利，得不偿失。",
      "贩运不当，无利可图。",
      "整理旧业，应有利闰。",
      "财源长远，可以获利。",
      "利益汇集，可大可久。"
    ]
  },
  {
    "name": "泽火革",
    "yao": [
      "先立基础，勿图更张。",
      "择吉开张，生意畅旺。",
      "信用良好，才可获利。",
      "重兴旧业，可以得利。",
      "订好价钱，自可获利。",
      "名利兼收，知足常乐。"
    ]
  },
  {
    "name": "火风鼎",
    "yao": [
      "小损大利，以商为家。",
      "袋中有财，须防盗窃。",
      "目前滞销，须待三年。",
      "有去无回，小心性命。",
      "信息通达，可获大利。",
      "美玉待沽，自然有利。"
    ]
  },
  {
    "name": "震为雷",
    "yao": [
      "用心经营，得利可乐。",
      "有得有失，危机意识。",
      "销路不佳，另行设法。",
      "挥金如土，难有积蓄。",
      "小损大利，不必多忧。",
      "须防过贪，谨守小成。"
    ]
  },
  {
    "name": "艮为山",
    "yao": [
      "知足常乐，多行善事。",
      "止而不售，难免心忧。",
      "闭关自守，难免穷困。",
      "可以保本，另得良机。",
      "保密为要，商机可成。",
      "上手生意，获利自多。"
    ]
  },
  {
    "name": "风山渐",
    "yao": [
      "有约在先，宜防小人。",
      "日益增加，稳若磐石。",
      "不易得利，防有盗贼。",
      "利润甚微，保本即可。",
      "眼前平平，三年大发。",
      "货美价高，自然获利。"
    ]
  },
  {
    "name": "雷泽归妹",
    "yao": [
      "奉命而行，幸可获利。",
      "独到之见，暗中得利。",
      "眼前无利，可图未来。",
      "待时而动，自可获利。",
      "后货较优，早售有利。",
      "本虚货缺，如何得利。"
    ]
  },
  {
    "name": "雷火丰",
    "yao": [
      "货物正巧，十日有利。",
      "以诚待人，拨云见月。",
      "涨跌难测，颇有损耗。",
      "走出暗昧，找到买主。",
      "经商有成，利名并至。",
      "无人经营，一筹莫展。"
    ]
  },
  {
    "name": "火山旅",
    "yao": [
      "本小利微，小心灾祸。",
      "生财有道，作客无忧。",
      "不必求利，早些防祸。",
      "获利有限，心中不平。",
      "小失大得，有利有名。",
      "小利大损，十分凶险。"
    ]
  },
  {
    "name": "巽为风",
    "yao": [
      "犹豫不决，无利可图。",
      "买卖难决，最好占筮。",
      "过于卑顺，如何争利。",
      "皮革羽毛，皆可致富。",
      "初有小悔，后得大利。",
      "因循失利，损耗不小。"
    ]
  },
  {
    "name": "兑为泽",
    "yao": [
      "秋实可收，自然有利。",
      "以信为本，可长可远。",
      "无信之商，未来堪虑。",
      "忧心之事，商量解决。",
      "虽有小损，信心仍在。",
      "有人指引，稍有小利。"
    ]
  },
  {
    "name": "风水涣",
    "yao": [
      "同事相助，可以得利。",
      "货物贸易，如愿以偿。",
      "重财轻命，自讨苦吃。",
      "散财济危，自成天地。",
      "言行中庸，利润自来。",
      "贸易顺利，财源自来。"
    ]
  },
  {
    "name": "水泽节",
    "yao": [
      "不利行商，可以开店。",
      "错过时机，不赚反赔。",
      "不知守财，咎由自取。",
      "安居外地，一切节俭。",
      "贩米外地，获利必丰。",
      "失去良机，怨叹无用。"
    ]
  },
  {
    "name": "风泽中孚",
    "yao": [
      "安于本业，久之必得。",
      "主客同心，交相获利。",
      "忽成忽败，缺乏主见。",
      "谋事顺利，财源亦丰。",
      "同心协力，经营有成。",
      "外强中干，未来可忧。"
    ]
  },
  {
    "name": "雷山小过",
    "yao": [
      "不自量力，难免失败。",
      "虽未满载，得半亦可。",
      "外出经营，盗贼可怕。",
      "适可而止，切勿过贪。",
      "小利可得，不必多想。",
      "时机不对，无得有失。"
    ]
  },
  {
    "name": "水火既济",
    "yao": [
      "暂时稳住，将可脱困。",
      "失而复得，不必担心。",
      "数年经营，才可获利。",
      "经营漏洞，早些修补。",
      "奢不如俭，实获其利。",
      "首次买卖，必难获利。"
    ]
  },
  {
    "name": "火水未济",
    "yao": [
      "不记教训，谋财无方。",
      "用心经营，满载而归。",
      "把握良机，船运有利。",
      "远方经营，利润可观。",
      "官方业务，获利稳定。",
      "量入为出，永享其富。"
    ]
  }
];

var yaoExplainFPRjiazhaiData = [
  {
    "name": "乾为天",
    "yao": [
      "娶妻小心。",
      "婚姻大吉。",
      "勤俭保家；不宜攀结高亲。",
      "有一时振兴之象。",
      "富贵之家。",
      "婚嫁不利。"
    ]
  },
  {
    "name": "坤为地",
    "yao": [
      "阴盛不吉；婚嫁不利。",
      "居家如意；婚嫁顺利。",
      "凝聚向心力。",
      "平安是福。",
      "和乐融融。",
      "失序不和。"
    ]
  },
  {
    "name": "水雷屯",
    "yao": [
      "安居于贵宅；婚嫁吉祥。",
      "是佳偶，但须等待。",
      "不循正途求婚嫁，将有困难。",
      "婚嫁吉祥。",
      "聚财伤和气。",
      "家道中落。"
    ]
  },
  {
    "name": "山水蒙",
    "yao": [
      "谨慎持家；可能罢婚。",
      "妻贤子孝，可振家业。",
      "妻强夫弱，恐有不安；不宜婚嫁。",
      "地处偏僻，生活困苦。",
      "幼年定亲。",
      "妇道贵顺，家道和平。"
    ]
  },
  {
    "name": "水天需",
    "yao": [
      "可居郊外。",
      "口舌之争。",
      "婚事难成，成则怨偶。",
      "乔迁之喜。",
      "婚嫁得宜。",
      "持家有道；少男乃吉。"
    ]
  },
  {
    "name": "天水讼",
    "yao": [
      "有些争议，分辨明白即可。",
      "不宜婚嫁。",
      "不宜另建新居。",
      "改婚不失其道。",
      "与富贵人结婚。",
      "不易安居。"
    ]
  },
  {
    "name": "地水师",
    "yao": [
      "治家以法，否则必凶。",
      "邻里所重；婚姻吉祥。",
      "不得安宁，小心为上。",
      "近东，朝西南吉；入赘无咎。",
      "利于长子；媒妁而成。",
      "家道兴旺；贵人做媒。"
    ]
  },
  {
    "name": "水地比",
    "yao": [
      "社区和睦；亲事亦谐。",
      "亲上加亲。",
      "戒慎嫁娶，以免遗憾。",
      "一家和睦；外地定亲，吉",
      "和顺为宜。",
      "恐丧家主；婚嫁来历不明。"
    ]
  },
  {
    "name": "风天小畜",
    "yao": [
      "不求于外，家道自亨。",
      "兄弟和睦，家道兴隆。",
      "家庭不和，婚姻不利。",
      "管理得宜，否则受累。",
      "既富且贵，惠及邻里。",
      "前困后亨。"
    ]
  },
  {
    "name": "天泽履",
    "yao": [
      "门庭吉祥。",
      "分析财产，小心损耗。",
      "暗昧不明，以小凌大。",
      "平稳持家。",
      "居安思危，可保平安。",
      "积善之家才有余庆。"
    ]
  },
  {
    "name": "地天泰",
    "yao": [
      "团圆平安。",
      "勿信仆从。",
      "谨守先业。",
      "亲友相助，暂时无虞。",
      "有贤内助；远嫁远娶。",
      "小心守业。"
    ]
  },
  {
    "name": "天地否",
    "yao": [
      "亲戚同住；可以照应。",
      "老人有疾无害。",
      "行为不检，家门有羞。",
      "家运转吉。",
      "祖业深厚。",
      "迁居大吉。"
    ]
  },
  {
    "name": "天火同人",
    "yao": [
      "家人和睦。",
      "长子之力，勤俭起家。",
      "须防盗贼。",
      "修缮房屋围墙。",
      "不必惊惶，终于平安",
      "平顺无灾"
    ]
  },
  {
    "name": "火天大有",
    "yao": [
      "新富可喜，值得珍惜。",
      "可以乔迁。",
      "喜庆宴会，须防仆婢。",
      "荣美可观，满则招损。",
      "一家和睦，须防盗贼。",
      "福庆满门。"
    ]
  },
  {
    "name": "地山谦",
    "yao": [
      "治家以德，平安和睦。",
      "家有恒产，亦有善名。",
      "持盈保泰，安居乐业。",
      "谦和相处，自无不利。",
      "择邻而处，守望相助；近邻议婚。",
      "防范邪祟。"
    ]
  },
  {
    "name": "雷地豫",
    "yao": [
      "怪异之惊，应防凶险。",
      "严正持家，拒斥小人。",
      "速防窃盗。",
      "得福有财。",
      "恐被侵占。",
      "迁居改造为宜。"
    ]
  },
  {
    "name": "泽雷随",
    "yao": [
      "装修迁居。",
      "家主受累；婚嫁不妥。",
      "积蓄有成，关心子女。",
      "置屋不宜。",
      "积善之家；婚嫁可喜。",
      "家人抱怨；嫁娶有缘。"
    ]
  },
  {
    "name": "山风蛊",
    "yao": [
      "改造旧宅；婚嫁可喜。",
      "母系擅权，忍耐协调；可得佳妇。",
      "改造住宅。",
      "父业难保。",
      "努力兴家；嫁娶高亲。",
      "住在高处；良缘天成。"
    ]
  },
  {
    "name": "地泽临",
    "yao": [
      "吉事临门；佳偶可成。",
      "福星高照；婚嫁亦吉。",
      "迁徙为宜；婚姻不合。",
      "家业正旺；婚嫁合宜。",
      "五福临门；宜室宜家。",
      "忠厚肃穆。"
    ]
  },
  {
    "name": "风地观",
    "yao": [
      "小心童仆；自由结亲。",
      "妇女主家。",
      "守住旧债。",
      "喜事临门。",
      "我来建宅。",
      "老宅生息。"
    ]
  },
  {
    "name": "火雷噬嗑",
    "yao": [
      "兴工改造；婚嫁不宜。",
      "老宅不利；婚嫁兴家。",
      "小有不安。",
      "保家有道；婚嫁勤俭。",
      "方位合宜",
      "须防意外。"
    ]
  },
  {
    "name": "山火贲",
    "yao": [
      "勤俭起家，知足不辱。",
      "祖上福泽；婚嫁宜待。",
      "可以久居；百年偕老。",
      "先有丧事，后有婚事。",
      "家风勤俭；贤妇可喜。",
      "清白高尚。"
    ]
  },
  {
    "name": "山地剥",
    "yao": [
      "基础不稳，防备下人。",
      "宜速变迁。",
      "旧宅改造。",
      "破败防塌。",
      "妇女持家。",
      "忠厚可保，刻薄无屋。"
    ]
  },
  {
    "name": "地雷复",
    "yao": [
      "旧业复兴；婚嫁又成。",
      "和睦兴家。",
      "迁移不定。",
      "女多男少；宜从前媒。",
      "光大祖业。",
      "居者不利。"
    ]
  },
  {
    "name": "天雷无妄",
    "yao": [
      "迁居为宜；婿可入赘。",
      "承继家产；招赘之亲。",
      "外人侵占；远人结亲。",
      "保持祖业。",
      "防备倾倒。",
      "慎勿迁移。"
    ]
  },
  {
    "name": "山天大畜",
    "yao": [
      "屋宅忌高；夫顺妻吉。",
      "谨慎守业；贵婿大吉。",
      "勤俭兴家；男女合志。",
      "新居有路；少年联姻。",
      "住屋风水；婚姻合宜。",
      "道旁吉宅；天作之合。"
    ]
  },
  {
    "name": "山雷颐",
    "yao": [
      "六神无主；婚姻不谐。",
      "未得其正；妇道可议。",
      "家宅不安；十年方婚。",
      "尚可称正。",
      "山居较宜；从一为吉。",
      "合家平安。"
    ]
  },
  {
    "name": "泽风大过",
    "yao": [
      "环境荒芜。",
      "枯树开花；老夫少妻，得以生育。",
      "栋折难居；婚姻不利。",
      "门户宏伟。",
      "闺房不正；女大男小。",
      "小心水灾。"
    ]
  },
  {
    "name": "坎为水",
    "yao": [
      "不安之屋；婚姻小心。",
      "防止河岸。",
      "填满坎陷；求婚不成。",
      "节俭持家；婚姻吉祥。",
      "景观可喜；门当户对。",
      "整修家园；良缘须待三年。"
    ]
  },
  {
    "name": "离为火",
    "yao": [
      "大道之旁。",
      "振起家声；可成佳偶。",
      "老人不安；难望偕老。",
      "逆子之罪；婚姻不吉。",
      "婚事主贵；先泣后笑。",
      "旅行在外。"
    ]
  },
  {
    "name": "泽山咸",
    "yao": [
      "迁居外地；结亲之始。",
      "婚事有变；顺守则吉。",
      "随人他迁不宜；所适非佳偶。",
      "谨慎交际；须防不贞。",
      "可保平安。",
      "口角之争；媒人夸张。"
    ]
  },
  {
    "name": "雷风恒",
    "yao": [
      "华丽难久；勿求攀结。",
      "位置不利，须待十年。",
      "不利久居；难以偕老。",
      "方位不利；配偶不和。",
      "女强男弱；女占喜，男占凶。",
      "旧宅不改；再娶必凶。"
    ]
  },
  {
    "name": "天山遁",
    "yao": [
      "早迁为宜；婚姻不合。",
      "迁移有利；退婚不易。",
      "急速迁移；娶妻不利。",
      "隐居为宜；离婚之忧。",
      "高风可尚；志同为婚。",
      "利于求财；私奔之虞。"
    ]
  },
  {
    "name": "雷天大壮",
    "yao": [
      "不可迁移；防女足疾。",
      "地位适中；婚姻吉祥。",
      "过高易震；夫妻反目。",
      "赶快整修；不是佳偶。",
      "不宜畜牧；婚礼不成。",
      "艰难自守；先苦后乐。"
    ]
  },
  {
    "name": "火地晋",
    "yao": [
      "吉屋可居；婚姻缓成。",
      "迁居与老人同住；婚姻稍待。",
      "气氛和谐；两性融洽。",
      "耗失过多；婚姻不正。",
      "屋运转好；婚姻吉祥。",
      "邻里不安；始争终和。"
    ]
  },
  {
    "name": "地火明夷",
    "yao": [
      "最好迁居；婚姻不谐。",
      "修缮完整；妇有足疾。",
      "乡里富家；得其佳偶。",
      "路有阻碍；妇已有孕。",
      "亲族失和；罢婚为宜。",
      "地势太低；先富后贫。"
    ]
  },
  {
    "name": "风火家人",
    "yao": [
      "有规有矩；清白之家。",
      "妇人当家。",
      "家规严肃；两姓相从。",
      "富豪之家。",
      "高门大宅；嫁入豪门。",
      "一乡之望；两姓和睦。"
    ]
  },
  {
    "name": "火泽睽",
    "yao": [
      "平顺无咎；耐心等待。",
      "贵人来访；小心私情。",
      "朝西为宜；先疑后释。",
      "四周荒凉。",
      "旧屋可居；亲上加亲。",
      "防有作祟；婚姻终和。"
    ]
  },
  {
    "name": "水山蹇",
    "yao": [
      "迁居不利；婚姻宜待。",
      "方向不利；夫恐有难。",
      "团聚之喜；重逢有缘。",
      "比邻而居；亲上加亲。",
      "不宜居家。",
      "贵人相助；婚姻主贵"
    ]
  },
  {
    "name": "雷水解",
    "yao": [
      "平安度日。",
      "防范作祟；得到正室。",
      "盗窃难防；富而不仁。",
      "不易安居；有力媒人。",
      "福宅可居；婚姻吉祥。",
      "防备窃盗。"
    ]
  },
  {
    "name": "山泽损",
    "yao": [
      "早些迁移；即日迎娶。",
      "守之则吉；门当户对。",
      "一家二丁；得偶为吉。",
      "阴气过剩，祈祷可安；婚姻可喜。",
      "家业兴隆；天作之合。",
      "不必改造。"
    ]
  },
  {
    "name": "风雷益",
    "yao": [
      "新宅宽大；婚姻大吉。",
      "安居之家；百年好合。",
      "逢凶化吉；苦中成婚。",
      "最好迁移；另找媒人。",
      "善人之居；非亲即友。",
      "不可久居；不易偕老。"
    ]
  },
  {
    "name": "泽天夬",
    "yao": [
      "地势太低；门户不对。",
      "宜防火灾；婚姻吉祥。",
      "早些整修；暂时不成。",
      "四周狭隘；久之可成。",
      "整理干净；婚姻合宜。",
      "寂静不安；媒妁未成。"
    ]
  },
  {
    "name": "天风姤",
    "yao": [
      "维护家声；男外女内。",
      "女子主持；婚姻可成。",
      "修整家宅；迟缓可成。",
      "僻处防灾；可能无后。",
      "中正之居；婚姻有吉。",
      "谨防屋角；老少夫妻。"
    ]
  },
  {
    "name": "泽地萃",
    "yao": [
      "不可久居；始乱终弃。",
      "祖上积德；婚姻可订。",
      "迁居为宜；怨偶之叹。",
      "兴旺平安；门第有差。",
      "聚族而居；可称贵婿。",
      "家室不安；生离死别。"
    ]
  },
  {
    "name": "地风升",
    "yao": [
      "乔迁之喜；两姓好合。",
      "必有喜事；阴阳合德。",
      "先虚后实；空房独守。",
      "祭告宅神。",
      "步步高升；攀结高亲。",
      "难免中落；难以偕老。"
    ]
  },
  {
    "name": "泽水困",
    "yao": [
      "来往人少；男家卑微。",
      "富贵祭拜；婚姻即成。",
      "悼亡之屋。",
      "慢些入住；事缓可成。",
      "鼻足之患；先疑后成。",
      "修整旧宅；厘清瓜葛。"
    ]
  },
  {
    "name": "水风井",
    "yao": [
      "荒芜难居；婚姻不成。",
      "水不可饮；婚姻不佳。",
      "洗井可饮；二年可成。",
      "修整为宜；尚须待时。",
      "谦让有礼；同甘共苦。",
      "积善旺家；两姓好合。"
    ]
  },
  {
    "name": "泽火革",
    "yao": [
      "新造之屋；待婚三年。",
      "择日修宅；可称佳偶。",
      "三迁为宜；三人为媒。",
      "整建有利；重婚有利。",
      "不利迁动；须防不贞。",
      "居之得安；多求必应。"
    ]
  },
  {
    "name": "火风鼎",
    "yao": [
      "修整有吉；妾生贵子。",
      "富家防窃；不宜娶女。",
      "须防突变；可能悔婚。",
      "栋折之患；男女足疾。",
      "富贵之家；联姻贵族。",
      "地位甚高；金玉之盟。"
    ]
  },
  {
    "name": "震为雷",
    "yao": [
      "谨慎为宜；先忧后喜。",
      "注意防盗；夫妻不睦。",
      "小心地震；门户不当。",
      "阳气阻塞；辛苦成家。",
      "祭祷防祟。",
      "邻居有事；近时媒来。"
    ]
  },
  {
    "name": "艮为山",
    "yao": [
      "可以长住；百年好合。",
      "不宜迁居；避开此婚。",
      "往来为宜；不拘门户。",
      "平安无事；婚姻平平。",
      "位得中正；慎防巧言。",
      "世代忠厚；婚姻吉祥。"
    ]
  },
  {
    "name": "风山渐",
    "yao": [
      "尚无大碍；女长男少。",
      "和乐相处；百年偕老。",
      "不利生产，须防离散。",
      "可能寡居。",
      "可以安居；得子稍迟。",
      "辉煌可观；婚姻吉祥。"
    ]
  },
  {
    "name": "雷泽归妹",
    "yao": [
      "偏屋亦吉。",
      "适合隐居；偏房为宜。",
      "不是正宅；不是正娶。",
      "暂勿迁居；须待时日。",
      "喜事临门；二女同归。",
      "须防纷争；婚娶不正。"
    ]
  },
  {
    "name": "雷火丰",
    "yao": [
      "可以安居；婚姻宜速。",
      "明亮为宜；始疑终谐。",
      "只可暂居。",
      "成败在人；巧遇良缘。",
      "名门正户；天作之合。",
      "没落之家；婚姻不详。"
    ]
  },
  {
    "name": "火山旅",
    "yao": [
      "谨慎免灾；小户联姻。",
      "寄居亦福；富室赘婿。",
      "小心防火；难以偕老。",
      "地位不适；不是正室。",
      "可称美善；佳偶天成。",
      "覆巢之险；先喜后悲。"
    ]
  },
  {
    "name": "巽为风",
    "yao": [
      "朝西有利；联姻军人。",
      "虔诚祷告；卜之则吉。",
      "贫穷之家；门户低微。",
      "装潢美观；婚礼华丽。",
      "坐北朝南；相配得宜。",
      "有丧；惧内。"
    ]
  },
  {
    "name": "兑为泽",
    "yao": [
      "和乐融融；室家得宜。",
      "与邻共富；阴阳相合。",
      "去伪存诚；先合后离。",
      "多疾不安；再三媒说而成。",
      "诚信为上。",
      "内忧外患；似非正聘。"
    ]
  },
  {
    "name": "风水涣",
    "yao": [
      "新厦可居。",
      "先散后聚；女长于男。",
      "出外免祸；守节之志。",
      "自有可观。",
      "富贵之家；必得贵婿。",
      "避免冲突；远嫁之象。"
    ]
  },
  {
    "name": "水泽节",
    "yao": [
      "可以安居；夫妇得当。",
      "屋内无人；旷怨难免。",
      "先富后贫；先喜后悲。",
      "平安无事；夫妻平顺。",
      "正直节俭；百年好合。",
      "开明为宜；顽固难处。"
    ]
  },
  {
    "name": "风泽中孚",
    "yao": [
      "不必迁居；从一而终。",
      "家贵子孝；夫唱妇随。",
      "谨防离奇；反复未成。",
      "阴气过盛；可能丧偶。",
      "和乐之家；百年好合。",
      "家业难保；恐难偕老。"
    ]
  },
  {
    "name": "雷山小过",
    "yao": [
      "屋宜低小；门当户对。",
      "不安之象；恐非正配。",
      "谨防凶祸；小心冤家。",
      "安居为宜；勿急媒聘。",
      "小康之家；恐非正娶。",
      "离散之象；小心奸计。"
    ]
  },
  {
    "name": "水火既济",
    "yao": [
      "可以安居；初聘为吉。",
      "七年可还；将可团聚。",
      "三年后居；三年可婚。",
      "修正屋宇；珍惜情谊。",
      "向西吉宅；两邻订亲。",
      "不利长房；元配有灾。"
    ]
  },
  {
    "name": "火水未济",
    "yao": [
      "门户方位不正；团聚不易。",
      "美善之家；必得贤妇。",
      "安居为宜；迎娶为吉。",
      "安居乐业；二年成婚。",
      "大吉之家；婚姻必成。",
      "勤俭持家；相敬如宾。"
    ]
  }
];

var yaoExplainFPRshentiData = [
  {
    "name": "乾为天",
    "yao": [
      "保养为宜。",
      "运动健身。",
      "小心保养。",
      "继续健身。",
      "蒙天所召，不吉。",
      "命在旦夕。"
    ]
  },
  {
    "name": "坤为地",
    "yao": [
      "阴寒之症，久则难治。",
      "不药而愈。",
      "无可挽回，凶。",
      "谨慎保养。",
      "病在肠胃。",
      "肝血失调，危险。"
    ]
  },
  {
    "name": "水雷屯",
    "yao": [
      "健康无虞。",
      "保持运动习惯。",
      "不可纵欲伤身。",
      "遵医生嘱咐。",
      "初病可治，久病则危。",
      "呕血之症，凶。"
    ]
  },
  {
    "name": "山水蒙",
    "yao": [
      "恐有外伤。",
      "柔软体操。",
      "小心饮食。",
      "体质虚弱，阴寒之症。",
      "听人指导锻炼。",
      "保养为宜。"
    ]
  },
  {
    "name": "水天需",
    "yao": [
      "幽居养病，终无大碍。",
      "心胸宽大，自然吉祥。",
      "小心外伤。",
      "调养气血，和顺阴阳。",
      "饮食调理。",
      "病况凶险，不存侥倖。"
    ]
  },
  {
    "name": "天水讼",
    "yao": [
      "初病可愈，久病则凶。",
      "在外染病，回家调养。",
      "按原医师指示为宜。",
      "有凶险，改变生活方式则吉。",
      "吐纳之术保健康。",
      "病势时好时坏，恐凶。"
    ]
  },
  {
    "name": "地水师",
    "yao": [
      "寒多热少，宜早医治。",
      "流动血气，病即舒解。",
      "可能归天。",
      "春生气来，疾病可愈。",
      "跑步健身。",
      "正常运动。"
    ]
  },
  {
    "name": "水地比",
    "yao": [
      "平安无事。",
      "心平气和，疾病可愈。",
      "改求良医。",
      "多做户外运动",
      "服药生效，不必过虑。",
      "小心头部疾病。"
    ]
  },
  {
    "name": "风天小畜",
    "yao": [
      "安静休养，可以复原。",
      "旧疾复发，小心调养。",
      "阴阳不察，慎择良医。",
      "宽解治之，燥烈之药不宜。",
      "手足麻痹之症。",
      "须防营养过多。"
    ]
  },
  {
    "name": "天泽履",
    "yao": [
      "慢跑有益。",
      "保养眼睛。",
      "保养眼睛与脚部。",
      "谨慎走路。",
      "由危转安。",
      "天年有限。"
    ]
  },
  {
    "name": "地天泰",
    "yao": [
      "相约运动。",
      "疾病难治。",
      "小孩没事，老人不吉。",
      "不必担心。",
      "必得神佑。",
      "小心守业。"
    ]
  },
  {
    "name": "天地否",
    "yao": [
      "传染之症，但无大碍。",
      "修身养性。",
      "寒中带热，远求良医。",
      "体质尚强。",
      "小心保养。",
      "即可病愈，须防复发。"
    ]
  },
  {
    "name": "天火同人",
    "yao": [
      "避地调养，可以无碍。",
      "魂归宗庙，未可多言。",
      "不良于行。",
      "虽有凶险，终究无害。",
      "先危后安。",
      "恐无生机。"
    ]
  },
  {
    "name": "火天大有",
    "yao": [
      "健康无虞，讼事宜解。",
      "出外就医，讼事得胜。",
      "饮食小心，不可争讼。",
      "膨胀之症。",
      "保持门面。",
      "得神庇佑，或即归天。"
    ]
  },
  {
    "name": "地山谦",
    "yao": [
      "游泳健身。",
      "用心过劳之症。",
      "劳累过度，可能归天。",
      "多多散心，自可痊愈。",
      "消热去火。",
      "调养心志。"
    ]
  },
  {
    "name": "雷地豫",
    "yao": [
      "颇为不利。",
      "新病可愈，宿疾即忘。",
      "立即就医。",
      "不必担心。",
      "带病延年。",
      "应有转机。"
    ]
  },
  {
    "name": "泽雷随",
    "yao": [
      "改变用药，远方求医。",
      "顾此失彼。",
      "大人无妨，小孩不利。",
      "先凶后吉。",
      "无须担心。",
      "诚心祷告；可能归魂。"
    ]
  },
  {
    "name": "山风蛊",
    "yao": [
      "初无大碍，无子不利。",
      "大人寒症，小孩补气。",
      "应可痊愈。",
      "急救内患，以免不治。",
      "应觅名医。",
      "大限将至，安其天年。"
    ]
  },
  {
    "name": "地泽临",
    "yao": [
      "初起之病，可保治愈。",
      "并无大碍；讼事未决。",
      "药不对症，可服苦辛。",
      "危险之志，但仍可愈。",
      "良医诊治，自然可愈。",
      "培养元气，自然健康。"
    ]
  },
  {
    "name": "风地观",
    "yao": [
      "小孩没事，大人不利。",
      "阴寒之症，可愈。",
      "安心静养，可保平安。",
      "多加小心。",
      "平安无碍。",
      "来日无多。"
    ]
  },
  {
    "name": "火雷噬嗑",
    "yao": [
      "足病初发，宜早医治。",
      "肌肤有病，小心深入。",
      "药不对症，幸无大碍。",
      "难治之症，宜多调养。",
      "忌食肉类，小心调养。",
      "眼耳之疾；保养头部。"
    ]
  },
  {
    "name": "山火贲",
    "yao": [
      "初起之病，自可痊愈。",
      "遵照医嘱。",
      "游泳健身。",
      "胸中气阻，调节上下。",
      "园林修养。",
      "清谈解热，可能归天。"
    ]
  },
  {
    "name": "山地剥",
    "yao": [
      "足部忧伤，小心诊治。",
      "卧床待医，防其不起。",
      "消除火气。",
      "颇为凶险。",
      "内亏之症，爱惜身体。",
      "饮食不进，小心调养。"
    ]
  },
  {
    "name": "地雷复",
    "yao": [
      "静养可复。",
      "再请旧医。",
      "身体屡治屡发，虽危无害。",
      "宜从初治之医。",
      "精气皆老，不必过虑。",
      "难以保全。"
    ]
  },
  {
    "name": "天雷无妄",
    "yao": [
      "出外就医。",
      "自然痊愈。",
      "外人传染，小心防治。",
      "安静调养，下月可愈。",
      "不必担心。",
      "年老颐养。"
    ]
  },
  {
    "name": "山天大畜",
    "yao": [
      "有病无虞。",
      "腹痛难愈，但无大碍。",
      "谨慎调养，可保无碍。",
      "防小儿病。",
      "调养节制。",
      "健康平安。"
    ]
  },
  {
    "name": "山雷颐",
    "yao": [
      "饮食致病。",
      "头昏眼花，小心调养。",
      "痼疾难治。",
      "少欲则安。",
      "安居静养，劳累难治。",
      "虽危无碍。"
    ]
  },
  {
    "name": "泽风大过",
    "yao": [
      "病体柔弱，温燥之药。",
      "虽危得安。",
      "恐有不测。",
      "胸胀无碍。",
      "不好不坏。",
      "颜面浮肿，可能难治。"
    ]
  },
  {
    "name": "坎为水",
    "yao": [
      "求医失当，情况危急。",
      "医治有效，但难全好。",
      "不宜过劳。",
      "最好祷告。",
      "平心静气。",
      "不易动弹，安心静养。"
    ]
  },
  {
    "name": "离为火",
    "yao": [
      "走路小心。",
      "郁热之症。",
      "早睡早起。",
      "命在危局。",
      "又哭又叹，但仍无妨。",
      "可能归天。"
    ]
  },
  {
    "name": "泽山咸",
    "yao": [
      "足疾医治。",
      "无法步行。",
      "勿陷情欲。",
      "心神恍惚，最好静养。",
      "有病将愈，且可增寿。",
      "胡言乱语，祷之求安。"
    ]
  },
  {
    "name": "雷风恒",
    "yao": [
      "运动伤害，操之过急。",
      "尚称平顺。",
      "运动无恒，如何健康。",
      "服药谨慎。",
      "男女异命。",
      "小心保养。"
    ]
  },
  {
    "name": "天山遁",
    "yao": [
      "走路小心。",
      "运动有恒。",
      "纵欲伤身。",
      "大人可治，小孩危险。",
      "避开阴邪。",
      "过胖虚脱。"
    ]
  },
  {
    "name": "雷天大壮",
    "yao": [
      "慎择良医。",
      "滋补得宜。",
      "血气过刚，防有不测。",
      "恐有不测。",
      "不吉之象。",
      "进退两难。"
    ]
  },
  {
    "name": "火地晋",
    "yao": [
      "宽心解怀。",
      "多听老人言。",
      "团体运动；讼事调解。",
      "疥疮或呕血，皆危。",
      "已无大碍。",
      "保养头部；罢讼为吉。"
    ]
  },
  {
    "name": "地火明夷",
    "yao": [
      "食道有疾，或病在手。",
      "左足受伤。",
      "南方修养较宜。",
      "心腹之症，出门求医。",
      "精神症状。",
      "上火下泄，殊为难治。"
    ]
  },
  {
    "name": "风火家人",
    "yao": [
      "有病就治，一拖难医。",
      "胃口尚好，可以无碍。",
      "凉剂解厄。",
      "过于肥胖，减之即愈。",
      "肝火过旺，调养心气。",
      "运动健身。"
    ]
  },
  {
    "name": "火泽睽",
    "yao": [
      "没有大碍。",
      "得遇良医。",
      "面上有疮，久后自愈。",
      "目疾求医。",
      "皮肤毛病，不难治好。",
      "因疑成病，解疑无碍。"
    ]
  },
  {
    "name": "水山蹇",
    "yao": [
      "有病初起，退而自养。",
      "过劳之厄。",
      "多加保养。",
      "久病缠身，一时难愈。",
      "众医会诊，才可治好。",
      "良医出手。"
    ]
  },
  {
    "name": "雷水解",
    "yao": [
      "一切无恙。",
      "防有邪念邪病。",
      "乱服成药，自找麻烦。",
      "慢跑健身。",
      "恢复正气。",
      "户外运动。"
    ]
  },
  {
    "name": "山泽损",
    "yao": [
      "立即运动。",
      "平常状态。",
      "寡欲修身。",
      "立即就医，否则堪虑。",
      "病愈得财。",
      "出外求医。"
    ]
  },
  {
    "name": "风雷益",
    "yao": [
      "健康无虞。",
      "祈祷可愈。",
      "有惊无险。",
      "外地就医。",
      "保养得宜。",
      "无恒之凶。"
    ]
  },
  {
    "name": "泽天夬",
    "yao": [
      "小心足疾。",
      "阴虚火盛，调养可治。",
      "湿气上升，治之可愈。",
      "皮肤有病，须防失聪。",
      "调节气旺。",
      "无声可呼，已至险境。"
    ]
  },
  {
    "name": "天风姤",
    "yao": [
      "虚弱静养。",
      "池鱼之殃。",
      "坐立不安，求医诊治。",
      "虚火难治，极为凶险。",
      "热中带寒，速求良医。",
      "头部有疾，就医可治。"
    ]
  },
  {
    "name": "泽地萃",
    "yao": [
      "心神混乱，求医可治。",
      "勤练气功。",
      "胸部不适，注意排泄。",
      "外强中干。",
      "心神不宁，最好静养。",
      "悲恸致病，放宽心思。"
    ]
  },
  {
    "name": "地风升",
    "yao": [
      "有病即治，不可拖延。",
      "最好祈神。",
      "虚弱之症。",
      "虔诚祷告。",
      "病情升高。",
      "可能归天。"
    ]
  },
  {
    "name": "泽水困",
    "yao": [
      "大凶之兆。",
      "饮食无度，收心祷告。",
      "无可救药。",
      "长期劳累，恐得归天。",
      "头脚之病，调养祷告。",
      "心神不安，迁地静养。"
    ]
  },
  {
    "name": "水风井",
    "yao": [
      "旧症不治。",
      "下漏之症，求医难治。",
      "心神不安，井泉可愈。",
      "运动健身。",
      "外寒内热，寒剂可解。",
      "即日可愈。"
    ]
  },
  {
    "name": "泽火革",
    "yao": [
      "中腹胀硬，消积健脾。",
      "即将痊愈。",
      "三日可愈。",
      "改求良医。",
      "肝火浮动，不药可愈。",
      "静养修心。"
    ]
  },
  {
    "name": "火风鼎",
    "yao": [
      "使腹下泻，即可痊愈。",
      "实热之症。",
      "小心失聪。",
      "足上生疮，难保完整。",
      "保护胸耳。",
      "耳痛之症。"
    ]
  },
  {
    "name": "震为雷",
    "yao": [
      "先危后安。",
      "病势可忧，七日可愈。",
      "由危而安。",
      "腹部积滞，宜泄除之。",
      "修身养性。",
      "安心养目。"
    ]
  },
  {
    "name": "艮为山",
    "yao": [
      "足疾就医。",
      "药石难治。",
      "血脉不通。",
      "带病延年。",
      "口能发声，病即可治。",
      "体质厚实。"
    ]
  },
  {
    "name": "风山渐",
    "yao": [
      "大人没事，小孩就医。",
      "饮食过度之症。",
      "生产时恐难两全。",
      "肝火过盛。",
      "三年可愈。",
      "健康活泼。"
    ]
  },
  {
    "name": "雷泽归妹",
    "yao": [
      "不良于行。",
      "保养眼睛。",
      "待时可愈。",
      "安心静养。",
      "半月可愈。",
      "虚劳失血，不治之象。"
    ]
  },
  {
    "name": "雷火丰",
    "yao": [
      "良医十日可愈，久则不治。",
      "狭心之症，需要开导。",
      "右臂受伤。",
      "眼疾待良医。",
      "名医治之。",
      "大限将至。"
    ]
  },
  {
    "name": "火山旅",
    "yao": [
      "病初即治。",
      "旅途有恙，受人照料。",
      "孩子或童仆难保。",
      "忧郁不欢",
      "殉难受奖。",
      "属牛者凶。"
    ]
  },
  {
    "name": "巽为风",
    "yao": [
      "积极强身。",
      "祭拜免咎。",
      "太过疲弱。",
      "可以痊愈。",
      "三日可愈。",
      "或许告终。"
    ]
  },
  {
    "name": "兑为泽",
    "yao": [
      "宽心无忧。",
      "疑病得解。",
      "小心外祸。",
      "心神不安，喜事舒怀。",
      "皮肤有疾，速治可愈。",
      "化解内邪，才可保全。"
    ]
  },
  {
    "name": "风水涣",
    "yao": [
      "急治为宜。",
      "愁眉不展，良医可治。",
      "转危为安。",
      "凝聚元气，病体自愈。",
      "大汗可愈。",
      "气血郁积，疏通即治。"
    ]
  },
  {
    "name": "水泽节",
    "yao": [
      "安居静养。",
      "行走艰难。",
      "饮食不节致病。",
      "病由口入。",
      "节食可治。",
      "病势垂危。"
    ]
  },
  {
    "name": "风泽中孚",
    "yao": [
      "谨防病变，变则危险。",
      "传染之疾。",
      "时好时坏，求神保佑。",
      "可渐复元。",
      "手足不便，带病延年。",
      "病状甚苦。"
    ]
  },
  {
    "name": "雷山小过",
    "yao": [
      "神魂难保。",
      "药力未至，继续诊治。",
      "刀伤凶险。",
      "静养心神。",
      "针灸可治。",
      "凶险之病，速求良医。"
    ]
  },
  {
    "name": "水火既济",
    "yao": [
      "初病可治。",
      "七日可愈。",
      "一时无恙，只保三年。",
      "年老体弱。",
      "最好祷告。",
      "头部有疾，危险可知。"
    ]
  },
  {
    "name": "火水未济",
    "yao": [
      "病在下身。",
      "胸腹阻滞。",
      "预防祸祟，渡川以解。",
      "可保三年。",
      "神清气爽。",
      "饮食失节，不可不慎。"
    ]
  }
];

