



module.exports = [
  // 第1卦 乾为天
  {
    name: '乾为天',
    yao: [
      '娶妻小心。',  // 初爻
      '婚姻大吉。',  // 二爻
      '勤俭保家；不宜攀结高亲。',  // 三爻
      '有一时振兴之象。',  // 四爻
      '富贵之家。',  // 五爻
      '婚嫁不利。'   // 上爻
    ]
  },
  // 第2卦 坤为地
  {
    name: '坤为地',
    yao: [
      '阴盛不吉；婚嫁不利。',  // 初爻
      '居家如意；婚嫁顺利。',  // 二爻
      '凝聚向心力。',  // 三爻
      '平安是福。',  // 四爻
      '和乐融融。',  // 五爻
      '失序不和。'   // 上爻
    ]
  },
  // 第3卦 水雷屯
  {
    name: '水雷屯',
    yao: [
      '安居于贵宅；婚嫁吉祥。',  // 初爻
      '是佳偶，但须等待。',  // 二爻
      '不循正途求婚嫁，将有困难。',  // 三爻
      '婚嫁吉祥。',  // 四爻
      '聚财伤和气。',  // 五爻
      '家道中落。'   // 上爻
    ]
  },
  // 第4卦 山水蒙
  {
    name: '山水蒙',
    yao: [
      '谨慎持家；可能罢婚。',  // 初爻
      '妻贤子孝，可振家业。',  // 二爻
      '妻强夫弱，恐有不安；不宜婚嫁。',  // 三爻
      '地处偏僻，生活困苦。',  // 四爻
      '幼年定亲。',  // 五爻
      '妇道贵顺，家道和平。'   // 上爻
    ]
  },
  // 第5卦 水天需
  {
    name: '水天需',
    yao: [
      '可居郊外。',  // 初爻
      '口舌之争。',  // 二爻
      '婚事难成，成则怨偶。',  // 三爻
      '乔迁之喜。',  // 四爻
      '婚嫁得宜。',  // 五爻
      '持家有道；少男乃吉。'   // 上爻
    ]
  },
  // 第6卦 天水讼
  {
    name: '天水讼',
    yao: [
      '有些争议，分辨明白即可。',  // 初爻
      '不宜婚嫁。',  // 二爻
      '不宜另建新居。',  // 三爻
      '改婚不失其道。',  // 四爻
      '与富贵人结婚。',  // 五爻
      '不易安居。'   // 上爻
    ]
  },
  // 第7卦 地水师
  {
    name: '地水师',
    yao: [
      '治家以法，否则必凶。',  // 初爻
      '邻里所重；婚姻吉祥。',  // 二爻
      '不得安宁，小心为上。',  // 三爻
      '近东，朝西南吉；入赘无咎。',  // 四爻
      '利于长子；媒妁而成。',  // 五爻
      '家道兴旺；贵人做媒。'   // 上爻
    ]
  },
  // 第8卦 水地比
  {
    name: '水地比',
    yao: [
      '社区和睦；亲事亦谐。',  // 初爻
      '亲上加亲。',  // 二爻
      '戒慎嫁娶，以免遗憾。',  // 三爻
      '一家和睦；外地定亲，吉',  // 四爻
      '和顺为宜。',  // 五爻
      '恐丧家主；婚嫁来历不明。'   // 上爻
    ]
  },
  // 第9卦 风天小畜
  {
    name: '风天小畜',
    yao: [
      '不求于外，家道自亨。',
      '兄弟和睦，家道兴隆。',
      '家庭不和，婚姻不利。',
      '管理得宜，否则受累。',
      '既富且贵，惠及邻里。',
      '前困后亨。'
    ]
  },
  // 第10卦 天泽履
  {
    name: '天泽履',
    yao: [
      '门庭吉祥。',
      '分析财产，小心损耗。',
      '暗昧不明，以小凌大。',
      '平稳持家。',
      '居安思危，可保平安。',
      '积善之家才有余庆。'
    ]
  },
  // 第11卦 地天泰
  {
    name: '地天泰',
    yao: [
      '团圆平安。',
      '勿信仆从。',
      '谨守先业。',
      '亲友相助，暂时无虞。',
      '有贤内助；远嫁远娶。',
      '小心守业。'
    ]
  },
  // 第12卦 天地否
  {
    name: '天地否',
    yao: [
      '亲戚同住；可以照应。',
      '老人有疾无害。',
      '行为不检，家门有羞。',
      '家运转吉。',
      '祖业深厚。',
      '迁居大吉。'
    ]
  },
  // 第13卦 天火同人
  {
    name: '天火同人',
    yao: [
      '家人和睦。',
      '长子之力，勤俭起家。',
      '须防盗贼。',
      '修缮房屋围墙。',
      '不必惊惶，终于平安',
      '平顺无灾'
    ]
  },
  // 第14卦 火天大有
  {
    name: '火天大有',
    yao: [
      '新富可喜，值得珍惜。',
      '可以乔迁。',
      '喜庆宴会，须防仆婢。',
      '荣美可观，满则招损。',
      '一家和睦，须防盗贼。',
      '福庆满门。'
    ]
  },
  // 第15卦 地山谦
  {
    name: '地山谦',
    yao: [
      '治家以德，平安和睦。',
      '家有恒产，亦有善名。',
      '持盈保泰，安居乐业。',
      '谦和相处，自无不利。',
      '择邻而处，守望相助；近邻议婚。',
      '防范邪祟。'
    ]
  },
  // 第16卦 雷地豫
  {
    name: '雷地豫',
    yao: [
      '怪异之惊，应防凶险。',
      '严正持家，拒斥小人。',
      '速防窃盗。',
      '得福有财。',
      '恐被侵占。',
      '迁居改造为宜。'
    ]
  },
  // 第17卦 泽雷随
  {
    name: '泽雷随',
    yao: [
      '装修迁居。',
      '家主受累；婚嫁不妥。',
      '积蓄有成，关心子女。',
      '置屋不宜。',
      '积善之家；婚嫁可喜。',
      '家人抱怨；嫁娶有缘。'
    ]
  },
  // 第18卦 山风蛊
  {
    name: '山风蛊',
    yao: [
      '改造旧宅；婚嫁可喜。',
      '母系擅权，忍耐协调；可得佳妇。',
      '改造住宅。',
      '父业难保。',
      '努力兴家；嫁娶高亲。',
      '住在高处；良缘天成。'
    ]
  },
  // 第19卦 地泽临
  {
    name: '地泽临',
    yao: [
      '吉事临门；佳偶可成。',
      '福星高照；婚嫁亦吉。',
      '迁徙为宜；婚姻不合。',
      '家业正旺；婚嫁合宜。',
      '五福临门；宜室宜家。',
      '忠厚肃穆。'
    ]
  },
  // 第20卦 风地观
  {
    name: '风地观',
    yao: [
      '小心童仆；自由结亲。',
      '妇女主家。',
      '守住旧债。',
      '喜事临门。',
      '我来建宅。',
      '老宅生息。'
    ]
  },
  // 第21卦 火雷噬嗑
  {
    name: '火雷噬嗑',
    yao: [
      '兴工改造；婚嫁不宜。',
      '老宅不利；婚嫁兴家。',
      '小有不安。',
      '保家有道；婚嫁勤俭。',
      '方位合宜',
      '须防意外。'
    ]
  },
  // 第22卦 山火贲
  {
    name: '山火贲',
    yao: [
      '勤俭起家，知足不辱。',
      '祖上福泽；婚嫁宜待。',
      '可以久居；百年偕老。',
      '先有丧事，后有婚事。',
      '家风勤俭；贤妇可喜。',
      '清白高尚。'
    ]
  },
  // 第23卦 山地剥
  {
    name: '山地剥',
    yao: [
      '基础不稳，防备下人。',
      '宜速变迁。',
      '旧宅改造。',
      '破败防塌。',
      '妇女持家。',
      '忠厚可保，刻薄无屋。'
    ]
  },
  // 第24卦 地雷复
  {
    name: '地雷复',
    yao: [
      '旧业复兴；婚嫁又成。',
      '和睦兴家。',
      '迁移不定。',
      '女多男少；宜从前媒。',
      '光大祖业。',
      '居者不利。'
    ]
  },
  // 第25卦 天雷无妄
  {
    name: '天雷无妄',
    yao: [
      '迁居为宜；婿可入赘。',
      '承继家产；招赘之亲。',
      '外人侵占；远人结亲。',
      '保持祖业。',
      '防备倾倒。',
      '慎勿迁移。'
    ]
  },
  // 第26卦 山天大畜
  {
    name: '山天大畜',
    yao: [
      '屋宅忌高；夫顺妻吉。',
      '谨慎守业；贵婿大吉。',
      '勤俭兴家；男女合志。',
      '新居有路；少年联姻。',
      '住屋风水；婚姻合宜。',
      '道旁吉宅；天作之合。'
    ]
  },
  // 第27卦 山雷颐
  {
    name: '山雷颐',
    yao: [
      '六神无主；婚姻不谐。',
      '未得其正；妇道可议。',
      '家宅不安；十年方婚。',
      '尚可称正。',
      '山居较宜；从一为吉。',
      '合家平安。'
    ]
  },
  // 第28卦 泽风大过
  {
    name: '泽风大过',
    yao: [
      '环境荒芜。',
      '枯树开花；老夫少妻，得以生育。',
      '栋折难居；婚姻不利。',
      '门户宏伟。',
      '闺房不正；女大男小。',
      '小心水灾。'
    ]
  },
  // 第29卦 坎为水
  {
    name: '坎为水',
    yao: [
      '不安之屋；婚姻小心。',
      '防止河岸。',
      '填满坎陷；求婚不成。',
      '节俭持家；婚姻吉祥。',
      '景观可喜；门当户对。',
      '整修家园；良缘须待三年。'
    ]
  },
  // 第30卦 离为火
  {
    name: '离为火',
    yao: [
      '大道之旁。',
      '振起家声；可成佳偶。',
      '老人不安；难望偕老。',
      '逆子之罪；婚姻不吉。',
      '婚事主贵；先泣后笑。',
      '旅行在外。'
    ]
  },
  // 第31卦 泽山咸
  {
    name: '泽山咸',
    yao: [
      '迁居外地；结亲之始。',
      '婚事有变；顺守则吉。',
      '随人他迁不宜；所适非佳偶。',
      '谨慎交际；须防不贞。',
      '可保平安。',
      '口角之争；媒人夸张。'
    ]
  },
  // 第32卦 雷风恒
  {
    name: '雷风恒',
    yao: [
      '华丽难久；勿求攀结。',
      '位置不利，须待十年。',
      '不利久居；难以偕老。',
      '方位不利；配偶不和。',
      '女强男弱；女占喜，男占凶。',
      '旧宅不改；再娶必凶。'
    ]
  },
  // 第33卦 天山遁
  {
    name: '天山遁',
    yao: [
      '早迁为宜；婚姻不合。',
      '迁移有利；退婚不易。',
      '急速迁移；娶妻不利。',
      '隐居为宜；离婚之忧。',
      '高风可尚；志同为婚。',
      '利于求财；私奔之虞。'
    ]
  },
  // 第34卦 雷天大壮
  {
    name: '雷天大壮',
    yao: [
      '不可迁移；防女足疾。',
      '地位适中；婚姻吉祥。',
      '过高易震；夫妻反目。',
      '赶快整修；不是佳偶。',
      '不宜畜牧；婚礼不成。',
      '艰难自守；先苦后乐。'
    ]
  },
  // 第35卦 火地晋
  {
    name: '火地晋',
    yao: [
      '吉屋可居；婚姻缓成。',
      '迁居与老人同住；婚姻稍待。',
      '气氛和谐；两性融洽。',
      '耗失过多；婚姻不正。',
      '屋运转好；婚姻吉祥。',
      '邻里不安；始争终和。'
    ]
  },
  // 第36卦 地火明夷
  {
    name: '地火明夷',
    yao: [
      '最好迁居；婚姻不谐。',
      '修缮完整；妇有足疾。',
      '乡里富家；得其佳偶。',
      '路有阻碍；妇已有孕。',
      '亲族失和；罢婚为宜。',
      '地势太低；先富后贫。'
    ]
  },
  // 第37卦 风火家人
  {
    name: '风火家人',
    yao: [
      '有规有矩；清白之家。',
      '妇人当家。',
      '家规严肃；两姓相从。',
      '富豪之家。',
      '高门大宅；嫁入豪门。',
      '一乡之望；两姓和睦。'
    ]
  },
  // 第38卦 火泽睽
  {
    name: '火泽睽',
    yao: [
      '平顺无咎；耐心等待。',
      '贵人来访；小心私情。',
      '朝西为宜；先疑后释。',
      '四周荒凉。',
      '旧屋可居；亲上加亲。',
      '防有作祟；婚姻终和。'
    ]
  },
  // 第39卦 水山蹇
  {
    name: '水山蹇',
    yao: [
      '迁居不利；婚姻宜待。',
      '方向不利；夫恐有难。',
      '团聚之喜；重逢有缘。',
      '比邻而居；亲上加亲。',
      '不宜居家。',
      '贵人相助；婚姻主贵'
    ]
  },
  // 第40卦 雷水解
  {
    name: '雷水解',
    yao: [
      '平安度日。',
      '防范作祟；得到正室。',
      '盗窃难防；富而不仁。',
      '不易安居；有力媒人。',
      '福宅可居；婚姻吉祥。',
      '防备窃盗。'
    ]
  },
  // 第41卦 山泽损
  {
    name: '山泽损',
    yao: [
      '早些迁移；即日迎娶。',
      '守之则吉；门当户对。',
      '一家二丁；得偶为吉。',
      '阴气过剩，祈祷可安；婚姻可喜。',
      '家业兴隆；天作之合。',
      '不必改造。'
    ]
  },
  // 第42卦 风雷益
  {
    name: '风雷益',
    yao: [
      '新宅宽大；婚姻大吉。',
      '安居之家；百年好合。',
      '逢凶化吉；苦中成婚。',
      '最好迁移；另找媒人。',
      '善人之居；非亲即友。',
      '不可久居；不易偕老。'
    ]
  },
  // 第43卦 泽天夬
  {
    name: '泽天夬',
    yao: [
      '地势太低；门户不对。',
      '宜防火灾；婚姻吉祥。',
      '早些整修；暂时不成。',
      '四周狭隘；久之可成。',
      '整理干净；婚姻合宜。',
      '寂静不安；媒妁未成。'
    ]
  },
  // 第44卦 天风姤
  {
    name: '天风姤',
    yao: [
      '维护家声；男外女内。',
      '女子主持；婚姻可成。',
      '修整家宅；迟缓可成。',
      '僻处防灾；可能无后。',
      '中正之居；婚姻有吉。',
      '谨防屋角；老少夫妻。'
    ]
  },
  // 第45卦 泽地萃
  {
    name: '泽地萃',
    yao: [
      '不可久居；始乱终弃。',
      '祖上积德；婚姻可订。',
      '迁居为宜；怨偶之叹。',
      '兴旺平安；门第有差。',
      '聚族而居；可称贵婿。',
      '家室不安；生离死别。'
    ]
  },
  // 第46卦 地风升
  {
    name: '地风升',
    yao: [
      '乔迁之喜；两姓好合。',
      '必有喜事；阴阳合德。',
      '先虚后实；空房独守。',
      '祭告宅神。',
      '步步高升；攀结高亲。',
      '难免中落；难以偕老。'
    ]
  },
  // 第47卦 泽水困
  {
    name: '泽水困',
    yao: [
      '来往人少；男家卑微。',
      '富贵祭拜；婚姻即成。',
      '悼亡之屋。',
      '慢些入住；事缓可成。',
      '鼻足之患；先疑后成。',
      '修整旧宅；厘清瓜葛。'
    ]
  },
  // 第48卦 水风井
  {
    name: '水风井',
    yao: [
      '荒芜难居；婚姻不成。',
      '水不可饮；婚姻不佳。',
      '洗井可饮；二年可成。',
      '修整为宜；尚须待时。',
      '谦让有礼；同甘共苦。',
      '积善旺家；两姓好合。'
    ]
  },
  // 第49卦 泽火革
  {
    name: '泽火革',
    yao: [
      '新造之屋；待婚三年。',
      '择日修宅；可称佳偶。',
      '三迁为宜；三人为媒。',
      '整建有利；重婚有利。',
      '不利迁动；须防不贞。',
      '居之得安；多求必应。'
    ]
  },
  // 第50卦 火风鼎
  {
    name: '火风鼎',
    yao: [
      '修整有吉；妾生贵子。',
      '富家防窃；不宜娶女。',
      '须防突变；可能悔婚。',
      '栋折之患；男女足疾。',
      '富贵之家；联姻贵族。',
      '地位甚高；金玉之盟。'
    ]
  },
  // 第51卦 震为雷
  {
    name: '震为雷',
    yao: [
      '谨慎为宜；先忧后喜。',
      '注意防盗；夫妻不睦。',
      '小心地震；门户不当。',
      '阳气阻塞；辛苦成家。',
      '祭祷防祟。',
      '邻居有事；近时媒来。'
    ]
  },
  // 第52卦 艮为山
  {
    name: '艮为山',
    yao: [
      '可以长住；百年好合。',
      '不宜迁居；避开此婚。',
      '往来为宜；不拘门户。',
      '平安无事；婚姻平平。',
      '位得中正；慎防巧言。',
      '世代忠厚；婚姻吉祥。'
    ]
  },
  // 第53卦 风山渐
  {
    name: '风山渐',
    yao: [
      '尚无大碍；女长男少。',
      '和乐相处；百年偕老。',
      '不利生产，须防离散。',
      '可能寡居。',
      '可以安居；得子稍迟。',
      '辉煌可观；婚姻吉祥。'
    ]
  },
  // 第54卦 雷泽归妹
  {
    name: '雷泽归妹',
    yao: [
      '偏屋亦吉。',
      '适合隐居；偏房为宜。',
      '不是正宅；不是正娶。',
      '暂勿迁居；须待时日。',
      '喜事临门；二女同归。',
      '须防纷争；婚娶不正。'
    ]
  },
  // 第55卦 雷火丰
  {
    name: '雷火丰',
    yao: [
      '可以安居；婚姻宜速。',
      '明亮为宜；始疑终谐。',
      '只可暂居。',
      '成败在人；巧遇良缘。',
      '名门正户；天作之合。',
      '没落之家；婚姻不详。'
    ]
  },
  // 第56卦 火山旅
  {
    name: '火山旅',
    yao: [
      '谨慎免灾；小户联姻。',
      '寄居亦福；富室赘婿。',
      '小心防火；难以偕老。',
      '地位不适；不是正室。',
      '可称美善；佳偶天成。',
      '覆巢之险；先喜后悲。'
    ]
  },
  // 第57卦 巽为风
  {
    name: '巽为风',
    yao: [
      '朝西有利；联姻军人。',
      '虔诚祷告；卜之则吉。',
      '贫穷之家；门户低微。',
      '装潢美观；婚礼华丽。',
      '坐北朝南；相配得宜。',
      '有丧；惧内。'
    ]
  },
  // 第58卦 兑为泽
  {
    name: '兑为泽',
    yao: [
      '和乐融融；室家得宜。',
      '与邻共富；阴阳相合。',
      '去伪存诚；先合后离。',
      '多疾不安；再三媒说而成。',
      '诚信为上。',
      '内忧外患；似非正聘。'
    ]
  },
  // 第59卦 风水涣
  {
    name: '风水涣',
    yao: [
      '新厦可居。',
      '先散后聚；女长于男。',
      '出外免祸；守节之志。',
      '自有可观。',
      '富贵之家；必得贵婿。',
      '避免冲突；远嫁之象。'
    ]
  },
  // 第60卦 水泽节
  {
    name: '水泽节',
    yao: [
      '可以安居；夫妇得当。',
      '屋内无人；旷怨难免。',
      '先富后贫；先喜后悲。',
      '平安无事；夫妻平顺。',
      '正直节俭；百年好合。',
      '开明为宜；顽固难处。'
    ]
  },
  // 第61卦 风泽中孚
  {
    name: '风泽中孚',
    yao: [
      '不必迁居；从一而终。',
      '家贵子孝；夫唱妇随。',
      '谨防离奇；反复未成。',
      '阴气过盛；可能丧偶。',
      '和乐之家；百年好合。',
      '家业难保；恐难偕老。'
    ]
  },
  // 第62卦 雷山小过
  {
    name: '雷山小过',
    yao: [
      '屋宜低小；门当户对。',
      '不安之象；恐非正配。',
      '谨防凶祸；小心冤家。',
      '安居为宜；勿急媒聘。',
      '小康之家；恐非正娶。',
      '离散之象；小心奸计。'
    ]
  },
  // 第63卦 水火既济
  {
    name: '水火既济',
    yao: [
      '可以安居；初聘为吉。',
      '七年可还；将可团聚。',
      '三年后居；三年可婚。',
      '修正屋宇；珍惜情谊。',
      '向西吉宅；两邻订亲。',
      '不利长房；元配有灾。'
    ]
  },
  // 第64卦 火水未济
  {
    name: '火水未济',
    yao: [
      '门户方位不正；团聚不易。',
      '美善之家；必得贤妇。',
      '安居为宜；迎娶为吉。',
      '安居乐业；二年成婚。',
      '大吉之家；婚姻必成。',
      '勤俭持家；相敬如宾。'
    ]
  }

];