



module.exports = [
  // 第1卦 乾为天
  {
    name: '乾为天',
    yao: [
      '保养为宜。',  // 初爻
      '运动健身。',  // 二爻
      '小心保养。',  // 三爻
      '继续健身。',  // 四爻
      '蒙天所召，不吉。',  // 五爻
      '命在旦夕。'   // 上爻
    ]
  },
  // 第2卦 坤为地
  {
    name: '坤为地',
    yao: [
      '阴寒之症，久则难治。',  // 初爻
      '不药而愈。',  // 二爻
      '无可挽回，凶。',  // 三爻
      '谨慎保养。',  // 四爻
      '病在肠胃。',  // 五爻
      '肝血失调，危险。'   // 上爻
    ]
  },
  // 第3卦 水雷屯
  {
    name: '水雷屯',
    yao: [
      '健康无虞。',  // 初爻
      '保持运动习惯。',  // 二爻
      '不可纵欲伤身。',  // 三爻
      '遵医生嘱咐。',  // 四爻
      '初病可治，久病则危。',  // 五爻
      '呕血之症，凶。'   // 上爻
    ]
  },
  // 第4卦 山水蒙
  {
    name: '山水蒙',
    yao: [
      '恐有外伤。',  // 初爻
      '柔软体操。',  // 二爻
      '小心饮食。',  // 三爻
      '体质虚弱，阴寒之症。',  // 四爻
      '听人指导锻炼。',  // 五爻
      '保养为宜。'   // 上爻
    ]
  },
  // 第5卦 水天需
  {
    name: '水天需',
    yao: [
      '幽居养病，终无大碍。',  // 初爻
      '心胸宽大，自然吉祥。',  // 二爻
      '小心外伤。',  // 三爻
      '调养气血，和顺阴阳。',  // 四爻
      '饮食调理。',  // 五爻
      '病况凶险，不存侥倖。'   // 上爻
    ]
  },
  // 第6卦 天水讼
  {
    name: '天水讼',
    yao: [
      '初病可愈，久病则凶。',  // 初爻
      '在外染病，回家调养。',  // 二爻
      '按原医师指示为宜。',  // 三爻
      '有凶险，改变生活方式则吉。',  // 四爻
      '吐纳之术保健康。',  // 五爻
      '病势时好时坏，恐凶。'   // 上爻
    ]
  },
  // 第7卦 地水师
  {
    name: '地水师',
    yao: [
      '寒多热少，宜早医治。',  // 初爻
      '流动血气，病即舒解。',  // 二爻
      '可能归天。',  // 三爻
      '春生气来，疾病可愈。',  // 四爻
      '跑步健身。',  // 五爻
      '正常运动。'   // 上爻
    ]
  },
  // 第8卦 水地比
  {
    name: '水地比',
    yao: [
      '平安无事。',  // 初爻
      '心平气和，疾病可愈。',  // 二爻
      '改求良医。',  // 三爻
      '多做户外运动',  // 四爻
      '服药生效，不必过虑。',  // 五爻
      '小心头部疾病。'   // 上爻
    ]
  },
  // 第9卦 风天小畜
  {
    name: '风天小畜',
    yao: [
      '安静休养，可以复原。',
      '旧疾复发，小心调养。',
      '阴阳不察，慎择良医。',
      '宽解治之，燥烈之药不宜。',
      '手足麻痹之症。',
      '须防营养过多。'
    ]
  },
  // 第10卦 天泽履
  {
    name: '天泽履',
    yao: [
      '慢跑有益。',
      '保养眼睛。',
      '保养眼睛与脚部。',
      '谨慎走路。',
      '由危转安。',
      '天年有限。'
    ]
  },
  // 第11卦 地天泰
  {
    name: '地天泰',
    yao: [
      '相约运动。',
      '疾病难治。',
      '小孩没事，老人不吉。',
      '不必担心。',
      '必得神佑。',
      '小心守业。'
    ]
  },
  // 第12卦 天地否
  {
    name: '天地否',
    yao: [
      '传染之症，但无大碍。',
      '修身养性。',
      '寒中带热，远求良医。',
      '体质尚强。',
      '小心保养。',
      '即可病愈，须防复发。'
    ]
  },
  // 第13卦 天火同人
  {
    name: '天火同人',
    yao: [
      '避地调养，可以无碍。',
      '魂归宗庙，未可多言。',
      '不良于行。',
      '虽有凶险，终究无害。',
      '先危后安。',
      '恐无生机。'
    ]
  },
  // 第14卦 火天大有
  {
    name: '火天大有',
    yao: [
      '健康无虞，讼事宜解。',
      '出外就医，讼事得胜。',
      '饮食小心，不可争讼。',
      '膨胀之症。',
      '保持门面。',
      '得神庇佑，或即归天。'
    ]
  },
  // 第15卦 地山谦
  {
    name: '地山谦',
    yao: [
      '游泳健身。',
      '用心过劳之症。',
      '劳累过度，可能归天。',
      '多多散心，自可痊愈。',
      '消热去火。',
      '调养心志。'
    ]
  },
  // 第16卦 雷地豫
  {
    name: '雷地豫',
    yao: [
      '颇为不利。',
      '新病可愈，宿疾即忘。',
      '立即就医。',
      '不必担心。',
      '带病延年。',
      '应有转机。'
    ]
  },
  // 第17卦 泽雷随
  {
    name: '泽雷随',
    yao: [
      '改变用药，远方求医。',
      '顾此失彼。',
      '大人无妨，小孩不利。',
      '先凶后吉。',
      '无须担心。',
      '诚心祷告；可能归魂。'
    ]
  },
  // 第18卦 山风蛊
  {
    name: '山风蛊',
    yao: [
      '初无大碍，无子不利。',
      '大人寒症，小孩补气。',
      '应可痊愈。',
      '急救内患，以免不治。',
      '应觅名医。',
      '大限将至，安其天年。'
    ]
  },
  // 第19卦 地泽临
  {
    name: '地泽临',
    yao: [
      '初起之病，可保治愈。',
      '并无大碍；讼事未决。',
      '药不对症，可服苦辛。',
      '危险之志，但仍可愈。',
      '良医诊治，自然可愈。',
      '培养元气，自然健康。'
    ]
  },
  // 第20卦 风地观
  {
    name: '风地观',
    yao: [
      '小孩没事，大人不利。',
      '阴寒之症，可愈。',
      '安心静养，可保平安。',
      '多加小心。',
      '平安无碍。',
      '来日无多。'
    ]
  },
  // 第21卦 火雷噬嗑
  {
    name: '火雷噬嗑',
    yao: [
      '足病初发，宜早医治。',
      '肌肤有病，小心深入。',
      '药不对症，幸无大碍。',
      '难治之症，宜多调养。',
      '忌食肉类，小心调养。',
      '眼耳之疾；保养头部。'
    ]
  },
  // 第22卦 山火贲
  {
    name: '山火贲',
    yao: [
      '初起之病，自可痊愈。',
      '遵照医嘱。',
      '游泳健身。',
      '胸中气阻，调节上下。',
      '园林修养。',
      '清谈解热，可能归天。'
    ]
  },
  // 第23卦 山地剥
  {
    name: '山地剥',
    yao: [
      '足部忧伤，小心诊治。',
      '卧床待医，防其不起。',
      '消除火气。',
      '颇为凶险。',
      '内亏之症，爱惜身体。',
      '饮食不进，小心调养。'
    ]
  },
  // 第24卦 地雷复
  {
    name: '地雷复',
    yao: [
      '静养可复。',
      '再请旧医。',
      '身体屡治屡发，虽危无害。',
      '宜从初治之医。',
      '精气皆老，不必过虑。',
      '难以保全。'
    ]
  },
  // 第25卦 天雷无妄
  {
    name: '天雷无妄',
    yao: [
      '出外就医。',
      '自然痊愈。',
      '外人传染，小心防治。',
      '安静调养，下月可愈。',
      '不必担心。',
      '年老颐养。'
    ]
  },
  // 第26卦 山天大畜
  {
    name: '山天大畜',
    yao: [
      '有病无虞。',
      '腹痛难愈，但无大碍。',
      '谨慎调养，可保无碍。',
      '防小儿病。',
      '调养节制。',
      '健康平安。'
    ]
  },
  // 第27卦 山雷颐
  {
    name: '山雷颐',
    yao: [
      '饮食致病。',
      '头昏眼花，小心调养。',
      '痼疾难治。',
      '少欲则安。',
      '安居静养，劳累难治。',
      '虽危无碍。'
    ]
  },
  // 第28卦 泽风大过
  {
    name: '泽风大过',
    yao: [
      '病体柔弱，温燥之药。',
      '虽危得安。',
      '恐有不测。',
      '胸胀无碍。',
      '不好不坏。',
      '颜面浮肿，可能难治。'
    ]
  },
  // 第29卦 坎为水
  {
    name: '坎为水',
    yao: [
      '求医失当，情况危急。',
      '医治有效，但难全好。',
      '不宜过劳。',
      '最好祷告。',
      '平心静气。',
      '不易动弹，安心静养。'
    ]
  },
  // 第30卦 离为火
  {
    name: '离为火',
    yao: [
      '走路小心。',
      '郁热之症。',
      '早睡早起。',
      '命在危局。',
      '又哭又叹，但仍无妨。',
      '可能归天。'
    ]
  },
  // 第31卦 泽山咸
  {
    name: '泽山咸',
    yao: [
      '足疾医治。',
      '无法步行。',
      '勿陷情欲。',
      '心神恍惚，最好静养。',
      '有病将愈，且可增寿。',
      '胡言乱语，祷之求安。'
    ]
  },
  // 第32卦 雷风恒
  {
    name: '雷风恒',
    yao: [
      '运动伤害，操之过急。',
      '尚称平顺。',
      '运动无恒，如何健康。',
      '服药谨慎。',
      '男女异命。',
      '小心保养。'
    ]
  },
  // 第33卦 天山遁
  {
    name: '天山遁',
    yao: [
      '走路小心。',
      '运动有恒。',
      '纵欲伤身。',
      '大人可治，小孩危险。',
      '避开阴邪。',
      '过胖虚脱。'
    ]
  },
  // 第34卦 雷天大壮
  {
    name: '雷天大壮',
    yao: [
      '慎择良医。',
      '滋补得宜。',
      '血气过刚，防有不测。',
      '恐有不测。',
      '不吉之象。',
      '进退两难。'
    ]
  },
  // 第35卦 火地晋
  {
    name: '火地晋',
    yao: [
      '宽心解怀。',
      '多听老人言。',
      '团体运动；讼事调解。',
      '疥疮或呕血，皆危。',
      '已无大碍。',
      '保养头部；罢讼为吉。'
    ]
  },
  // 第36卦 地火明夷
  {
    name: '地火明夷',
    yao: [
      '食道有疾，或病在手。',
      '左足受伤。',
      '南方修养较宜。',
      '心腹之症，出门求医。',
      '精神症状。',
      '上火下泄，殊为难治。'
    ]
  },
  // 第37卦 风火家人
  {
    name: '风火家人',
    yao: [
      '有病就治，一拖难医。',
      '胃口尚好，可以无碍。',
      '凉剂解厄。',
      '过于肥胖，减之即愈。',
      '肝火过旺，调养心气。',
      '运动健身。'
    ]
  },
  // 第38卦 火泽睽
  {
    name: '火泽睽',
    yao: [
      '没有大碍。',
      '得遇良医。',
      '面上有疮，久后自愈。',
      '目疾求医。',
      '皮肤毛病，不难治好。',
      '因疑成病，解疑无碍。'
    ]
  },
  // 第39卦 水山蹇
  {
    name: '水山蹇',
    yao: [
      '有病初起，退而自养。',
      '过劳之厄。',
      '多加保养。',
      '久病缠身，一时难愈。',
      '众医会诊，才可治好。',
      '良医出手。'
    ]
  },
  // 第40卦 雷水解
  {
    name: '雷水解',
    yao: [
      '一切无恙。',
      '防有邪念邪病。',
      '乱服成药，自找麻烦。',
      '慢跑健身。',
      '恢复正气。',
      '户外运动。'
    ]
  },
  // 第41卦 山泽损
  {
    name: '山泽损',
    yao: [
      '立即运动。',
      '平常状态。',
      '寡欲修身。',
      '立即就医，否则堪虑。',
      '病愈得财。',
      '出外求医。'
    ]
  },
  // 第42卦 风雷益
  {
    name: '风雷益',
    yao: [
      '健康无虞。',
      '祈祷可愈。',
      '有惊无险。',
      '外地就医。',
      '保养得宜。',
      '无恒之凶。'
    ]
  },
  // 第43卦 泽天夬
  {
    name: '泽天夬',
    yao: [
      '小心足疾。',
      '阴虚火盛，调养可治。',
      '湿气上升，治之可愈。',
      '皮肤有病，须防失聪。',
      '调节气旺。',
      '无声可呼，已至险境。'
    ]
  },
  // 第44卦 天风姤
  {
    name: '天风姤',
    yao: [
      '虚弱静养。',
      '池鱼之殃。',
      '坐立不安，求医诊治。',
      '虚火难治，极为凶险。',
      '热中带寒，速求良医。',
      '头部有疾，就医可治。'
    ]
  },
  // 第45卦 泽地萃
  {
    name: '泽地萃',
    yao: [
      '心神混乱，求医可治。',
      '勤练气功。',
      '胸部不适，注意排泄。',
      '外强中干。',
      '心神不宁，最好静养。',
      '悲恸致病，放宽心思。'
    ]
  },
  // 第46卦 地风升
  {
    name: '地风升',
    yao: [
      '有病即治，不可拖延。',
      '最好祈神。',
      '虚弱之症。',
      '虔诚祷告。',
      '病情升高。',
      '可能归天。'
    ]
  },
  // 第47卦 泽水困
  {
    name: '泽水困',
    yao: [
      '大凶之兆。',
      '饮食无度，收心祷告。',
      '无可救药。',
      '长期劳累，恐得归天。',
      '头脚之病，调养祷告。',
      '心神不安，迁地静养。'
    ]
  },
  // 第48卦 水风井
  {
    name: '水风井',
    yao: [
      '旧症不治。',
      '下漏之症，求医难治。',
      '心神不安，井泉可愈。',
      '运动健身。',
      '外寒内热，寒剂可解。',
      '即日可愈。'
    ]
  },
  // 第49卦 泽火革
  {
    name: '泽火革',
    yao: [
      '中腹胀硬，消积健脾。',
      '即将痊愈。',
      '三日可愈。',
      '改求良医。',
      '肝火浮动，不药可愈。',
      '静养修心。'
    ]
  },
  // 第50卦 火风鼎
  {
    name: '火风鼎',
    yao: [
      '使腹下泻，即可痊愈。',
      '实热之症。',
      '小心失聪。',
      '足上生疮，难保完整。',
      '保护胸耳。',
      '耳痛之症。'
    ]
  },
  // 第51卦 震为雷
  {
    name: '震为雷',
    yao: [
      '先危后安。',
      '病势可忧，七日可愈。',
      '由危而安。',
      '腹部积滞，宜泄除之。',
      '修身养性。',
      '安心养目。'
    ]
  },
  // 第52卦 艮为山
  {
    name: '艮为山',
    yao: [
      '足疾就医。',
      '药石难治。',
      '血脉不通。',
      '带病延年。',
      '口能发声，病即可治。',
      '体质厚实。'
    ]
  },
  // 第53卦 风山渐
  {
    name: '风山渐',
    yao: [
      '大人没事，小孩就医。',
      '饮食过度之症。',
      '生产时恐难两全。',
      '肝火过盛。',
      '三年可愈。',
      '健康活泼。'
    ]
  },
  // 第54卦 雷泽归妹
  {
    name: '雷泽归妹',
    yao: [
      '不良于行。',
      '保养眼睛。',
      '待时可愈。',
      '安心静养。',
      '半月可愈。',
      '虚劳失血，不治之象。'
    ]
  },
  // 第55卦 雷火丰
  {
    name: '雷火丰',
    yao: [
      '良医十日可愈，久则不治。',
      '狭心之症，需要开导。',
      '右臂受伤。',
      '眼疾待良医。',
      '名医治之。',
      '大限将至。'
    ]
  },
  // 第56卦 火山旅
  {
    name: '火山旅',
    yao: [
      '病初即治。',
      '旅途有恙，受人照料。',
      '孩子或童仆难保。',
      '忧郁不欢',
      '殉难受奖。',
      '属牛者凶。'
    ]
  },
  // 第57卦 巽为风
  {
    name: '巽为风',
    yao: [
      '积极强身。',
      '祭拜免咎。',
      '太过疲弱。',
      '可以痊愈。',
      '三日可愈。',
      '或许告终。'
    ]
  },
  // 第58卦 兑为泽
  {
    name: '兑为泽',
    yao: [
      '宽心无忧。',
      '疑病得解。',
      '小心外祸。',
      '心神不安，喜事舒怀。',
      '皮肤有疾，速治可愈。',
      '化解内邪，才可保全。'
    ]
  },
  // 第59卦 风水涣
  {
    name: '风水涣',
    yao: [
      '急治为宜。',
      '愁眉不展，良医可治。',
      '转危为安。',
      '凝聚元气，病体自愈。',
      '大汗可愈。',
      '气血郁积，疏通即治。'
    ]
  },
  // 第60卦 水泽节
  {
    name: '水泽节',
    yao: [
      '安居静养。',
      '行走艰难。',
      '饮食不节致病。',
      '病由口入。',
      '节食可治。',
      '病势垂危。'
    ]
  },
  // 第61卦 风泽中孚
  {
    name: '风泽中孚',
    yao: [
      '谨防病变，变则危险。',
      '传染之疾。',
      '时好时坏，求神保佑。',
      '可渐复元。',
      '手足不便，带病延年。',
      '病状甚苦。'
    ]
  },
  // 第62卦 雷山小过
  {
    name: '雷山小过',
    yao: [
      '神魂难保。',
      '药力未至，继续诊治。',
      '刀伤凶险。',
      '静养心神。',
      '针灸可治。',
      '凶险之病，速求良医。'
    ]
  },
  // 第63卦 水火既济
  {
    name: '水火既济',
    yao: [
      '初病可治。',
      '七日可愈。',
      '一时无恙，只保三年。',
      '年老体弱。',
      '最好祷告。',
      '头部有疾，危险可知。'
    ]
  },
  // 第64卦 火水未济
  {
    name: '火水未济',
    yao: [
      '病在下身。',
      '胸腹阻滞。',
      '预防祸祟，渡川以解。',
      '可保三年。',
      '神清气爽。',
      '饮食失节，不可不慎。'
    ]
  }

];