



module.exports = [
  // 第1卦 乾为天
  {
    name: '乾为天',
    yao: [
      '平：得此爻者，宜沉稳待机，若一动作即生灾疾，谋事不利，谨防小人。做官的会有阻力。经商的会有阻滞。女命则兴家业，孕生子。',  // 初爻
      '吉：得此爻者，会得到贵人的提拔。做官的会遇到明主，身居要职。读书人考试能获得佳绩。经商者获利。女命逢之，则又富又贵。',  // 二爻
      '平：得此爻者，会往来不停，财利难获，凡事不认真计画，躁动者会有损失。做官的会身兼重职，且事多繁冗，如果能保持忧虑和谨慎的态度则没有过失。女命逢之，性躁，难成为贤内助。',  // 三爻
      '平：得此爻者，百为艰难。做官的会停缺待职，等待机会。女命逢之，则安乐富贵也。',  // 四爻
      '吉：得此爻者，会遇到贵人，谋遂志得。做官的会飞黄腾达。女命则兼男权，难免孤独。',  // 五爻
      '凶：得此爻者，有过刚取凶之祸，五十以后者不寿。做官的会退职，或遭贬。女命逢之，其性必悍，难成为贤内助。'   // 上爻
    ]
  },
  // 第2卦 坤为地
  {
    name: '坤为地',
    yao: [
      '平：得此爻者，宜谨防仇怨引起的纠纷。阴气盛的人则会大兴家业。做官的要谨防小人的谗言而生祸。',  // 初爻
      '吉：得此爻者，会不愁吃喝，衣食无忧。做官的会升迁，身居高位。女命则为贤良起家。',  // 二爻
      '平：得此爻者，谋望可成，认真经营会有收穫。做官的会有升迁的希望。女命则为德妇。',  // 三爻
      '平：得此爻者，经营受阻，大凡谨慎收敛者，则无横来之祸。做官的要谨守常职，可望升迁。女命则贤而起家。',  // 四爻
      '吉：得此爻者，将会获得财利，事事安稳，没有灾难。做官的将会升迁，飞黄腾达。女命则为德妇，贤惠之人。',  // 五爻
      '凶：得此爻者，有竞争的困扰，会有大的损失。做官的会有被贬之祸。'   // 上爻
    ]
  },
  // 第3卦 水雷屯
  {
    name: '水雷屯',
    yao: [
      '平：得此爻者，安分守己者则无忧，躁动者不利。做官的暂时未受到重用，坚守正道，好运可期。女命则为良妇而兴家。',  // 初爻
      '平：得此爻者，有婚嫁之喜事。做官的权柄日盛。',  // 二爻
      '凶：得此爻者，须安分守己，否则会有灾难。做官的有贪污之嫌，有被停职降职之忧。',  // 三爻
      '吉：得此爻者，谋事可成，百事和合，会得到朋友的帮助，大吉大利。做官的将会名声显赫，有升迁之机。',  // 四爻
      '平：得此爻者，谋事者切勿急躁，小事可成，大事无望，甚至会招来凶祸。',  // 五爻
      '凶：得此爻者，家道中落，须防损失。做官的须谨防小人的谗言。'   // 上爻
    ]
  },
  // 第4卦 山水蒙
  {
    name: '山水蒙',
    yao: [
      '凶：得此爻者，多有官诉，亲朋不和，多争斗，终能脱解。做官的为教育之职，或为司法系统之职。',  // 初爻
      '吉：得此爻者，人情和合，百事有成，或结婚，或生子孙，有财有福。做官的会守住官职。',  // 二爻
      '凶：得此爻者，会生是非，小则破财，大则伤身。做官的会因为贪婪而自取其辱。',  // 三爻
      '凶：得此爻者，人情淡薄，经营受阻。静无灾，动有损。做官的因为无人赏识而难以晋升。',  // 四爻
      '吉：得此爻者，依附贵人、良师者百事顺遂，谋望可成。',  // 五爻
      '平：得此爻者，宜守旧，须谨防争讼，寇盗之扰。做官的会有司寇之名职。'   // 上爻
    ]
  },
  // 第5卦 水天需
  {
    name: '水天需',
    yao: [
      '平：得此爻者，宜守旧，则无灾祸。做官的须守常职，耐心等待机会。',  // 初爻
      '吉：得此爻者，会受到争诉之扰，若能以宽厚待人，则不辩自明。做官的会受到流言的困扰，但最后吉祥。',  // 二爻
      '凶：得此爻者，须防止窃盗之患，亦要预防水险。做官的会被贬职。',  // 三爻
      '平：得此爻者，坏运逐渐远离，恢复平静。做官的能全身而退。从事国学者可出身成名。',  // 四爻
      '吉：得此爻者，会物产丰富，衣食不缺，也会有婚嫁之喜。做官的食禄会丰厚。',  // 五爻
      '平：得此爻者，宜谨慎，则忧愁自散。做官的会有升迁之机会，但须防谗邪之流。'   // 上爻
    ]
  },
  // 第6卦 天水讼
  {
    name: '天水讼',
    yao: [
      '吉：得此爻者，会生起是非，但终吉。有病者，不药而愈。做官的会遭诽谤，但会不辩自明。',  // 初爻
      '平：得此爻者，平安无事。做官的会有食邑之荣。',  // 二爻
      '平：得此爻者，宜保持常态，则无灾难。做官的宜谨守常职，晋升无望。',  // 三爻
      '吉：得此爻者，会转危为安。做官的会闲中复职。',  // 四爻
      '吉：得此爻者，经营、谋事、求财皆大吉。做官的会受到重用。读书人会获得佳绩。',  // 五爻
      '平：得此爻者，会有争诉之忧，宜修德养身，化大为小。做官的会有成有败，患得患失。读书人认真学习，必可获佳绩。'   // 上爻
    ]
  },
  // 第7卦 地水师
  {
    name: '地水师',
    yao: [
      '凶：得此爻者，经营得当，则财货日增。但妄动者，成少败多。不良者，多险难刑伤。做官的宜谨守正道，则会得到上级的欣赏。',  // 初爻
      '吉：得此爻者，会遇到贵人，谋事可成。做官的会受到上级的赏识，有升迁之机会。读书人会取得佳绩。',  // 二爻
      '凶：得此爻者，多有悲优，或家中亲人病故。做官的会受职待缺。',  // 三爻
      '平：得此爻者，安居乐业，无妄动之灾。做官的官运不济，不宜妄想。',  // 四爻
      '平：得此爻者，财富日增，若用人得当，则谋望可成，但须谨防小人之危。做官的或有实权，或因为谏言而地位高显。读书人会取得佳绩。',  // 五爻
      '平：得此爻者，可立家计，或继承家业，但谨防小人从中作梗。做官的会当权立功。专业人才，会技艺成名。'   // 上爻
    ]
  },
  // 第8卦 水地比
  {
    name: '水地比',
    yao: [
      '吉：得此爻者，会遇到知己，谋事称心如意。做官的会有意外之喜。',  // 初爻
      '吉：得此爻者，得贵人之助，营谋遂意。做官的会无过失，安然而吉亨。读书人或能成名。女命则会得贤夫。',  // 二爻
      '凶：得此爻者，交友不慎，或有争诉，破财刑伤。做官的要谨防同僚不睦而造成不顺。女子则所嫁并非良人，破家丧身之象，不然则会争诉破财。',  // 三爻
      '吉：得此爻者，出外有利，多得知己之力，事事顺利。做官的会有升迁之喜。',  // 四爻
      '吉：得此爻者，会先逆后顺，谋事有成，无往不利。做官的会有大的荣耀。读书人会考的佳绩。',  // 五爻
      '凶：得此爻者，刑克有灾，人情淡薄，甚者恐有性命之忧。做官的会失去下属的支持，处境危难。'   // 上爻
    ]
  },
  // 第9卦 风天小畜
  {
    name: '风天小畜',
    yao: [
      '平：得此爻者，宜守旧业，不宜创新。谋事者，须防猜忌疑惑之祸。做官的会闲位复职。',
      '吉：得此爻者，有人相助，营谋遂意。做官的有升迁之机会。',
      '凶：得此爻者，荣而见辱，进而见退，或有足目之疾，或夫妻反目，或君臣疏远，或朋友是非，血气损伤。',
      '平：得此爻者，心诚者，人情和合，营谋颇遂。做官的会得到上司的提拔，久任者，能转运。',
      '吉：得此爻者，能得到他人的帮助，白谋称心。做官的会得到上级的赏识，下属的拥戴，德高望重。',
      '平：得此爻者，会受到小人的骚扰，宜修德养身，不妄进者，则可免灾。妇女占得此爻则凶，君子离家出行有凶险。'
    ]
  },
  // 第10卦 天泽履
  {
    name: '天泽履',
    yao: [
      '平：得此爻者，营谋有计，则财利日增。做官的若修德养身，则有升迁之机。',
      '平：得此爻者，安然自乐，修身养性。做官会有全身而退之兆。',
      '凶：得此爻者，会有争诉，囚狱之扰，甚者家破人亡。做官的则会有被贬职之祸。',
      '平：得此爻者，会有危险，宜温和自持，可免灾祸。做官的会有虎符将帅之兆。读书人将会取得不错的佳绩。',
      '凶：得此爻者，躁动妄行者，则祸患将至，甚者有性命之忧。做官的会功高盖主，而不赏。',
      '吉：得此爻者，财利可获。做官的宜退而以享安静和平之福。读书人努力者可获佳绩。'
    ]
  },
  // 第11卦 地天泰
  {
    name: '地天泰',
    yao: [
      '吉：得此爻者，志同合谋，财利日增。做官的会逐步升迁。',
      '吉：得此爻者，会有好运，必遇尊贵，但要防长上有损，言语有伤。做官的会身居高位，功名显达。',
      '平：得此爻者，须谨慎自持，宜保守，则安，不然会犯小人，事事遇阻。做官的会比较艰难，须防小人和别人的妒忌。',
      '平：得此爻者，营谋失利，退守可平安。做官的进取难成，宜退守。',
      '吉：得此爻者，会得到别人的赏识和抬举，或结婚生子，幸福安乐。做官的或能升迁，或有喜事。',
      '凶：得此爻者，会有破损，有疾病，谨慎厚道者可免祸。做官的会被贬职。'
    ]
  },
  // 第12卦 天地否
  {
    name: '天地否',
    yao: [
      '平：得此爻者，宜守旧，小人得势之时，爻辞虽好，但须谨防小人牵连之事。做官的受职者待缺，当权者防扰。',
      '平：得此爻者，宜忍耐，宽容待人，不然会生是非。做官的宜低调行事。',
      '凶：得此爻者，须防是非争诉之扰。做官的会退休离职。',
      '吉：得此爻者，家产日增，吉庆安乐。做官的会得到朋友和同僚之助，或升迁，或进财。',
      '吉：得此爻者，旧祸已去，好运将至，诸事皆吉。做官的会身居重位。',
      '平：得此爻者，将会转好运，久困者利可期，久讼者讼事解。做官的失职者复职，闲缺者会走马上任。'
    ]
  },
  // 第13卦 天火同人
  {
    name: '天火同人',
    yao: [
      '平：得此爻者，能与人合伙经营获利，或出家远行，或修造门户，或在他处学习。做官的或会受到重用，或有升迁之机。',
      '凶：得此爻者，事多不定，与宗人朋友多不和，相互多猜忌，面和心不合，容易起是非。做官的没有升迁之机，需耐心等待。',
      '凶：得此爻者，或有丧亲，或有诉讼打官司之患。做官的须防被免职之忧。',
      '平：得此爻者，亲友之间会互相猜忌，荣中有辱，结果会好些，凡事须多加提防则可吉祥。做官的若能兢兢业业，则有提拔之机遇，或会受到表彰。',
      '平：得此爻者，先难后易，是非不一。做官的会先贬后升。',
      '平：得此爻者，宜守常，不宜激进。做官的则多有出差的机会。'
    ]
  },
  // 第14卦 火天大有
  {
    name: '火天大有',
    yao: [
      '平：得此爻者，心绪不定，小人欺凌，很是艰辛，长辈或有灾难。做官的须急流勇退，不可贪婪荣华富贵。',
      '吉：得此爻者，营谋得利，财利丰厚，但不利于老人的健康。做官的闲职者会受到重用。',
      '平：得此爻者，有灾难，举步维艰，勿近小人。做官的会受到重任，读书人会取得很好的成绩。',
      '平：得此爻者，宜守常，则可避免伤害，眼睛方面或会出现病症。做官的须安于现状，不可激进，则可免祸。',
      '吉：得此爻者，须相时而动，切不可骄傲自负，以免自取其祸。做官的宜退不宜进。',
      '吉：得此爻者，得到祖上之庇佑，一路好运。做官的以及读书人会进职成名。'
    ]
  },
  // 第15卦 地山谦
  {
    name: '地山谦',
    yao: [
      '平：得此爻者，宜远行或出游，出外做生意会发财。做官的须退守，不宜与人争利，出差的机会会多。',
      '吉：得此爻者，不宜轻举妄动，宜退守。做官的会升迁，读书人会进取成名。',
      '吉：得此爻者，营谋得利，但会劳心劳力。做官的会高升。',
      '吉：得此爻者，无所不通，但做官的、读书人及商人宜固守退让，太盛则有过。',
      '平：得此爻者，会得到贵人的帮助而成事，会获得利益，但须谨防生出祸端，与人争诉。当官的会文武兼用，利于进取。读书人会有金榜题名之机会。',
      '平：得此爻者，有争诉之扰，但会不辨自明。做官的须修德养身，进取有望。'
    ]
  },
  // 第16卦 雷地豫
  {
    name: '雷地豫',
    yao: [
      '凶：得此爻者，不顺，有口舌之争，前进有阻力。做官的不要得意忘形，须谨慎，以免生祸。读书人则可能会一鸣惊人。',
      '吉：得此爻者，会获利。做官的宜急流勇退，读书人有成名之机。',
      '凶：得此爻者，投机取巧，是非不一。',
      '吉：得此爻者，进取成名，经营获利。做官的会得到知己，进取有望。',
      '凶：得此爻者，多心事，有灾难，或有腹疾。做官的多洋洋得意，持恩固宠，难免有失。',
      '平：得此爻者，因为心气太高，会有诉争之扰，但若能改过自新，心态平和，则不会有过失。做官的会有贪污之嫌，须明哲保身。'
    ]
  },
  // 第17卦 泽雷随
  {
    name: '泽雷随',
    yao: [
      '吉：得此爻者，多获利。做官的正当好运，有升迁之机。',
      '凶：得此爻者，不安宁，或受小人的暗算，是非不断。当官的宜退守，进取者要有自知之明。',
      '平：得此爻者，营谋遂意，但宜走正道，才能得利。做官的会得到保举而升迁有望。',
      '平：得此爻者，会得到好人的抬举，化凶为吉。做官的会身居要职，努力进取者可成事，可获得名利。',
      '吉：得此爻者，营谋遂意，多喜庆之事，做官的会升职，或多喜事。',
      '凶：得此爻者，苦难多多，不很如意，重病者会有生命之忧。做官的须防止小人的谗言。'
    ]
  },
  // 第18卦 山风蛊
  {
    name: '山风蛊',
    yao: [
      '吉：得此爻者，会得到祖先的庇佑，营谋遂意。做官的会受到重任，改革创新。',
      '平：得此爻者，改旧从新，则会如意。女命勤俭持家，性忠直者多福。',
      '凶：得此爻者，躁进者有失，不听信谗言者则无难。',
      '凶：得此爻者，事事见忧，有足疾。',
      '吉：得此爻者，多喜庆之事，家中或进人口。做官的进取有望，名誉远播。',
      '平：得此爻者，宜守旧，好运者，多遇尊贵，能获得提拔。做官的宜退守，或告休。'
    ]
  },
  // 第19卦 地泽临
  {
    name: '地泽临',
    yao: [
      '吉：得此爻者，会交好运，营谋称意。做官的会得到众人的拥戴，能升迁。读书人参加考试者必能考出佳绩。',
      '吉：得此爻者，营谋获利，但宜认清时机，不然不能成事，美中不足。做官的会光明磊落，地位清高。',
      '凶：得此爻者，有忧愁，会受苦劳累。做官的会受到小人的谗言攻击，志不能伸。',
      '平：得此爻者，人情和合，经营得利，但要成大事者，须谨慎而行，做好准备再进取。做官的会得到同僚的帮助。',
      '吉：得此爻者，万事如意。做官的会得到上司的赏识。',
      '吉：得此爻者，多获利，无往不利，但谨防气势太盛而变衰。做官的会得到上司的器重，委以重用。'
    ]
  },
  // 第20卦 风地观
  {
    name: '风地观',
    yao: [
      '凶：得此爻者，宜防小人，诸事有困难，弄巧成拙。做官的有危难，不宜进取。',
      '平：得此爻者，在家不如意，外出谋事则好，或喜或忧，或因妇人而起是非，大抵宜动不宜静。此爻女喜，男悲。',
      '平：得此爻者，三心二意，须谨慎行事，知难而退。做官的进退无常。',
      '平：得此爻者，宜出外谋事，多与外人交往，则有利。做官的或居閒职，清高之地。',
      '吉：得此爻者，时来运转，利益丰厚，对于妇人则有怀孕之喜，病重者有生命之忧。做官的会因为自己良好的官德，爵禄有升。',
      '平：得此爻者，运势不通，心有馀而力不足，怀孕者利于生育，久病者会痊癒。做官的宜退守，修德养身。'
    ]
  },
  // 第21卦 火雷噬嗑
  {
    name: '火雷噬嗑',
    yao: [
      '凶：得此爻者，宜谨慎行事，以免生祸端。做官的会遭到贬职。',
      '平：得此爻者，进退艰难，是非不断，或生暗疾，骨肉有伤。做官的不会顺利，会有所纠结。',
      '凶：得此爻者，不易成事，运气不顺，或生心腹之疾，或有惊险。做官的才力不及，有失。',
      '吉：得此爻者，经商必获利。做官的会升迁，读书人会成名。',
      '吉：得此爻者，行好运，有病的会痊愈，有冤的会昭雪，读书人进取成名，做官的会剪除小人。',
      '凶：得此爻者，须防争诉，不良者，耳目不明，血气不顺，或有生命之忧。做官的须防止小人的谗言而遭致贬职。'
    ]
  },
  // 第22卦 山火贲
  {
    name: '山火贲',
    yao: [
      '平：得此爻者，多奔波，静凶动吉。做官的须防退职之患。',
      '平：得此爻者，得人提拔，好运可期，但也要相时而动，不可随性而为，以免遭难。做官的会因人成事，升迁有望。',
      '吉：得此爻者，好运来到，不必费力，自然荣盛，即使有是非纠纷，也不足为患。做官的与人和睦，能居要职。',
      '平：得此爻者，先凶后吉，忧中有喜，虽有危险，终得安宁。未婚者，有望成家。做官的先难后易。',
      '吉：得此爻者，会遇贵人，经营获利，多喜事。做官的闲职者会受到重用，在职者福禄双全。',
      '平：得此爻者，须防好运转凶，家中、亲属有长辈或命终。做官的会升迁。'
    ]
  },
  // 第23卦 山地剥
  {
    name: '山地剥',
    yao: [
      '凶：得此爻者，营谋不遂，或有手足之灾，或兄弟不睦，凶则家破身亡。做官的有升迁之机会，但宜见机行事。',
      '凶：得此爻者，营谋不遂，或受到小人的侵辱，或受到他人的猜忌。做官的须防被贬职。',
      '平：得此爻者，难遇知己，生涯不顺，欲求名利，必须创新，此爻像父母妻子或有忧，须谨防。做官的会遇到明主或大官提拔。',
      '凶：得此爻者，时运不佳，危难之时，多有争诉刑克之事。做官的须谨防小人的谗言，以免遭难。',
      '吉：得此爻者，人情和合，营谋得时，家和福生，妇人进财。做官的升高进职，居要位。读书人、学子考试必能考出佳绩。',
      '平：得此爻者，须谨慎，踏实稳重者可无忧。商人生意买卖会不错。做官的会有权柄。'
    ]
  },
  // 第24卦 地雷复
  {
    name: '地雷复',
    yao: [
      '吉：得此爻者，万事如意，经营获利。做官的会位高权重。读书人会取得佳绩。',
      '吉：得此爻者，与人共利，事业兴旺，病者痊愈。做官的遭贬者会复职。',
      '平：得此爻者，事多反覆，阴阳差错，时好时坏。做官的职位不稳定，更变无定。',
      '平：得此爻者，好运可期，营谋得利。做官的会复职。',
      '吉：得此爻者，会有积蓄，但要谨防父亲出意外。做官的有升职之机会。',
      '凶：得此爻者，做事乖张，诸事不顺，静吉动凶。做官的会过于贪婪权力而有损。'
    ]
  },
  // 第25卦 天雷无妄
  {
    name: '天雷无妄',
    yao: [
      '吉：得此爻者，营谋得利。做官的会得到上司的赞许，百姓的爱戴。',
      '吉：得此爻者，正当好运，不劳而获。富人进财多，商人出外获利。当官的会升官。读书人会取得佳绩。',
      '凶：得此爻者，无妄之灾，破财损身。做官的不宜进取。',
      '平：得此爻者，宜守旧，图谋有实，不致虚浮。做官的宜守职，勿妄动。',
      '平：得此爻者，营谋有成，病得愈，或有生育之喜。做官的纵有祸难，也会不辩自明，不解自释。',
      '平：得此爻者，好运已过，不可妄动，否则是非迭生，唯有变通可免祸。做官的妄动有被贬职之忧。'
    ]
  },
  // 第26卦 山天大畜
  {
    name: '山天大畜',
    yao: [
      '凶：得此爻者，宜守旧，不然会有不测之祸。做官的宜退居闲职，或退位。',
      '凶：得此爻者，谨防是非，或有足疾、腰疾。',
      '平：得此爻者，会得到长辈的重用，或知己相助，前运辛苦，后可有获。做官的会有实权。',
      '吉：得此爻者，营谋有望，财富增加。做官的会有升迁之喜。',
      '吉：得此爻者，营谋遂意，多有喜庆之事。做官的会高升。',
      '吉：得此爻者，万事如意，心想事成，好运连连。做官的会得到上司的提拔，或被举荐而高升。读书人会进取成名。'
    ]
  },
  // 第27卦 山雷颐
  {
    name: '山雷颐',
    yao: [
      '凶：得此爻者，为争夺财利而起祸，大凡心底善良守正道者可无忧。做官的会受贿，失其廉。',
      '凶：得此爻者，大起大落，是非不一，凶者病致死。做官的须防被贬职。',
      '凶：得此爻者，运势低迷，荒诞无稽，甚至有生死离别之伤。做官的有丧名失节之患。',
      '吉：得此爻者，会得到好人的帮助，营谋遂意。做官的会得到祖上的恩惠，幸宠有加。',
      '吉：得此爻者，会有依靠，事可成，但不可乘船涉险。做官的会因人而功可成，位可保。',
      '吉：得此爻者，营谋有成，无往不利。做官的爵禄荣重。读书人会取得佳绩。'
    ]
  },
  // 第28卦 泽风大过
  {
    name: '泽风大过',
    yao: [
      '平：得此爻者，谨慎行事，财利可固。凶者，防孝服之忧。做官的小心谨慎则禄位巩固。',
      '吉：得此爻者，或娶妻纳妾，或生子，君子得少妻义子。做官的去位者会复职。',
      '凶：得此爻者，须防大难而遭致家产有失，或有足目之疾。做官的须谨防被贬职。',
      '吉：得此爻者，多有修造之事，可做大事，勿谋小事。做官的必能受到重用。读书人进取成名。',
      '平：得此爻者，营谋不利，或喜中生忧，美事成丑；先逆后顺之象。做官的不可久任。',
      '凶：得此爻者，不宜进取，退守为安，面部或有疾。做官的有功高震主身危之祸。'
    ]
  },
  // 第29卦 坎为水
  {
    name: '坎为水',
    yao: [
      '凶：得此爻者，时运不佳，宜防跌入陷阱灾难之中。做官的须防小人。',
      '平：得此爻者，有小成就，女命或为侍妾，凶者防险难或生心腹血气之疾。做官的会有小的成就，大事不成。',
      '凶：得此爻者，多坎坷，多争诉之事。做官的宜退守。',
      '平：得此爻者，多喜事，或有结婚之喜。做官的多饮食之乐。',
      '平：得此爻者，平淡无常，宜养精蓄锐。做官的没有危难，职位无忧。',
      '凶：得此爻者，须防牢狱之灾。做官的须防职权旁落之忧。'
    ]
  },
  // 第30卦 离为火
  {
    name: '离为火',
    yao: [
      '平：得此爻者，须防无妄之灾，宜谨慎，或有足疾。做官的宜安守。',
      '吉：得此爻者，财利可获。做官的会受到重用。读书人会取得佳绩。',
      '凶：得此爻者，乐中生悲，吉中生愁，险难迭生。做官的告休。',
      '凶：得此爻者，时运不济，困难重重，或和长辈不睦，或遭官灾。',
      '平：得此爻者，不宜进取，宜守常。做官的在位者得志，退职者多险危。',
      '吉：得此爻者，时运佳，多喜事，经营获利。做官的会功成名就，读书人会取得好成绩。'
    ]
  },
  // 第31卦 泽山咸
  {
    name: '泽山咸',
    yao: [
      '平：得此爻者，行事过急，多难成就。做官的须修身养性，等待机会，京官出，闲官起。',
      '平：得此爻者，奔波徒劳，宜静不宜动。做官的在位者吉，出差者有险。',
      '平：得此爻者，最好退守，做官的谨防被贬。',
      '平：得此爻者，朋友相助，可谋小事，大事有困难，心绪不定。做官的秉公执政，升迁有望。',
      '平：得此爻者，人情不合，营谋微小。做官的多与同僚不睦。',
      '平：得此爻者，多口舌之争，防止被他人诽谤，从事演讲、技艺、评论者吉。做官的或遭言责。'
    ]
  },
  // 第32卦 雷风恒
  {
    name: '雷风恒',
    yao: [
      '凶：得此爻者，人情乖离，前途渺茫，静守可免祸。做官的难于受到上司的赏识。',
      '平：得此爻者，安分守己则无忧。做官的宜洁身自爱，谨慎行事。',
      '凶：得此爻者，须防小人诽谤，争诉之扰。做官的须防被贬。',
      '凶：得此爻者，营谋费力，难以成事。做官的时运不济，有所退步。',
      '凶：得此爻者，多招毁谤，有所损失。做官的多阿谀权势而有失。',
      '凶：得此爻者，求名望利，小能成，大则无功，女人不利夫子。做官的会很劳累，多动少静。'
    ]
  },
  // 第33卦 天山遁
  {
    name: '天山遁',
    yao: [
      '凶：得此爻者，宜安分守己，可无忧。做官的宜择机而退。',
      '平：得此爻者，家中有争执，安常守分无忧，农人有进牛畜之喜 。',
      '平：得此爻者，多灾多难，良善者，得妻之力，或进人口。做官的宜急流勇退。',
      '平：得此爻者，虽有收穫，但谨防因小人而受祸。做官的宜告休避难。',
      '吉：得此爻者，近贵多利。做官的或升迁，或功成身退。',
      '吉： 得此爻者，营谋获利，家肥业厚。做官的乐天知命，退居闲职。'
    ]
  },
  // 第34卦 雷天大壮
  {
    name: '雷天大壮',
    yao: [
      '凶：得此爻者，会有争诉，动则凶，须防足疾。做官的须防小人的谗言而受辱。',
      '吉：得此爻者，营谋得意。做官的中庸处事，心中无愧。',
      '凶：得此爻者，或有官司之事，或家中有丧，人财不利。做官的多祸难，进退难安。',
      '吉：得此爻者，常人得福，久静者必动，动则吉。做官的闲职者复职，进取如意。',
      '凶：得此爻者，一筹莫展，不能得利，病者有丧身之兆。做官的会荒于政务。',
      '平：得此爻者，进退两难，多是非争诉，宜守常。做官的宜退不宜进，恐有遭贬之危。'
    ]
  },
  // 第35卦 火地晋
  {
    name: '火地晋',
    yao: [
      '平：得此爻者，忧愁参半，静则吉动则凶。做官的不宜进取，须防流言。',
      '吉：得此爻者，求谋称意，多得母亲扶助，或得妻财。做官的守正者会进取。',
      '平：得此爻者，得朋友之助，营谋遂意，但谨防意外之险。做官的有升迁之机。',
      '凶：得此爻者，时运不佳，或有争诉。做官的不宜进取，有阻力，须守正。',
      '吉：得此爻者，好运到来，营谋获利。做官的有升迁之喜。',
      '平：得此爻者，有修屋宇之喜，不良者有争诉之忧。做官的有食邑之荣。'
    ]
  },
  // 第36卦 地火明夷
  {
    name: '地火明夷',
    yao: [
      '平：得此爻者，或有手足之伤，善者有进财纳福之喜。做官的有飞黄腾达之象，但谨防有失。',
      '吉：得此爻者，常人或有难，但会得贵人之助。做官的会有实权，能当大任。读书人会取得好成绩。',
      '平：得此爻者，有修屋宇造作之兆。不良者，左股或有伤，多忧愁分离之患。',
      '平：得此爻者，出外营谋者会顺利，妇人有孕者生男，不良者或生心腹之疾。做官的闲职者会复职，在职者，多出外任职，韬光养晦者必出身成名。',
      '平：得此爻者，难逢知己，或有家难之祸。做官的须修德养性可保无忧。',
      '凶：得此爻者，先喜后忧，老者或不寿。做官的防止遭人流言，或被贬。'
    ]
  },
  // 第37卦 风火家人
  {
    name: '风火家人',
    yao: [
      '平：得此爻者，谋事有成，未婚者会结婚，老者不利于寿。做官的闲职者会晋升有实权，当职者则权力旁落。',
      '吉：得此爻者，营谋成家，多喜事。做官的会荣华富贵。',
      '凶：得此爻者，忧喜参半，谨防沉迷于享乐中。做官的严而少宽恕之恩。',
      '吉：得此爻者，时运正佳，贵人提拔，孤寡见亲。做官的仕途顺利，升迁有望。',
      '吉：得此爻者，营谋得利，会得到贵人的提携。做官的显贵，进取有望。',
      '吉：得此爻者，营谋称意，女命更好。做官的位高权重，读书人进取成名。'
    ]
  },
  // 第38卦 火泽睽
  {
    name: '火泽睽',
    yao: [
      '平：得此爻者，营谋先失而后得，人事先离而后合，谨防凶恶之灾患。做官的闲职者复职，被贬者复升。',
      '平：得此爻者，会得知己，营谋遂意。做官的会遇到明主，升迁有望。',
      '凶：得此爻者，谋望有阻，险中求安，先迷后顺。不良者有骨肉刑伤之厄。做官的须防小人的谗言。',
      '平：得此爻者，能得到朋友的帮助，转危为安，求婚者必配。做官的会得到同僚的推荐，升迁有机。',
      '平：得此爻者，经营获利，抬举有人。不良者，亲朋怨恶，骨肉刑伤，官司牵连。做官的会获得成就与名望，读书人会取得佳绩。',
      '平：得此爻者，遭污受诬，先损后益。做官的须防被诽谤之忧。'
    ]
  },
  // 第39卦 水山蹇
  {
    name: '水山蹇',
    yao: [
      '平：得此爻者，宜守旧安常。做官的稳步进取，好运将至。',
      '凶：得此爻者，涉艰历险，营谋有阻。做官的宜保持忠贞，报效国家。',
      '平：得此爻者，不宜进取，或有妻子之喜。做官的位高者会晋升。',
      '凶：得此爻者，不良者会有争诉。做官的进升有机，求名望利皆有实而不虚。',
      '吉：得此爻者，会得到贵人提举，无往不利。',
      '吉：得此爻者，好运来到，营谋遂意。做官的会身居要职，读书人进取成名。'
    ]
  },
  // 第40卦 雷水解
  {
    name: '雷水解',
    yao: [
      '平：得此爻者，经营者吉，未婚者配。做官的德位相称，晋升有望，读书人会取得好成绩。',
      '吉：得此爻者，正当好运，财利可获。做官的会荣华富贵，读书人会取得佳绩。',
      '凶：得此爻者，须防窃盗，是非诉讼。做官的谨防被贬之忧。',
      '凶：得此爻者，须防小人，或交友不慎之祸。',
      '吉：得此爻者，正当好运，君子有利，病者愈。做官的会身居要职。',
      '吉：得此爻者，运途顺利，多营谋获利。做官的闲职者会复职，居要位。'
    ]
  },
  // 第41卦 山泽损
  {
    name: '山泽损',
    yao: [
      '平：得此爻者，谋事得当，可获利，不良者，或因酒食误事。做官的会因为工作忙碌而顾不得家庭，声望日盛。',
      '凶：得此爻者，宜谨守勿动。做官的时机未成熟，难于升迁。',
      '平：得此爻者，合力经营，获利者多，未婚者配。做官的与同僚关系融洽，进取有望。',
      '平：得此爻者，多喜庆之事，有灾者转好运，有病者愈，有忧者转喜。做官的闲职者将被起复。',
      '吉：得此爻者，运势大好，财利丰富。做官的会得到领导的讚赏和提拔。读书人会取得佳绩。',
      '吉：得此爻者，贵人扶持，财利可期。做官的会得到下属的爱戴，领导的器重。'
    ]
  },
  // 第42卦 风雷益
  {
    name: '风雷益',
    yao: [
      '吉：得此爻者，大事可成，万事称心。做官的会高升，读书人会取得大的成绩。',
      '吉：得此爻者，商贾获利，福份多多。做官的仕途一帆风顺，读书人进取成名。',
      '平：得此爻者，常人获利，不良者大凶，官灾祸患并至。做官的会受到重用，委以重职。',
      '平：得此爻者，或会迁居，或有修造，诉者利，官者伸。做官的会被领导委以重任。',
      '吉：得此爻者，谋望称意，事多顺利。做官的会遇到明主，仕途顺利。',
      '凶：得此爻者，贪图名利，或有意外之祸，刑克损伤之灾。做官的因为贪求名位，或被贬职。'
    ]
  },
  // 第43卦 泽天夬
  {
    name: '泽天夬',
    yao: [
      '凶：得此爻者，会有无妄之灾，宜静守。做官的躁动者有损。',
      '凶：得此爻者，多忧愁，多惊险，谨防盗窃之事发生。做官的多掌兵权。',
      '凶：得此爻者，会有争诉之忧，品行端正者无忧，初见艰难，终得安乐。做官的除奸不成，反被倒咬一口。',
      '凶：得此爻者，心绪不定，所谋不成。做官的有心而力不足，难于升迁。',
      '平：得此爻者，营谋遂意，诉者伸，有病者愈。做官的须防奸邪之辈侵害。',
      '凶：得此爻者，营谋不成，宜守常，不良者，骨肉刑克，是非缠绕。做官的难于久任，激流勇退为佳。'
    ]
  },
  // 第44卦 天风姤
  {
    name: '天风姤',
    yao: [
      '平：得此爻者，或遇贵人好友提携而发财进人，女人有生育之喜。不良者，防疾诉忧患，或女人有不贞之事。做官的有被贬职之忧。',
      '平：得此爻者，有财运，妇人则有怀孕之喜。做官的晋升有望。',
      '凶：得此爻者，多灾难。做官的会退步，或者被贬。',
      '凶：得此爻者，多是非之扰，年老者不利于寿。做官的有损，多难。',
      '平：得此爻者，会遇到贵人提携，有意外之喜，妇人有怀孕之喜。做官的会为栋梁之才。',
      '凶 得此爻者，营谋艰辛，孤立无助。做官的功名大显，但好运将尽。读书人努力进取者能取得佳绩。'
    ]
  },
  // 第45卦 泽地萃
  {
    name: '泽地萃',
    yao: [
      '平：得此爻者，会受到小人的陷害，先凶后吉，宜谨慎从事。做官的会被贬职。',
      '吉：得此爻者，正当好运，贵人提举，营谋得利。做官的得人引荐，能升迁。',
      '凶：得此爻者，家裡不安，六亲有损，老者多凶。做官的在位不得安宁，出外则艰辛。',
      '平：得此爻者，不从正道者，会有凶祸，惟大德君子，可改过得福。做官的须防他人猜忌，宜弃高就低，急流勇退为吉。',
      '平：得此爻者，人情不合，营谋有阻。做官的不得人心，其志未光。',
      '凶：得此爻者，事多烦扰，不能安宁，或上下无情，长幼忧愁，名利成虚。'
    ]
  },
  // 第46卦 地风升
  {
    name: '地风升',
    yao: [
      '吉：得此爻者，名利双收，营谋遂心。做官的晋升有望。',
      '平：得此爻者，常人有喜，病者安，谋事可成。做官的有升迁之机。',
      '平：得此爻者，营谋遂意。做官的会身居要位，读书人可成名。',
      '吉：得此爻者，得山林之利，隐者有山林之乐。做官的会升迁，身居要职。',
      '吉：得此爻者，正行好运，大愿可成。做官的会高升。',
      '平：得此爻者，有贪得无厌之祸。做官的会告休。'
    ]
  },
  // 第47卦 泽水困
  {
    name: '泽水困',
    yao: [
      '凶：得此爻者，有惊忧，或有丧服之灾。做官的会退职。',
      '平：得此爻者，得贵人提携，营谋获利，静吉动凶。做官的有晋升之机。',
      '凶：得此爻者，多难之时，宜守正谨慎。',
      '凶：得此爻者，谋事虽然不利，但终有出险之时，从商者或周转不利。做官的闲职者会被起用。',
      '凶：得此爻者，先难后易，不良者有诉邢之扰，丧服之忧。做官的先阻后顺。',
      '平：得此爻者，防惊忧丧服，惟商人、旅行者利有攸往。做官的会有刑罚束缚之忧。'
    ]
  },
  // 第48卦 水风井
  {
    name: '水风井',
    yao: [
      '凶：得此爻者，谋事有阻。做官的会退居闲职，求名者不遂。',
      '凶：得此爻者，宜谨守以避祸。做官的宜退以自保。',
      '平：得此爻者，安分守己为吉，不良者或有灾。做官的难逢明主，需另觅良机。',
      '平：得此爻者，宜安分守己，或有迁居之喜。做官清廉者，修身立命，可望上进。',
      '吉：得此爻者，营谋遂意。做官的品行端正，会得到上司的赞赏。',
      '吉：得此爻者，谋事顺利，材用充足。做官的功高德厚，能得升迁。'
    ]
  },
  // 第49卦 泽火革
  {
    name: '泽火革',
    yao: [
      '平：得此爻者，宜谨守常规，不可存非分之想。做官的不宜进取，切不可怀出位之思。',
      '吉：得此爻者，多喜庆之事，做官的会升迁。',
      '凶：得此爻者，多事之时，谨慎而行。做官的有躁动失政之忧。',
      '平：得此爻者，会有转变，有收穫。做官的会有升迁之机。',
      '吉：得此爻者，时运转好，多吉利之事。做官的晋升有望。',
      '平：得此爻者，安分守己则是非不扰。做官的进取者会晋升，离退休者会功成身退。'
    ]
  },
  // 第50卦 火风鼎
  {
    name: '火风鼎',
    yao: [
      '平：得此爻者，因人成事，多喜事，或结婚，或生子，忧者喜，贱者贵。做官的会因功得晋升。',
      '吉：得此爻者，虽有收穫，但须防忧。做官的秉公执政，须防小人的谗言之扰。',
      '平：得此爻者，先难后易，老者多福，年轻人多不如意。做官的会遇到阻力，但最终的结果会好。',
      '凶：得此爻者，多灾之时，或生足疾。做官的有被贬职之忧。',
      '吉：得此爻者，时运不错，多获利。做官的多吉兆，多升迁。',
      '吉：得此爻者，安稳利达，谋求遂意。做官的闲职者复职，离退者功成身退。'
    ]
  },
  // 第51卦 震为雷
  {
    name: '震为雷',
    yao: [
      '吉：得此爻者，好运到来，先惊后喜。',
      '凶：得此爻者，多难之时，或有争诉，小心为妙。做官的有遭奸邪之辈陷害之忧。',
      '凶：得此爻者，多忧愁，多灾难，宜谨慎，可免祸。做官的不宜进取。',
      '凶：得此爻者，一筹莫展，前进有阻。做官的有被贬职之危。',
      '凶：得此爻者，不吉之时，或有手足受损之忧。做官的守常者无忧。',
      '凶：得此爻者，须谨防意外，或夫妻有刑克，亲邻遭难。做官的要谨防被贬职之忧。'
    ]
  },
  // 第52卦 艮为山
  {
    name: '艮为山',
    yao: [
      '平：得此爻者，宜守本份，不要纵欲。做官的保守己职者无失。',
      '凶：得此爻者，运势受阻，或奔波在外，多劳苦；或有足疾。做官的得不到他人的帮助，不宜上进。',
      '凶：得此爻者，不顺之时，危难不安。',
      '平：得此爻者，宜安分守常，不可有非分之想。',
      '平：得此爻者，正人君子，人情和合，谋望遂意。做官的会居要职。',
      '吉：得此爻者，多福多利，但易防不吉之事。做官的会升迁，读书人会取得佳绩。'
    ]
  },
  // 第53卦 风山渐
  {
    name: '风山渐',
    yao: [
      '凶：得此爻者，运气不佳，谋为不利。',
      '吉：得此爻者，无往不利，随处皆安。',
      '凶：得此爻者，多惊扰，人情不睦，盗贼侵害。做官的上进有阻力，有被贬之忧。',
      '平：得此爻者，利于修造，自给自足。做官的须随遇而安，升迁无定。',
      '吉：得此爻者，先难后易，做官的多招诽谤，先暗后明。',
      '吉：得此爻者，得人荐举，谋望有成，祸患不侵，多福多利。做官的大运来到，会得到重用。读书人会取得好成绩。'
    ]
  },
  // 第54卦 雷泽归妹
  {
    name: '雷泽归妹',
    yao: [
      '吉：得此爻者，有小德，谋望顺遂。做官的或有政绩。',
      '平：得此爻者，不宜进取，守旧者则祸害不生。',
      '凶：得此爻者，进退无常，劳役悲苦。做官的有被降职之忧。',
      '平：得此爻者，不是佳期，须待时运。',
      '吉：得此爻者，正值好运，或成婚，或得财。做官的会受到重用，身居要职。',
      '凶：得此爻者，事多不顺，营谋皆空。做官的居虚位而无实禄。'
    ]
  },
  // 第55卦 雷火丰
  {
    name: '雷火丰',
    yao: [
      '平：得此爻者，得贵人提拔，谋望有成，不良者有大过，必招灾殃。做官的会遇到明主，得以晋升。',
      '吉：得此爻者，有久困发财之美，有讼者不辩自明，有病者会愈。做官的忠言多阻于邪议，先失后得。',
      '平：得此爻者，营谋难遂，或明而受蔽，争诉日起，或手足有疾，难于做事。做官的有告休之兆。',
      '平：得此爻者，明而受蔽，得人解释而吉。做官的受到领导和同僚的猜忌，位不安。',
      '吉：得此爻者，会得好人提举，谋望称意。读书人会取得佳绩。',
      '凶：得此爻者，骨肉相残，离祖成家，难免口舌之争。做官的位高者有危。'
    ]
  },
  // 第56卦 火山旅
  {
    name: '火山旅',
    yao: [
      '凶：得此爻者，运气不佳，须防祸难。做官的有才但不能受到上司的重用。',
      '吉：得此爻者，运气转好，营谋有成。做官的显耀。',
      '凶：得此爻者，运势转坏，多灾多难。做官的有离职之忧。',
      '凶：得此爻者，在外者，有所成就，但美中之足，有忧惨是非之事发生。从商者会获利。',
      '吉：得此爻者，会得到老者的帮助，事有所成。',
      '凶：得此爻者，先好后坏，或迁居修造以避灾难，或有目疾，或会遭火灾。做官的难保其位，有先得后失之忧。'
    ]
  },
  // 第57卦 巽为风
  {
    name: '巽为风',
    yao: [
      '平：得此爻者，有得有失，不良者多招诽谤。做官的或有差役，进退不一，或有兼权，难中有易。',
      '吉：得此爻者，诚恳待人，谋望获利。做官的有升迁之机。',
      '凶：得此爻者，运势低迷，有穷困之厄。做官的有被贬职之忧。',
      '吉：得此爻者，正当好运，多福多利。读书人会取得佳绩。',
      '吉：得此爻者，谋望有成，无往不利。做官的先阻后顺。',
      '凶：得此爻者，多损失，或生疾病。做官的有运不逢时，须谨慎。'
    ]
  },
  // 第58卦 兑为泽
  {
    name: '兑为泽',
    yao: [
      '吉：得此爻者，人情和合，百谋皆遂。',
      '吉：得此爻者，正当好运，事事和顺。做官的有升迁之兆。',
      '凶：得此爻者，会有意外之祸，甚者则失道忘身。做官的有听信谗言而遭辱之忧。',
      '平：得此爻者，从商获利，或进人口，不良者或有疾病，谋望不成。做官的会身居要职，升迁有望。',
      '凶：得此爻者，时运不佳，多意外之祸。做官的会受到小人的诽谤。',
      '平：得此爻者，营谋不顺，谨防有忧。'
    ]
  },
  // 第59卦 风水涣
  {
    name: '风水涣',
    yao: [
      '吉：得此爻者，得尊上提举，营谋皆遂。做官的会受到重用，有望晋升。',
      '平：得此爻者，谋望有成，或会成家。做官的有实权。',
      '平：得此爻者，常人获利。做官的出外就职。',
      '吉：得此爻者，先凶后吉，谋望和合，求利可获。做官的会身居要职。',
      '吉：得此爻者，正当好运，事事皆吉，求利者遂。做官的会升迁。',
      '平：得此爻者，先难后易，运势好转。做官的外出就职者会有灾难。'
    ]
  },
  // 第60卦 水泽节
  {
    name: '水泽节',
    yao: [
      '平：得此爻者，进取不利，宜守旧。',
      '凶：得此爻者，时运不佳，事多乖离，宜动不宜静。做官的不得时运。',
      '平：得此爻者，多辛苦，少收获。',
      '吉：得此爻者，秉公守法，安于正道，福利可获。做官的会得到上司的欣赏，升迁有望。',
      '吉：得此爻者，正当好运，谋望有成。',
      '凶：得此爻者，不得天时，名利皆无。做官的不知变通，前途渺茫。'
    ]
  },
  // 第61卦 风泽中孚
  {
    name: '风泽中孚',
    yao: [
      '吉：得此爻者，得贵人提举，谋事有成，但喜中有忧，宜行正道，修身养性，不可逸乐。做官的会受到举荐，能居要职。',
      '吉：得此爻者，无往不利，多进钱财，或生子。做官的会晋升。',
      '凶：得此爻者，喜中有忧，事多反覆。做官的同僚不睦，先进后退。',
      '平：得此爻者，能得到提拔，但有失去配偶或财产有失之忧。做官的会晋升，身居要位。',
      '吉：得此爻者，人情和合，谋事有成，无往不利。做官的君臣一心，会得到上司的赞赏。',
      '凶：得此爻者，多虚少实，前路凶险。经商者会有损失。做官的有近颜之喜。'
    ]
  },
  // 第62卦 雷山小过
  {
    name: '雷山小过',
    yao: [
      '凶：得此爻者，不得天时，灾难突来。做官的有骤然取祸之忧。读书人则有一飞冲天之兆。',
      '平：得此爻者，得贵人指引，谋望有成。做官的严于律己，恪守己职，则升迁有望。',
      '凶：得此爻者，时运不济，谨防意外。做官的须防小人奸邪之辈所害。',
      '平：得此爻者，宜安常守职，不可妄动。',
      '平：得此爻者，不利谋事，守旧为佳。做官的有告休之危。',
      '凶：得此爻者，时运不佳，不知退守，过刚则折。'
    ]
  },
  // 第63卦 水火既济
  {
    name: '水火既济',
    yao: [
      '平：得此爻者，时运未到，欲动未动，安保无虞。做官的有职未受，有位未登。',
      '平：得此爻者，先难后易，做官的有先逆后顺之美。',
      '凶：得此爻者，有结怨争诉之损。做官的多差遣征伐之举。',
      '平：得此爻者，时运平平，有备则无患。做官的须做好预防，则爵禄稳固。',
      '吉：得此爻者，近谋有实，远谋多虚，不利东方，利于西方。',
      '凶：得此爻者，小人侵扰，坐船者，防溺水之灾。做官的有过刚则折之忧。'
    ]
  },
  // 第64卦 火水未济
  {
    name: '火水未济',
    yao: [
      '凶：得此爻者，经营不利，涉水行舟者，谨防溺水之患。做官的仕途有阻，不能前进。',
      '吉：得此爻者，安份守纪者，谋望遂意。做官的克服困难者，晋升有望。',
      '凶：得此爻者，宜见机行事，不宜妄动。做官的有因人成事之美。在商旅则涉川历险而利可获。',
      '吉：得此爻者，会得好人提举，获利丰厚。做官的会受到重用，名利双全。读书人会取得佳绩。',
      '吉：得此爻者，谋望有成，财利丰厚。做官的能得到升迁。',
      '平：得此爻者，行险而顺，不良者有溺水之厄，纵酒之灾。做官的有望升迁。'
    ]
  }

];

