

module.exports = [
  // 第1卦 乾为天
  {
    name: '乾为天',
    yao: [
      '龙潜伏着，不要有所作为。',  // 初爻
      '龙出现在地上，适宜见到大人。',  // 二爻
      '君子整天勤奋不休，晚上还戒惕谨慎，有危险，但没有灾难。',  // 三爻
      '或往上跃升，或留在深渊，没有灾难。',  // 四爻
      '龙飞翔在天空，适宜见到大人。',  // 五爻
      '龙飞得太高，已经有所懊悔。'   // 上爻
    ]
  },
  // 第2卦 坤为地
  {
    name: '坤为地',
    yao: [
      '脚下踏着霜，坚冰将会到来。',  // 初爻
      '直接产生，遍及四方，广大无边，不必修习，无不有利。',  // 二爻
      '蕴涵文采而可以正固。或者跟随君王做事，没有功业却有好的结局。',  // 三爻
      '扎起口袋，没有灾难也没有称誉。',  // 四爻
      '黄色的衣裙，最为吉祥。',  // 五爻
      '龙在郊野争战，它的血是青黄色的。'   // 上爻
    ]
  },
  // 第3卦 水雷屯
  {
    name: '水雷屯',
    yao: [
      '徘徊不进，适宜守住正固，适宜建立侯王。',  // 初爻
      '困难重重，徘徊难行，骑上马也是团团打转。要是没有盗贼，就前去结婚了。女子守正而不出嫁，十年才可出嫁。',  // 二爻
      '追逐野鹿却没有猎官带领，这样只会困处于山林中。君子察知几微，不如放弃算了。前往会有困难。',  // 三爻
      '骑上马而团团打转。若是要求结婚，前往是吉祥的，没有什么不适宜。',  // 四爻
      '囤积恩泽，小规模的正固是吉祥的，大规模的正固就有凶祸。',  // 五爻
      '骑着马团团打转，哭泣得血泪涟涟。'   // 上爻
    ]
  },
  // 第4卦 山水蒙
  {
    name: '山水蒙',
    yao: [
      '启发蒙昧，适宜用刑罚来规范人们，借此让他们摆脱桎梏。依此有所前往，会陷入困难。',  // 初爻
      '包容蒙昧，吉祥。容纳妇人，吉祥。儿子能够持家。',  // 二爻
      '不要娶这个女子，她见到有钱的男子，就会失身。娶她没有任何好处。',  // 三爻
      '困处于蒙昧之中，有困难。',  // 四爻
      '蒙昧的儿童，吉祥。',  // 五爻
      '击走蒙昧。不适宜做强盗，适宜抵御强盗。'   // 上爻
    ]
  },
  // 第5卦 水天需
  {
    name: '水天需',
    yao: [
      '在郊野等待，适宜守常不动，没有灾难。',  // 初爻
      '在沙滩上等待，有些小的责难，最后吉祥。',  // 二爻
      '在泥沼中等待，招来了强盗。',  // 三爻
      '在血泊中等待，从洞穴中逃出来。',  // 四爻
      '在享用酒食中等待，正固吉祥。',  // 五爻
      '进入洞穴中，有不请自来的三个客人到了，尊敬他们，最后吉祥。'   // 上爻
    ]
  },
  // 第6卦 天水讼
  {
    name: '天水讼',
    yao: [
      '不要把事情做到底，有小的责难，最后吉祥。',  // 初爻
      '争讼没有成功，回来躲避，他采邑的三百户人口没有灾害。',  // 二爻
      '享用祖先的余荫，守住正固，有危险，最后吉祥。或者跟随君王做事，没有成就。',  // 三爻
      '争讼没有成功，返回到自己命定的角色，变得安于正固，吉祥。',  // 四爻
      '争讼，最为吉祥',  // 五爻
      '或许受赐官服大带，但是一天之内被剥夺三次。'   // 上爻
    ]
  },
  // 第7卦 地水师
  {
    name: '地水师',
    yao: [
      '军队出动要按照军纪，不顺从的，将有凶祸。',  // 初爻
      '率领军队而能守中，吉祥而没有灾难，君王三次赐命嘉奖。',  // 二爻
      '军队或许会载着尸体回来，凶祸。',  // 三爻
      '军队后退驻扎，没有灾难。',  // 四爻
      '田里有禽兽，适宜说明捕获的理由，没有灾难。长子统率军队，弟子载尸而归，正固会有凶祸。',  // 五爻
      '天子颁赐爵命，封为诸侯可以开国，封为大夫可以立家，对小人则不要任用。'   // 上爻
    ]
  },
  // 第8卦 水地比
  {
    name: '水地比',
    yao: [
      '有诚信，去亲近依靠，没有灾难。有诚信如同瓦罐盈满，会有另外的吉祥最后来到。',  // 初爻
      '从内部去亲近依靠，正固吉祥。',  // 二爻
      '亲近依靠的都是不适当的人。',  // 三爻
      '向外去亲近依靠，正固吉祥。',  // 四爻
      '发扬亲近依靠的作风。君王用三驱之礼狩猎，失去往前跑的禽兽。国中的人没有戒惧，吉祥。',  // 五爻
      '要亲近依靠却没有开始的机会，凶祸。'   // 上爻
    ]
  },
  // 第9卦 风天小畜
  {
    name: '风天小畜',
    yao: [
      '循着正路回来，会有什么灾难？吉祥。',
      '由牵连而回来，吉祥。',
      '大车脱落辐条，夫妻反目失和。',
      '有诚信，避开流血并走出戒惧，没有灾难。',
      '有诚信而系念着，要与邻居一起富裕。',
      '已经下了雨，已经可以安居，要推崇道德满载。妇女正固会有危险。月亮快要满盈，君子前进会遭凶祸。'
    ]
  },
  // 第10卦 天泽履
  {
    name: '天泽履',
    yao: [
      '按平常的践履方式前往，没有灾难。',
      '所走的路平坦宽阔，幽隐的人正固吉祥。',
      '眼有疾还能看，脚跛了还能走。踩在老虎尾巴上，老虎咬人，凶祸。勇武之人要做大王。',
      '踩在老虎尾巴上，戒慎恐惧，最后吉祥。',
      '刚决履行，正固有危险。',
      '审视走过的路，考察吉凶祸福，如此返回最为吉祥。'
    ]
  },
  // 第11卦 地天泰
  {
    name: '地天泰',
    yao: [
      '拔取茅草，根茎牵连着同类，向前推进而吉祥。',
      '包容广阔，徒步过河，不因遥远而有所遗漏，失去朋党，守中而行受到推崇。',
      '没有只平坦而不倾斜的，没有只前往而不返回的。在艰难中正固没有灾难。不必担忧，保持诚信，在食物上有福可享。',
      '轻松而不靠财富就得到邻居支持，由于诚信而不加戒备。',
      '帝乙嫁来妹妹，以此得福最为吉祥。',
      '城墙倒塌在壕沟里，不要出动军队。从乡邑传来命令，正固将有困准'
    ]
  },
  // 第12卦 天地否
  {
    name: '天地否',
    yao: [
      '拔取茅草，根茎牵连着同类，正固吉祥，通达。',
      '包容承载，小人吉祥，大人闭塞，通达。',
      '包藏羞耻。',
      '有所受命，没有灾难，众人依附而得福。',
      '终止闭塞，大人吉祥。想到要灭亡了，要灭亡了，这样才会系在大桑树上。',
      '倾覆闭塞的现象，先闭塞然后喜悦。'
    ]
  },
  // 第13卦 天火同人
  {
    name: '天火同人',
    yao: [
      '在门外聚合众人，没有责难。',
      '在宗族里聚合众人，鄙陋。',
      '在草莽中埋伏士兵，或者登上高陵瞻望，三年不能发动攻击。',
      '登上城墙，却不能进攻，吉祥。',
      '聚合众人，先是痛哭后是欢笑，大部队能够会合。',
      '聚合众人于郊外，没有懊恼。'
    ]
  },
  // 第14卦 火天大有
  {
    name: '火天大有',
    yao: [
      '没有因为交往所带来的害处，这不是灾难，在艰困中就没有灾难。',
      '用大车来装载，有所前往，没有灾难。',
      '公侯接受天子的款待，小人不能如此。',
      '不仗恃他的盛大，没有灾难。',
      '以诚信来交往的样子，展现威望的样子，吉祥。',
      '获得天的助佑，吉祥而无所不利。'
    ]
  },
  // 第15卦 地山谦
  {
    name: '地山谦',
    yao: [
      '谦而又谦的君子，可以渡过大河，吉祥。',
      '响应谦卑的态度，正固吉祥。',
      '有功劳而谦卑的君子，有好结果，吉祥。',
      '没有任何不适宜的事，只要发挥谦卑的精神。',
      '不靠财富就得到邻居支持，适宜进行征战，没有不利的事。',
      '响应谦卑的态度，适宜派遣军队，讨伐属邑小国。'
    ]
  },
  // 第16卦 雷地豫
  {
    name: '雷地豫',
    yao: [
      '响应愉悦的态度，有凶祸。',
      '耿介如坚石，不用一整天，正固吉祥。',
      '向上瞻望而愉悦，懊恼。行动迟缓也有懊恼。',
      '由此而产生愉悦。大有收获。不必疑虑，朋友都来聚合。',
      '正固会有疾病，但总不至于死亡。',
      '在昏昧中愉悦，最后出现改变。没有灾难。'
    ]
  },
  // 第17卦 泽雷随
  {
    name: '泽雷随',
    yao: [
      '官员有变通，正固吉祥。出门与人交往会有功绩。',
      '系住小孩，失去丈夫。',
      '系住丈夫，失去小孩。随从而有所求，可以得到。适宜守住正固。',
      '随从而有收获，正固带来凶祸。保持诚信，以明智处于正道，会有什么灾难？',
      '对美善之事保持诚信，吉祥。',
      '把他抓住捆起来，后来又放开他。君王在西山献祭。'
    ]
  },
  // 第18卦 山风蛊
  {
    name: '山风蛊',
    yao: [
      '救治父亲留下的积弊，才是好儿子，他使亡父没有受人责难。这样做会有危险，但最后吉祥。',
      '救治母亲留下的积弊，不可正固。',
      '救治父亲留下的积弊，有小的懊恼，没有大的灾难。',
      '宽容对待父亲留下的积弊，前往会陷入困境。',
      '救治父亲留下的积弊，受到称誉。',
      '不去侍奉王候，以高尚来要求自己的作为。'
    ]
  },
  // 第19卦 地泽临
  {
    name: '地泽临',
    yao: [
      '一起来临，正固吉祥。',
      '一起来临，吉祥，没有不适宜的。',
      '以和柔态度对待来临者，没有什么利益。已经对此忧虑，就没有灾难了。',
      '直接面对来临者，没有灾难。',
      '以明智态度面对来临者，这是伟大君主的合宜表现，吉祥。',
      '以敦厚态度面对来临者，吉祥，没有灾难。'
    ]
  },
  // 第20卦 风地观
  {
    name: '风地观',
    yao: [
      '像孩童那样观看，小人没有灾难，君子就有困难，',
      '从门缝向外观看，适宜女子正固。',
      '观察我的生民，再决定该进或该退。',
      '观察国家的政教光辉，适宜从政追随君王。',
      '观察我的生民，君子没有灾难。',
      '观察他的生民，君子没有灾难。'
    ]
  },
  // 第21卦 火雷噬嗑
  {
    name: '火雷噬嗑',
    yao: [
      '戴上脚枷，遮住脚趾，没有灾难。',
      '咬食肥肉，鼻子没入，没有灾难。',
      '咬食腊肉，遇到有毒的部分。有小的困难，没有灾难。',
      '咬食骨头上的干肉，获得金属箭头。适宜在艰难中正固，吉祥。',
      '咬食干肉，获得黄金。正固有危险，但没有灾难。',
      '肩扛着枷，遮住耳朵，有凶祸。'
    ]
  },
  // 第22卦 山火贲
  {
    name: '山火贲',
    yao: [
      '文饰脚趾，舍弃车子而徒步行走。',
      '文饰胡须。',
      '有文饰的样子，润泽的样子，长久正固吉祥。',
      '有文饰的样子，洁白的样子，白马壮硕的样子。不是强盗，而是来求婚配的。',
      '所文饰的是丘山田园，只用很少的一束布帛。有困难，最后吉祥。',
      '用白色来文饰，没有灾难。'
    ]
  },
  // 第23卦 山地剥
  {
    name: '山地剥',
    yao: [
      '剥蚀床脚，除去正固，有凶祸。',
      '剥蚀床腿，除去正固，有凶祸。',
      '剥蚀它，没有灾难。',
      '剥蚀床席，有凶祸。',
      '连成一串鱼。以宫人身份获得宠爱，没有不利。',
      '硕大的果子没有人吃，在君子将获得车马，在小人将剥除屋宇。'
    ]
  },
  // 第24卦 地雷复
  {
    name: '地雷复',
    yao: [
      '走得不远就返回，没有到懊恼的程度，最为吉祥。',
      '停下来返回，吉祥。',
      '再三地返回，有危险但没有灾难。',
      '走在行列中间而独自返回。',
      '敦厚地返回，没有懊恼。',
      '在迷惑中返回，有凶祸。出现危难与灾祸。发动军队作战，最后会大败，对国君的凶祸最大，甚至十年之内都不能再用兵。'
    ]
  },
  // 第25卦 天雷无妄
  {
    name: '天雷无妄',
    yao: [
      '没有虚妄，前往吉祥。',
      '不耕种却有收获，不垦荒却有热田，那就适宜前往了。',
      '没有虚妄却遇上灾难。有人拴了一头牛，过路人把它牵走，村里人遭殃。',
      '可以正固，没有灾难。',
      '没有虚妄却生了病，不用吃药也会痊愈。',
      '没有虚妄，行动会遇到灾祸，没有任何好处。'
    ]
  },
  // 第26卦 山天大畜
  {
    name: '山天大畜',
    yao: [
      '有危险，适宜停止。',
      '车厢脱离了车轴。',
      '骏马奔驰，适宜在艰难中正固。每天练习驾车与防卫，适宜有所前往。',
      '小牛在角上绑了横木，最为吉祥。',
      '阉猪口中的牙，吉祥。',
      '位处上天所赐的通路，通达。'
    ]
  },
  // 第27卦 山雷颐
  {
    name: '山雷颐',
    yao: [
      '抛弃你的大乌龟，看着我嚼食东西，有凶祸。',
      '颠倒养育方式，违背了常理；往高处求养育，前进有凶祸。',
      '违背养育方式，正固有凶祸。十年不能有所作为，没有任何适宜的事。',
      '颠倒养育方式，吉祥。像老虎般瞪视，欲望接连而来，没有灾难。',
      '违背常理，守住正固就吉祥。不可以渡过大河。',
      '由此而得养育，危险而吉祥。适宜渡过大河。'
    ]
  },
  // 第28卦 泽风大过
  {
    name: '泽风大过',
    yao: [
      '用白色茅草垫在底下，没有灾难。',
      '干枯的杨树长出新的枝叶，老头子获得少女为妻，没有不适宜的事。',
      '栋梁弯曲，有凶祸。',
      '栋梁隆起，吉祥。会有别的困难。',
      '干枯的杨树长出花朵，老妇人获得壮男为夫，没有责难也没有荣誉。',
      '发大水时渡河，淹没了头顶，有凶祸，但没有责难。'
    ]
  },
  // 第29卦 坎为水
  {
    name: '坎为水',
    yao: [
      '在重重险阻中，掉入陷阱。有凶祸。',
      '坎陷中出现险阻，求取小的会有收获。',
      '来去都是险阻，险难还到处遍布。掉入陷阱，不可有所作为。',
      '一盅酒与两盘供品，用瓦盆盛着。从窗户送进简约的祭品，终究没有灾难。',
      '坎陷尚未满盈，抵达齐平的程度。没有灾难。',
      '用绳索捆绑起来，放在牢狱中，三年不能出来，有凶祸。'
    ]
  },
  // 第30卦 离为火
  {
    name: '离为火',
    yao: [
      '脚步中规中矩。采取恭敬态度，没有灾难。',
      '黄色的附丽，最为吉祥。',
      '太阳西斜的附丽。不能敲着瓦盆唱歌，就会发出垂老之人的哀叹，有凶祸。',
      '贸然闯进来的样子，灼热的样子，没命的样子，被弃的样子。',
      '眼泪涌出的样子，悲痛哀叹的样子。吉祥。',
      '君王可以出兵征伐，会有功劳。斩了首领，俘获的不是一般随从，没有灾难。'
    ]
  },
  // 第31卦 泽山咸
  {
    name: '泽山咸',
    yao: [
      '感应到脚的拇指。',
      '感应到小腿肚上，有凶祸，安居就会吉祥。',
      '感应到了大腿，控制住跟随的动作，前往会有困难。',
      '正固吉祥而懊恼消失，忙着来来往往，朋友跟从你的想法。',
      '感应到了后背上，没有懊恼。',
      '感应到牙床、脸颊、舌头。'
    ]
  },
  // 第32卦 雷风恒
  {
    name: '雷风恒',
    yao: [
      '深入追求恒久，正固会有凶祸，没有任何适宜的事。',
      '懊恼消失。',
      '不能恒守德行的人，常常会受到羞辱，正固会有困难。',
      '打猎而没有获得禽兽。',
      '恒守自己的德行，正固。对女子吉祥，对男子有凶祸。',
      '震动长久不停，有凶祸。'
    ]
  },
  // 第33卦 天山遁
  {
    name: '天山遁',
    yao: [
      '退避时居后尾随，有危险。不可以有所前往。',
      '用黄牛皮制成的绳子捆住，没有人能够解开。',
      '系住退避，出现疾病与危险。蓄养奴仆侍妾，吉祥。',
      '合宜的退避。君子吉祥，小人困阻。',
      '美好的退避，正固吉祥。',
      '高飞而走的退避，无所不利。'
    ]
  },
  // 第34卦 雷天大壮
  {
    name: '雷天大壮',
    yao: [
      '强壮在脚趾上，前进会有凶祸，但仍有信实。',
      '正固吉祥。',
      '小人仗恃的是强壮，君子凭借的是蔑视，正固会有危险。公羊冲撞藩篱，卡住了羊角。',
      '正固吉祥而懊恼消失，藩篱裂开不再缠住，因为大车的车輹十分坚固。',
      '在边界失去羊，没有懊恼。',
      '公羊冲撞藩篱，不能退后，也不能如意，没有任何适宜的事。在艰难中才会吉祥。'
    ]
  },
  // 第35卦 火地晋
  {
    name: '火地晋',
    yao: [
      '进展的样子，拥挤的样子，正固吉祥。未受信任，宽裕，没有灾难。',
      '进展的样子，忧愁的样子，正固吉祥。从王母那儿蒙受这样的大福。',
      '众人答应追随，懊恼消失。',
      '进展像梧鼠一样，正固会有危险。',
      '懊恼消失，不用顾虑损失与获得，前往吉祥，没有不适宜的事。',
      '进展到头上的角，可以用来征伐属国。有危险，吉祥而没有灾难，正固会有困难。'
    ]
  },
  // 第36卦 地火明夷
  {
    name: '地火明夷',
    yao: [
      '在昏暗中去飞翔，垂下翅膀。君子要出行，三天不吃东西。有所前往，主人说出责怪的话。',
      '在昏暗中，伤到左股，用来拯救的马强壮，吉祥。',
      '在昏暗中，去南方狩猎，获得大首领，不可过于急切，要正固。',
      '进入到左腹部，得知昏暗者的心思，往外走出门庭。',
      '像箕子那样处于昏暗中，适宜正固。',
      '没有任何光明，一片晦暗。起初升到天上，后来陷入地下。'
    ]
  },
  // 第37卦 风火家人
  {
    name: '风火家人',
    yao: [
      '家中做好防范措施，懊恼消失。',
      '不可随心所欲，要主持家庭中的饮食。正固吉祥。',
      '家中有训斥之声，会带来懊恼及危险，但还是吉祥。若是妇女孩子放肆嬉笑，最终会有困难。',
      '使家庭富裕，非常吉祥。',
      '君王来到家中，不必忧愁，吉祥。',
      '有诚信而有威严的样子，最终吉祥。'
    ]
  },
  // 第38卦 火泽睽
  {
    name: '火泽睽',
    yao: [
      '懊恼消失，丢失的马不必追寻，自己会回来。见到恶人，没有灾难。',
      '在巷子中遇见主人，没有灾难。',
      '看到车往前拉，牛却往后拖。车夫受过断发割鼻的刑罚，起初不好而最后有结果。',
      '乖离而孤独，遇到有为之士。互相信任，有危险但没有灾难。',
      '懊恼消失，他的宗人在吃肉，前往有什么灾难？',
      '乖离而孤独，见到猪背上都是泥，载了一车的鬼。先张开弓，后来放下弓。不是强盗而是要来婚配的，前往遇到下雨就吉祥。'
    ]
  },
  // 第39卦 水山蹇
  {
    name: '水山蹇',
    yao: [
      '前往有险难，回来有称誉。',
      '君王的臣子遇到重重险难，不是为了自己的缘故。',
      '前往有险难，又返回来。',
      '前往有险难，回来有连接。',
      '在大的险难中，朋友来到。',
      '前往有险难，回来有丰收，吉祥。适宜见到大人。'
    ]
  },
  // 第40卦 雷水解
  {
    name: '雷水解',
    yao: [
      '没有灾难。',
      '打猎抓到三只狐狸，获得黄色箭头，正固吉祥。',
      '背着东西坐在车上，招来了强盗，正固有困难。',
      '解开你的脚拇指，朋友来到才会有诚信。',
      '君子来纾解，吉祥，对小人有诚信。',
      '王公去射高墙上的鹞鹰，擒获它就无所不利。'
    ]
  },
  // 第41卦 山泽损
  {
    name: '山泽损',
    yao: [
      '办成了事就赶快前往，没有灾难。要酌量减损。',
      '适宜正固，前进有凶祸。不要减损，就有增益。',
      '三人一起行走，就会减去一人；一人行走，就会得到友伴。',
      '减损他的疾病，让他赶快有喜庆，没有灾难。',
      '有人增益他价值十朋的龟，不能拒绝，最为吉祥。',
      '不是减损，而要增益，没有灾难，正固吉祥。适宜有所前往，得到臣民而没有自己的家。'
    ]
  },
  // 第42卦 风雷益
  {
    name: '风雷益',
    yao: [
      '适宜用来推动大事，最为吉祥，没有灾难。',
      '有人增益他价值十朋的龟，不能拒绝，长久正固吉祥。君王用以祭献上帝，吉祥。',
      '用增益之物救助灾荒，没有灾难。有诚信而行中道，用珍圭告知王公。',
      '行中道，告知王公跟从，适宜用来做依靠而迁移国都。',
      '有真诚施惠之心，不必占问也最为吉祥。实实在在感念我的恩德。',
      '没有人来增益他，却有人来打击他，所立定的心思无法长期守住，有凶祸。'
    ]
  },
  // 第43卦 泽天夬
  {
    name: '泽天夬',
    yao: [
      '前进的脚趾壮健，前往而不能胜任，就是灾难。',
      '戒惕而有呼号，夜晚会出现兵寇，不必担忧。',
      '颧骨壮健，会出现凶祸。君子果敢决断而独自前行，遇雨打湿衣服，有怒气，但没有灾难。',
      '臀部没有皮肤，行走十分艰难。牵羊而进，懊恼就会消失，但是听到这话却不相信。',
      '山羊果敢决断的样子，居中而行没有灾难。',
      '不用呼号，最终会有凶祸。'
    ]
  },
  // 第44卦 天风姤
  {
    name: '天风姤',
    yao: [
      '捆缚在缫车的金属横杠上，正固吉祥。有所前往，会见到凶祸。拴缚住的猪确实在跳动挣扎。',
      '包裹中有鱼，没有灾难，不适宜招待宾客。',
      '臀部没有皮肤，行走十分艰难。有危险，但没有大灾难。',
      '包裹中没有鱼，发起行动会有凶祸。',
      '用杞树叶子包起瓜果，其内含藏文采，从天上掉落下来。',
      '遇到头上的角，有困难，没有灾难。'
    ]
  },
  // 第45卦 泽地萃
  {
    name: '泽地萃',
    yao: [
      '有诚信而不能坚持到底，于是散乱于是聚集。如果号哭，一握手就笑了。不必担忧，前往没有灾难。',
      '牵引到吉祥，没有灾难。有诚信，所以适宜举行禴祭。',
      '聚集的样子，叹息的样子，没有任何适宜的事。前往没有灾难，但有小的困难。',
      '非常吉祥，没有灾难。',
      '聚众而拥有君位，没有灾难，但缺少诚信。开始恒守正固，懊恼就会消失。',
      '悲伤叹息而泪涕满面，没有灾难。'
    ]
  },
  // 第46卦 地风升
  {
    name: '地风升',
    yao: [
      '由信赖而升进，非常吉祥。',
      '有诚信，所以适宜举行禴祭，没有灾难。',
      '升进到荒废的村落。',
      '君王在岐山祭献，吉祥，没有灾难。',
      '正固吉祥，登上台阶。',
      '在昏昧中升进，适宜不成长的正固。'
    ]
  },
  // 第47卦 泽水困
  {
    name: '泽水困',
    yao: [
      '臀部困陷在枯木中，进入幽暗的山谷，三年不能相见。',
      '困处于酒食中，大红官服刚刚送来，适宜用来祭献。前进会有凶祸，没有灾难。',
      '困处于石块中，倚靠在蒺藜上。进入宫室，没见到妻子，有凶祸。',
      '要慢慢下来，困处于金车中，有困难，但会有结果。',
      '鼻被割去，足被砍去，困处于红色官服中。于是慢慢行动，可以脱离困境，适宜举行祭祀。',
      '因处于藤蔓之间，于高危之地，这称为因行动而恼。有了这种悔悟，往前进就吉祥。'
    ]
  },
  // 第48卦 水风井
  {
    name: '水风井',
    yao: [
      '满是淤泥的井水不能食用，旧的水井没有禽兽来。',
      '井中积水向下流注，水罐又破又漏。',
      '井淘干净而不去食用，使我内心感到悲伤。可以用来汲水，君王英明，大家一起受到福佑。',
      '井的内壁砌好了，没有灾难。',
      '井中有甘洁清凉的泉水，可以食用。',
      '井口收拢而不要加盖，有诚信而最为吉祥。'
    ]
  },
  // 第49卦 泽火革
  {
    name: '泽火革',
    yao: [
      '用黄牛皮做的绳子来捆绑。',
      '到了己日才来变革。前进吉祥，没有灾难。',
      '前进有凶祸，正固有危险。变革之言三度符合，才有诚信。',
      '懊恼消失，有诚信，改变天命，吉祥。',
      '大人改变而形貌如虎，尚未占问就有了诚信。',
      '君子改变而形貌如豹，小人变换他的面目。前进有凶祸，守住正固就吉祥。'
    ]
  },
  // 第50卦 火风鼎
  {
    name: '火风鼎',
    yao: [
      '鼎足颠倒，适宜走出闭塞。因为儿子而娶得妾，没有灾难。',
      '鼎中有实在物料，我的对头患了病，没有办法接近我，吉祥。',
      '鼎耳被革除，行动受到困阻，吃不到山鸡的美味。正在下雨，既吃亏又懊恼，最后吉祥。',
      '鼎足折断，打翻了王公的粥，自己身上也沾染上了，有凶祸。',
      '鼎有黄色的耳与金制的铉，适宜正固。',
      '鼎有玉制的铉，非常吉祥，无所不利。'
    ]
  },
  // 第51卦 震为雷
  {
    name: '震为雷',
    yao: [
      '震动起来惊慌不安，然后笑语之声稳定合宜，吉祥。',
      '震动起来有危险，大量丧失了钱币。登上九重山陵，不要去追赶，七天可以失而复得',
      '震动得微微发抖，因为震惊而行动，就没有灾害。',
      '震动得落入泥中。',
      '震动时，往来都有危险，没有大量丧失，但发生事故。',
      '震动得浑身颤抖，惊恐得四处张望，前进有凶祸。震动不在自己身而在邻居那儿，就没有灾难。婚配会出现怨言。'
    ]
  },
  // 第52卦 艮为山
  {
    name: '艮为山',
    yao: [
      '止住脚趾，没有灾难。适宜长久正固。',
      '止住小腿，不抬起来又须随着动，内心不痛快。',
      '止住腰部，撕裂脊肉，有危险而忧心如焚。',
      '止住身体，没有灾难。',
      '止住上牙床，说话有条理，懊恼消失。',
      '笃实地止住，吉祥。'
    ]
  },
  // 第53卦 风山渐
  {
    name: '风山渐',
    yao: [
      '大雁渐进到水岸边，年轻人有危险，有些责言，没有灾难',
      '大雁渐进到磐石上，饮食和乐的样子，吉祥。',
      '大雁渐进到台地上，丈夫出征不回来，妇女怀孕不生育，有凶祸。适宜抵抗强盗。',
      '大雁渐进到树木上，或者停在屋椽上，没有灾难。',
      '大雁渐进到山陵上，妇女三年不怀孕，最后没有人能够胜过她，吉祥。',
      '大雁渐进到台地上，羽毛可以用在礼仪中，吉祥。'
    ]
  },
  // 第54卦 雷泽归妹
  {
    name: '雷泽归妹',
    yao: [
      '嫁妹妹时，以娣陪嫁。脚跛了还能走，前进吉祥。',
      '眼有疾还能看，适宜幽隐的人保持正固。',
      '嫁妹妹时，以妾陪嫁，还要回去再以娣陪嫁。',
      '嫁妹妹延误了婚期，晚些出嫁也会有一定的时候。',
      '帝乙嫁妹妹，这位女君的服饰还没有娣的服饰那么华美。月亮快到满盈的时候，吉祥。',
      '女子捧着竹筐，里面是空的；士人宰杀活羊，无法取得血，没有什么适宜的事。'
    ]
  },
  // 第55卦 雷火丰
  {
    name: '雷火丰',
    yao: [
      '遇到与自己搭配的主人，虽然彼此均等，但是没有灾难，前往会有好事',
      '很大的遮蔽范围，中午见到了星斗。前往会受到怀疑猜忌。有诚信而表现的样子，吉祥。',
      '很大的阴暗范围，中午见到小星星。折断了右臂，没有灾难。',
      '很大的遮蔽范围，中午见到了星斗。遇到与自己平等的主人，吉祥。',
      '来到的是光明，有喜庆与名声，吉祥。',
      '房屋很高大，居室被遮蔽；从门口窥视，寂静不见人；三年不能见面，有凶祸，'
    ]
  },
  // 第56卦 火山旅
  {
    name: '火山旅',
    yao: [
      '旅行时猥猥琐琐，这是他自取的灾害。',
      '旅行到了馆舍住下，身上带着旅费，得到童仆，可以正固。',
      '旅行时大火烧了馆舍，失去了童仆，有危险。',
      '旅行到了某个地方，获得旅费与用具，我心里不愉快。',
      '射野鸡，丢失一支箭，最后会有名声与禄位。',
      '鸟的巢被火烧掉，旅行的人先是大笑后来大哭。在边界丢失了牛，有凶祸。'
    ]
  },
  // 第57卦 巽为风
  {
    name: '巽为风',
    yao: [
      '进退不定，适宜武人的正固。',
      '随顺进入床底下，让祝史与巫觋纷纷发言，吉祥，没有灾难',
      '频繁地重复命令，会有困难。',
      '懊恼消失，打猎获得三种动物。',
      '正固吉祥，懊恼消失，没有不适宜的事。没有开始但有结果。庚日的前三天，庚日的后三天，吉祥。',
      '随顺进入床底下，失去钱财与用具，正固有凶祸。'
    ]
  },
  // 第58卦 兑为泽
  {
    name: '兑为泽',
    yao: [
      '应和而喜悦，吉祥。',
      '诚信而喜悦，吉祥，懊恼消失。',
      '来到而喜悦，有凶祸。',
      '商量而喜悦，还不能安定；隔开了疾病，就会有好事。',
      '受到衰退的人信赖，有危险。',
      '牵引而喜悦。'
    ]
  },
  // 第59卦 风水涣
  {
    name: '风水涣',
    yao: [
      '用来拯救的马强壮，吉祥。',
      '离散而奔向几案，懊恼消失。',
      '涣散了自己，没有懊恼。',
      '涣散了同类，最为吉祥。涣散之后聚为山丘，不是平常所能想到的。',
      '散发广布，大的政令散发出去，君王安居，没有灾难。',
      '涣散了血灾，离开而远走，没有灾难。'
    ]
  },
  // 第60卦 水泽节
  {
    name: '水泽节',
    yao: [
      '不离开门户与庭院，没有灾难。',
      '不走出门户与庭院，有凶祸。',
      '没有节制的样子，就会出现悲叹的样子，没有责难。',
      '安定的节制，通达。',
      '甘美的节制，吉祥，前往受到推崇。',
      '苦涩的节制，正固会有凶祸，懊恼消失。'
    ]
  },
  // 第61卦 风泽中孚
  {
    name: '风泽中孚',
    yao: [
      '可预料就吉祥，有其他状况则不安。',
      '大鹤在树荫下啼叫，它的小鹤啼叫应和。我有美酒一罐，我要与你共享。',
      '遇到对手，或击鼓或休兵，或哭泣或唱歌。',
      '月亮已经满盈，马匹丢失，没有灾难。',
      '有诚信而系念着，没有灾难。',
      '鸡啼的声音传升到天上，正固会有凶祸。'
    ]
  },
  // 第62卦 雷山小过
  {
    name: '雷山小过',
    yao: [
      '飞鸟会带来凶祸。',
      '越过了祖父，遇到了母亲；没有赶上君王，遇到了臣子，没有灾难。',
      '不要越过而要防范，跟着去可能受到伤害，有凶祸。',
      '没有灾难。不要越过也会遇到，前往有危险，一定要警戒。不可以有所作为，长久保持正固。',
      '浓云密布而不下雨，从我西边的郊野飘聚过去。王公射箭猎取穴中之物。',
      '没有相遇，越过去了，飞鸟陷入罗网，有凶祸。这叫做天灾人祸。'
    ]
  },
  // 第63卦 水火既济
  {
    name: '水火既济',
    yao: [
      '拉住车轮，浸湿尾巴，没有灾难。',
      '妇人丢了头饰，不用寻找，七天可以失而复得。',
      '高宗讨伐鬼方，三年才征服。不可任用小人。',
      '彩色绢帛也会变成破旧衣服，整天都在警戒。',
      '东邻杀牛举行大祭，还比不上西邻的简单禴祭，可以真正受到福佑。',
      '浸湿了头，有危险。'
    ]
  },
  // 第64卦 火水未济
  {
    name: '火水未济',
    yao: [
      '浸湿了尾巴，有困难。',
      '拉住车轮，正固吉祥。',
      '尚未渡过，前进会有凶祸。适宜渡过大河。',
      '正固吉祥，懊恼消失，振奋起来讨伐鬼方。三年后成功，受到大国封赏。',
      '正固吉祥，没有懊恼，君子的光明在照耀。有诚信，吉祥。',
      '有诚信而去喝酒，没有灾难。浸湿了头，有诚信也无法没有灾难。'
    ]
  }

];